{
  "0": {
    "content": "Department of Homeland Security 1-20, Certificate of Eligibility for Nonimmigrant Student Status U.S. Immigration and Customs Enforcement OMB NO. 1653-0038 SEVIS ID: NO0024747275 SURNAME/PRIMARY NAME GIVEN NAME Class of Admission Jin Zhechao PREFERRED NAME PASSPORT NAME Zhechao Jin COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP —_ CHINA CHINA CITY OF BIRTH DATE OF BIRTH Shanghai 22 JANUARY 1997 ACADEMIC AND FORM ISSUE REASON ADMISSION NUMBER LANGUAGE Transfer Pending - University of Pennsylvania SCHOOL INFORMATION SCHOOL NAME SCHOOL ADDRESS Northeastern University 360 HUNTINGTON AVE, C/O Office of Global Services, Northeastern University-Silicon Valley BOSTON, MA 02115 SCHOOL OFFICIAL TO CONTACT UPON ARRIVAL SCHOOL CODE AND APPROVAL DATE Juan Taitague BOS214F00257003 International Student & Scholar Advisor 22 JANUARY 2003 PROGRAM OF STUDY EDUCATION LEVEL MAJOR 1 MAJOR 2 MASTER'S Computer and Information Sciences, None 00.0000 General 11.0101 PROGRAM ENGLISH PROFICIENCY ENGLISH PROFICIENCY NOTES EARLIEST ADMISSION DATE Required Student is proficient START OF CLASSES PROGRAM START/END DATE 06 SEPTEMBER 2023 06 SEPTEMBER 2023 - 29 AUGUST 2026 FINANCIALS ESTIMATED AVERAGE COSTS FOR: 8 MONTHS STUDENT'S FUNDING FOR: 8 MONTHS Tuition and Fees S 28,995 Personal Funds S$ 60,000 Living Expenses $ 29,340 Funds From This School $ Expenses of Dependents (0) i) Funds From Another Source i) Other 5 On-Campus Employment 5 TOTAL 5S 58,335 TOTAL $ 60,000 REMARKS Student is accepted into the MS in Computer Science ALIGN program in Khoury College of Computer Sciences based on 6 semesters program of study. Student's program of study is located at 4 North 2nd Street, San Jose, CA 95113, Northeastern University site in San Jose, CA. SCHOOL ATTESTATION T certify under penalty of perjury that all information provided above was entered before I signed this form and is truc and correct. | executed this form im the United States after review and evaluation in the United States by me or other officials of the school of the student's application, transcripts, or other records of courses taken and proot of financial responsibility, which were received at the school prior to the execution of this form. The school has determined that the above named students qualifications meet all standards for admission to the school and the student will be required to pursue a full program of study as defined by 8 CFR 214.2(f)(6). Iam a designated school offjcial of the above wypned schog] anc te. to issue this form. xX A Ath Ln / CL DATE ISSUED PLACE ISSUED SIGNATURE Faan Taitague, International Student & 08 June 2023 BOSTON, MA Scholar Advisor STUDENT ATTESTATION I have read and agreed to comply with the terms and conditions of my admission and those of any extension of stay. I certify that all information provided on this form refers specifically to me and is true and correct to the best of my knowledge. I certify that I seek to enter or remain in the United States temporarily, and solely for the purpose of pursuing a full program of study at the school named above. I also authorize the named school to",
    "source": "i20.pdf",
    "uploaded_at": "2025-05-19T10:14:23.883050"
  },
  "1": {
    "content": "me and is true and correct to the best of my knowledge. I certify that I seek to enter or remain in the United States temporarily, and solely for the purpose of pursuing a full program of study at the school named above. I also authorize the named school to release any information from my records needed by DHS putsuant to 8 CFR 214°3(g) to determine my noniminigrant status. Parent or guardian, and student, must sign if student is under 13. xX SIGNATURE OF; Zhechao Jin DATE 4 NAME OF PARENT OR GUARDIAN SIGNATURE ADDRESS (city/state or province/country) DATE ICE Form I-20 (04/30/2021) Page | of 3",
    "source": "i20.pdf",
    "uploaded_at": "2025-05-19T10:14:23.883050"
  },
  "2": {
    "content": "Department of Homeland Security 1-20, Certificate of Eligibility for Nonimmigrant Student Status U.S. Immigration and Customs Enforcement OMB NO. 1653-0038 SEVIS ID: NO024747275 (F-1) NAME: Zhechao Jin EMPLOYMENT AUTHORIZATIONS CHANGE OF STATUS/CAP-GAP EXTENSION AUTHORIZED REDUCED COURSE LOAD CURRENT SESSION DATES CURRENT SESSION START DATE CURRENT SESSION END DATE TRAVEL ENDORSEMENT This page, when properly endorsed, may be used for re-entry of the student to attend the same school after a temporary absence from the United States: Each endorsement is valid for one year. Designated School Official TITLE SIGNATURE DATE ISSUED PLACE ISSUED x x ICE Form I-20 (04/30/2021) Page 2 of 3",
    "source": "i20.pdf",
    "uploaded_at": "2025-05-19T10:14:23.883050"
  },
  "3": {
    "content": "Department of Homeland Security U.S. Immigration and Customs Enforcement 1-20, Certificate of Eligibility for Nonimmigrant Student Status OMB NO. 1653-0038 INSTRUCTIONS TO STUDENTS STUDENT ATTESTATION, You should read everything on this page carefully. Be sure that you understand the terms and conditions concerning your admission and stay in the United States as a nonimmigrant student before signing the student aticstation on page | of the Form 1-20 A-B: The law provides severe penalties for knowingly and willfully falsifying or concealing a material fact, or using any false document in the submission of this form, FORM I-20. The Form I-20 (this form) is the primary document to show that you have been adimitied to school in the United States and that you are authorized to apply for admission to the United States in F-1 class of admission. You must have your Form 1-20 with you at all times. If you lose your Form I-20, you must request a new one from your designated school official (DSO) at the school named on your Form I-20, VISA APPLICATION. You must give this Form I-20 to the U.S. consular Officer at the time you apply for a visa (unless you are exempt from visa requirements). If you have a Form 1-20 from more than one school, be sure to present the Form I-20 for the school you plan to attend. Your visa will include the name of that school, and you must attend that school upon entering the United States: You must also provide evidence of support for tuition and fees and living expenses while you are in the United States: ADMISSION. When you enter the United States, you must present the following docuinents to the officer at the port of entry: 1) a Form 1-20; 2) a valid F-1 visa(unless you are exempt from visa requirements); 3) a valid passport; and 4) evidence of support for tuition and fees and living expenses while you are in the United States. The agent should return all documents to you before you leave the inspection area. REPORT TO SCHOOL NAMED ON YOUR FORM I-20 AND VISA. Upon your first entry to the United States, you must report to the DSO at the school named on your Form 1-20 and your P=! visa (unless you are ¢xcempt from visa requirements). If you decide to attend another school before you enter the United States, you must present a Form I-20 from the new school to a U.S” consular officer for a new F-1 visa that names the new school. Failure to enroll in the school, by the program start date on your Form I-20 may result in the loss of your student status and subject you to deportation. EMPLOYMENT. Unlawful employment in the United States is a reason for terminating your F=1 status and deporting you from the United States. You may be employed on campus at your school. You may be employed off-campus in curricular practical training (CPT) if you have written permission from your DSO. You",
    "source": "i20.pdf",
    "uploaded_at": "2025-05-19T10:14:23.883050"
  },
  "4": {
    "content": "EMPLOYMENT. Unlawful employment in the United States is a reason for terminating your F=1 status and deporting you from the United States. You may be employed on campus at your school. You may be employed off-campus in curricular practical training (CPT) if you have written permission from your DSO. You may apply to U.S. Citizenship and Immigration Services (USCIS) for off-campus employment authorization in three circumstances: 1) employment with an international organization, 2) severe and unexpected economic hardship; and 3) optional practical training (OPT) related to your degree, You must have written authorization from USCIS before you begin work. Contact your DSO for details. Your spouse or child (F-2 classification) may not work in the United States PERTOD OF STAY. You may remain in the United States while taking a full course of study or during authorized employment after your program. F-1 status ends and you are required to leave the United States on the earliest of the following dates: 1) the program end date on your Form 1-20 plus 60 days; 2) the end date of your OPT plus 60 days; or 3) the termination of your program for any Other reason. Contact your DSO for details: EXTENSION OF PROGRAM, If you cannot complete the education program by the program cnd date on page | of your Form I-20, you should contact your DSO at least 15 days before the program end date to request an extension. SCHOOL TRANSFER: To transicr schools, first notify the DSO at the school you ate attending of your plan to transfer, then obtain a Form I-20 from the DSO at the school you plan to attend. Return the Form 1-20 for the new school to the DSO at that school within 15 days after beginning attendance at the new school. The DSO will then report the transfer to the Department of Homeland Security (DHS). You must enroll in the new school at the next session start date. The DSO at the new school must update your registration in SEVIS: ICE Form I-20 (04/30/2021) NOTICE OF ADDRESS. When you artive in the United States, you must report your U.S: address to your DSO: If you move, you must notify your DSO of your new address within 10 days of the change of address. The DSO will update SEVIS with your new address. REENTRY. F-! students may leave the United States and return within a period of five months. 16 return, you must have: 1) a valid passport, 2) a valid F- 1 student visa (unless you are exempt from visa requirements), and 3) your Form 1-20, page 2, properly endorsed for reentry by your DSO: If you have been out of the United States for more than five months, contact your DSO AUTHORIZATION TO RELEASE INFORMATION BY SCHOOL. DHS requires your school to provide DHS with your name, country of birth, current address, immigration status, and certain other information on a regular basis or Upon request. Your signature on the Form 1-20 authorizes the",
    "source": "i20.pdf",
    "uploaded_at": "2025-05-19T10:14:23.883050"
  },
  "5": {
    "content": "for more than five months, contact your DSO AUTHORIZATION TO RELEASE INFORMATION BY SCHOOL. DHS requires your school to provide DHS with your name, country of birth, current address, immigration status, and certain other information on a regular basis or Upon request. Your signature on the Form 1-20 authorizes the namicd school to release such information trom your records. PENALTY. 16 maintain your nonimmigrant student status, you must: 1) remain a full-time student at your authorized school; 2) engage only in authorized employment; and 3) kecp your passport valid. Failure to comply with these regulations will result in the loss of your student status and subject you to deportation. INSTRUCTIONS TO SCHOOLS Failure to comply with 8 CFR 2143(k) and 8 CPR 214.4 when issuing Forms I- 20 will subject you and your school to criminal prosecution. If you issue this form improperly, provide false information, or fail to submit required reports, DHS may withdraw its certification of your school for attendance by nonimmigrant students. ISSUANCE OF FORM I-20. DSOs may issue a Form I-20 for any nonimmigrant your school has accepted for a full course of study if that person: 1) plans to apply to enter the United States in F-1 status; 2) is in the United States as an F=1 nonimmigrant and plans to transfer to your school; or 3) is in the United States and will apply to change nonimmigrant status to F-1. DSOs may also issue the Form I-20 to the spouse or child (under the age Of 21) of an F-1 student to use to enter or remain in the United States as an F-2 dependent. DSOs must sign where indicated at the bottom of page | of the Form 1-20 to attest that the form is completed and issued in accordance with regulations. ENDORSEMENT OF PAGE 2 FOR REENTRY. If there have been no substantive changes in information, DSOs may endorse page 2 of the Form 20 for the student and/or the F-2 dependents to reenter the United States. If there have been substantive changes, the DSO should issue and sign a new Form I-20 that mceludes those changes. RECORDKEEPING. DHS may request information concerning the student's immigration status for various reasons. DSOs should retain all evidence of academic ability and financial resources on which admission was based, until SEVIS shows the student's record completed or terminated: AUTHORITY FOR COLLECTING INFORMATION. Authority for collecting the information on this and related student forms is contained in 8 U.S.C. 1101 and 1184. The Department of State and DHS use this information to determine eligibility for the benctits requested: The law provides severe penalties for knowingly and willfully falsifying or concealing a material fact, or using any false document in the submission of this form. REPORTING BURDEN. U.S. Immigration and Customs Enforcement collects this information as part of its agency mission under the Department of Homeland Security. The estimated average tune to review the instructions, search existing data sources, gather and maintain the needed data, and complete",
    "source": "i20.pdf",
    "uploaded_at": "2025-05-19T10:14:23.883050"
  },
  "6": {
    "content": "false document in the submission of this form. REPORTING BURDEN. U.S. Immigration and Customs Enforcement collects this information as part of its agency mission under the Department of Homeland Security. The estimated average tune to review the instructions, search existing data sources, gather and maintain the needed data, and complete and review the collection of information is 30 minutes (50 hours) per response. An agency may not conduct or sponsor, and a person 1s not required to respond to an information collection unless a form displays a currently valid OMB Control number. Send comments regarding this burden estimate or any other aspect of this collection of information, including suggestions for reducing this burden, to: Office of the Chiet Information Officer/Forms Management Branch, U-S. Immigration and Customs Enforcement: 801 I Sircei NW Stop 5800, Washington, DC 20536- 5800. Do not send the form to this address. Page 3 of 3",
    "source": "i20.pdf",
    "uploaded_at": "2025-05-19T10:14:23.883050"
  }
}