{
  "0": {
    "source": "OPT Practical Training.pdf",
    "content": "SEVIS User Guide g n Contents i General Information 1 n What is Optional Practical Training? 2 i Regulations and Policy Guidance 2 a OPT Types 2 r OPT Request Statuses 3 T OPT Eligibility 3 OPT Process at a Glance 4 l Form I-765 Filing Deadlines Once DSO Requests OPT in SEVIS 5 a Recommend Optional Practical Training 5 c Key Dates 5 i Recommend OPT 6 t c Edit OPT Request 10 Cancel/Withdraw OPT Request 12 a Cancel OPT Request 13 r Withdraw OPT Request 14 P Report OPT Participation 14 Post-completion OPT and Unemployment 15 l a OPT-Related SEVIS Alerts and Lists 15 n View OPT Employment Information 16 H-1B Cap-Gap Extension of OPT 17 o Correcting OPT Data: Correction Requests and Data Fixes 17 i Icon Guide 18 t p O General Information F-1 students often want to work. However, employment opportunities are limited and 1 strict rules apply. This document discusses different types of optional practical training (OPT), as well as, required forms, processes, and updating SEVIS. - F",
    "deleted": true
  },
  "1": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide What is Optional Practical Training? Optional practical training is one type of work permission available for eligible F-1 students. It allows students to get real-world work experience related to their field of study. While a Designated School Official (DSO) recommends OPT in SEVIS, it is the student who must apply for the work permit with the U.S. Citizenship and Immigration Service (USCIS). If the OPT is approved, USCIS will issue an Employment Authorization Document (EAD). The student must not begin working before the start date on the EAD. Regulations and Policy Guidance Complex rules and guidance apply to OPT. Any OPT requests entered into SEVIS must comply with federal regulations. DSOs must understand the following regulations and policy guidance:  8 Code of Federal Regulations (CFR) 214.2(f) (10) through (13)  8 CFR 274a.12(c)(3)  SEVP Policy Guidance on OPT OPT Types There are three general types of OPT: OPT: For students enrolled full-time in post-secondary schools, seminaries, conservatories, or seminaries for one full academic year. Twelve months of practical training is available for each higher level of study. (For example, a student may have 12 months for a bachelor’s degree and another 12 months for a master’s degree.)  Pre-Completion OPT: Any portion of OPT used before the student’s Program End Date. It may be part-time or full- time.  Post-Completion OPT: Any portion of OPT used after the student’s Program End Date. It must be full-time. 17-month (STEM) For students who majored in designated Science, Technology, OPT Extension: Engineering, and Math (STEM) degrees approved by DHS. This type of OPT is a 17-month extension of OPT. Cap-Gap OPT For students whose prospective employers filed a qualifying H-1B Extension: cap-subject petition. December 4, 2015 2",
    "deleted": true
  },
  "2": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide OPT Request Statuses The table below lists the statuses used to identify the stages of OPT requests in SEVIS. Status Status Meaning Requested DSO requested OPT in SEVIS on behalf of the student, but USCIS has not yet received the Application for Employment Authorization (Form I-765). Pending USCIS has received the Form I-765. Approved USCIS has approved the Form I-765. Denied USCIS has denied the Form I-765. Canceled DSO has canceled the OPT request in SEVIS. Withdrawn USCIS approved the student’s request to withdraw the Form I-765. OPT Eligibility A student is eligible for OPT if:  The student has been a full-time student for one academic year in an SEVP-certified: o College o University o Conservatory o Seminary  The student is not studying English as a Second Language.  The student’s proposed employment directly relates to the student’s major area of study.  The student has not used all of the practical training available at the current level of study.  The student has not been authorized for 12 months or more of full-time Curricular Practical Training (CPT). Note: Full-time CPT at a previous school at the same program level counts toward the 12-month total. CPT at another program level does not count toward the 12-month total. December 4, 2015 3",
    "deleted": true
  },
  "3": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide OPT Process at a Glance 6. DSO: 5. Student: Report 1. Student: 2. DSO: 3. Student: 4. USCIS: - Get EAD address Request Recommend File Adjudicate - Start work change and OPT OPT Form I-765 Form I-765 - Reports employer to DSO information The OPT application process involves many players and several steps: Step Users Actions 1 Student follows school processes to submit an OPT request to the DSO. 2  DSO confirms eligibility, enters the request in SEVIS and prints the Form I-20.  The DSO signs the Form I-20.  The status of the OPT request in SEVIS immediately changes to Requested. Note: Any OPT status updates to SEVIS are automatic and require no action on the part of the DSO. 3 Required paperwork:  The student signs the Form I-20.  The student completes an Application for Employment Authorization (Form I-765). The Form I-765, fee, and supporting documentation must be filed with U.S. Citizenship and Immigration Services (USCIS) within 30 days of the DSO’s recommendation. Note: The Form I-765 is available on the USCIS website http://www.uscis.gov/i-765 and can be submitted electronically or by mail. The website provides instructions on both processes. 4  Upon receipt of the I-765, USCIS issues a Receipt Notice (Form I-797), which contains the receipt number assigned to the case.  Through an interface with USCIS, the status of the OPT request in SEVIS changes to Pending.  If USCIS needs more information, the student will receive a Request For Evidence, which states what information is needed and the deadline for submitting it. The student must respond by the deadline, or the application will be denied.  USCIS then makes a decision on the application: o If the application is approved, USCIS issues an EAD, and the OPT Request status in SEVIS changes to Approved. o If the Form I-765 is denied, the OPT Request status in SEVIS changes to December 4, 2015 4",
    "deleted": true
  },
  "4": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide Step Users Actions Denied. 5  The student receives the EAD and can begin work once the authorized date arrives.  When the student is hired, the student reports the employer information to the DSO. Note: While on OPT, the student must report to the DSO within 10 days any changes in the student’s name or address, and employment information. 6 The DSO must update SEVIS within 21 days with the employment information and any name or address changes. Form I-765 Filing Deadlines Once DSO Requests OPT in SEVIS Day 1 Day 30 After Day 30 •DSO •30-day •Applications requests countdown received by OPT in SEVIS ends USCIS after •30-day •USCIS must Day 30 will countdown receive the be denied begins application Note: If the student does not file a Form I-765, the DSO should cancel the OPT request in SEVIS. Recommend Optional Practical Training Key Dates DSOs must be mindful of several key dates when entering OPT in SEVIS. December 4, 2015 5",
    "deleted": true
  },
  "5": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide 1 Year after Full- 90 Days before 60 days after 14 Months after Program End Date Time Studies Begin Program End Date Program End Date Program End date •First date that F-1 •Earliest date that •Pre-Completion •Last date to •Last possible end OPT can be Form I-765 may OPT must end no request post- date for post- requested arrive at USCIS for later than this date completion OPT in completion OPT •Exception: OPT can post-completion SEVIS be requested OPT •Filing deadline for earlier, if student USCIS to receive will complete one Form I-765 academic year •Latest possible before OPT requested start employment date for post- begins. completion OPT Post-Completion OPT Planning Tool: An Excel spreadsheet that allows users to calculate the amount of OPT available for a student and generate suggested timelines for a student, based on the Program End Date and the desired OPT start date. Recommend OPT To recommend OPT: 1. Navigate to the Student Information page. 2. Click OPT Request. The OPT Employment page opens. (ALT Text: Screenshot of OPT Employment page with arrow pointing to “New OPT Employment” link at the bottom left of the screen.) December 4, 2015 6",
    "deleted": true
  },
  "6": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide 3. Click New OPT Request. The Add OPT Employment page opens. (ALT Text: Screenshot of Add OPT Employment Page) 4. Enter information relevant to the OPT authorization. Field Description * The student has met or  Click the checkbox to indicate the student has met will meet the one full the enrollment requirement. academic year  This is a required field. requirement by the employment start date. * OPT Type  Select either: o Pre Completion: All employment occurs before the Program End Date. o Post Completion: All employment occurs after the Program End Date.  This is a required field. * Full-time/Part-time  Select from the drop-down list: o Part-time: Select if Pre-Completion OPT occurs when school is in session. o Full-time: Select full-time if:  Pre-Completion OPT occurs when school is not in session. December 4, 2015 7",
    "deleted": true
  },
  "7": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide Field Description  Employment is Post-Completion OPT.  This is a required field. SEVIS will not allow overlapping segments of OPT. You must specify if the OPT is pre-completion vs. post-completion OPT and must be either full vs. part time. * Start Date  The date that OPT authorization starts.  This date cannot be before the student has completed one academic year of full-time study. Format: MM/DD/YYYY. Post-Completion OPT: Start Date must be on or after the Program End Date. It cannot be more than 60 days after the Program End Date.  This is a required field. * End Date  The date the OPT authorization is to end. Format: MM/DD/YYYY o Pre-Completion OPT: Cannot be after the Program End Date. o Post-Completion OPT: Cannot enter a date more than 12 months after the Employment Start Date.  This is a required field. SEVIS will not allow overlapping segments of OPT. Student Remarks Enter or update remarks regarding the student’s planned employment. Use this field to convey important information you think the student or government officials need to know. For example: student will pursue training .related to studies. This field is limited to 1,000 characters. Note: Comments entered here overwrite any existing remarks that print in the Remarks field on Page 1 of the Form I-20. USCIS has noted they want to see Employment Remarks  Enter any applicable remarks about the student’s employment. This field is limited to 250 characters.  These remarks do not print on the Form I-20. 5. Review the information. Click either Save or Cancel: December 4, 2015 8",
    "deleted": true
  },
  "8": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide  Save: Submits the OPT request. A message indicates that the update was successful. (ALT Text: Screenshot of Update Successful page.) Click either Print I-20 or Return Employment List: o Print I-20: Prints the Form I-20 with the OPT recommendation. Note: Sign the Form I-20 and give the printed Form I-20 to the student. The student must sign the Form I-20 and submit it to USCIS with the application for work authorization. o Return Employment List: Returns the user to the OPT Employment page. The newly added OPT employment will be on the list. (ALT Text: Screenshot of OPT Employment page with requested OPT employment added.)  Cancel: Cancels the action and returns user to the OPT Employment page. 6. Review the information on the OPT Employment page. To make changes to the existing OPT request, click Edit. December 4, 2015 9",
    "deleted": true
  },
  "9": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide Note: To recommend an additional period of OPT, click New OPT Request and repeat Steps 4 and 5. The start and end dates for segments of OPT cannot overlap. Click either Print I-20 or Return:  Print I-20: Prints the Form I-20.  Return: Returns the user to the Student Information page. Edit OPT Request OPT information can be edited depending on the status of the OPT request: Request Status Editable Fields Requested  Full-time/Part-time  Fulfillment of 1-year requirement  Employment Remarks  Student Remarks Pending  Full-time/Part-time  Fulfillment of 1-year requirement  Employment Remarks  Student Remarks Approved  Employer Name  Employer Address  Explanation for relationship to course work  Employment Remarks  Student Remarks To edit an OPT request: 1. Click OPT Request on the Student Information page. The OPT Employment page opens. December 4, 2015 10",
    "deleted": true
  },
  "10": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide (ALT Text: OPT Employment page listing the existing OPT request with the Edit link.) 2. Click Edit to the right of the OPT segment to be edited. The Edit OPT Employment page opens. (ALT Text: Screenshot of Edit OPT Employment page.) December 4, 2015 11",
    "deleted": true
  },
  "11": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide 3. Make any necessary edits: Field Description * The student has met or  Click the checkbox to indicate the student has met will meet the one full the enrollment requirement. academic year  This is a required field. requirement by the employment start date. * Full Time/Part Time  Select from the drop-down list: o Part Time: Select if Pre-Completion OPT occurs when school is in session. o Full Time: Select full-time if:  Pre-Completion OPT occurs when school is not in session.  Employment is Post-Completion OPT.  This is a required field. Student Remarks Enter or update remarks regarding the student. Note: Comments entered here overwrite any existing remarks that print in the Remarks field on page one of the Form I-20. Employment Remarks Enter any applicable remarks about the student’s employment. 4. Click either Save or Cancel:  Save: Updates this employment request in the student’s record. An Update Successful message indicates if the edit was successful. Click one of the following: o Click Print I-20 to print the Form I-20.  Sign page one of the Form I-20, and give the printed Form I-20 to the student.  Student must also sign page one of the Form I-20 and submit it to USCIS with the application for work authorization. o Click Return to Employment List to return to the OPT Employment page.  Cancel: Returns the user to the OPT Employment page without updating the employment segment. Cancel/Withdraw OPT Request An OPT request can be canceled in SEVIS ONLY if the OPT Request is in Requested status. December 4, 2015 12",
    "deleted": true
  },
  "12": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide OPT Request Status in SEVIS = Requested OPT Request Status in SEVIS = Pending • P/DSO can cancel OPT in SEVIS. • P/DSO cannot cancel OPT in SEVIS. • OPT Request status changes to Canceled. • Student must write USCIS to withdraw • Do not cancel OPT request if the student the Form I-765. has mailed the Form I-765 to USCIS. • After processing by USCIS, OPT request status in SEVIS changes to Withdrawn. Note: Any request in Requested status longer than 180 days is automatically canceled by SEVIS. Cancel OPT Request To cancel an OPT request: 1. Navigate to the Student Information page. 2. Click OPT Request from the Student Information page. The OPT Employment page opens. (ALT Text: Screenshot of OPT Employment page.) December 4, 2015 13",
    "deleted": true
  },
  "13": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide 3. Click Cancel Request next to the segment of OPT you want to cancel. A Confirm Cancelation of Request page opens. (ALT Text: Screenshot of Confirm Cancelation of Request page.) 4. Click either Yes or No:  Yes: Cancels the OPT request. An Update Successful message verifies that the update was successful. Click either Return to Employment List or Print I-20: o Click Print I-20 to print the Form I-20. o Click Return to Employment List to return to the OPT Employment page; and then click either Return or Print I-20:  Click Print I-20 to print the Form I-20.  Click Return to return to the Student Information page. Note: The student’s OPT status in the Student Requests section updates to Canceled.  No: Returns the user to the OPT Employment page without canceling the OPT request. Withdraw OPT Request Once an OPT request status changes to Pending, the student must write USCIS to withdraw the OPT application. The request must:  Be sent to the USCIS Service Center processing the application. The address is on the USCIS-issued Receipt Notice sent to the student.  Include the receipt number USCIS assigned the case when it was filed. Report OPT Participation While on OPT, a student is required to report the following to their DSO:  Change in student’s legal name.  Change in student’s address while on OPT. December 4, 2015 14",
    "deleted": true
  },
  "14": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide  Changes in employment or interruption of employment. DSOs update SEVIS to reflect the changes. 8 CFR 214.2(f)(12)(ii)(E) SEVP OPT Policy Guidance DSOs are expected to add, edit, or delete employer information in a timely manner. Post-completion OPT and Unemployment While students are not required to have an employer when OPT is requested in SEVIS, students authorized for post-completion OPT are expected to be employed. A student on post-completion OPT can be unemployed for a total of 90 days. A student whose record lacks employer information is considered unemployed.  SEVIS will auto-terminate students who accrue 90 consecutive days of unemployment. SEVIS will allow for student and P/DSO reporting deadlines before terminating the record. This functionality is currently disabled.  SEVP officials can manually terminate a student who accrues 90 total days of unemployment. P/DSOs must enter employer information into SEVIS. 8 CFR 214.2(f)(10)(ii)(E) SEVP Policy OPT Guidance OPT-Related SEVIS Alerts and Lists The following Alert List and Student Lists in SEVIS help DSOs monitor and manage students on OPT: December 4, 2015 15",
    "deleted": true
  },
  "15": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide Alert/List Description Students who have Approved OPT without This Alert List shows: Current Employer Information • SEVIS ID • Surname/Primary Name • Given Name • OPT Type (Post-completion or STEM OPT) • OPT Actual Start Date • OPT Actual End Date • Latest OPT employment end date • Number of days since the last employment date Students with Requested, Pending, or This Student List shows: Approved Optional Practical Training • Active indicator (OPT) • SEVIS ID • Visa Type • Surname/Primary Name • Given Name • DSO Recommended Start and End Dates • USCIS Approved OPT Start and End Dates • OPT Type • Request Status and Receipt Number Students Terminated for Exceeding the This Student List shows: Maximum Number of Days of • SEVIS ID Unemployment • Class of Admission • Surname/Primary Name • Given Name • Termination Date • OPT Type View OPT Employment Information DSOs can view a student’s OPT information on the following pages, which are accessed through the Student Information page: December 4, 2015 16",
    "deleted": true
  },
  "16": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide  Request/Authorization Details page that lists only current authorizations.  Employment Information page that lists all employment authorizations linked to the SEVIS ID. Refer to the Practical Training Indicators and Dates topic for details on:  How the practical training indicator displays  How SEVIS derives the three sets of dates associates with practical training H-1B Cap-Gap Extension of OPT SEVIS will automatically extend post-completion OPT if:  On or after April 1, an employer files an eligible H-1B petition to change the student’s status.  The requested start date for the H-1B is October 1.  The student’s OPT ends on or after April 1. Correcting OPT Data: Correction Requests and Data Fixes If OPT information in SEVIS does not reflect applications filed with or decisions made by USCIS, DSOs can ask to have the record corrected. There are two ways to correct data in a student record. Method What Can be Fixed Correction Request This option is used to request changes (using SEVIS) for the following:  Status of OPT Request  Employment Start Date  Employment End Date Help Ticket (Data Fix) This option is used for more complicated data fixes and requires DSOs to call the SEVIS Help Desk (1-800-892-4829). Types of OPT-related data fixes include:  Adding retroactive OPT to a record  Changing the OPT request status for an OPT request that is already in Approved status  Any data fix that cannot be submitted in a correction request December 4, 2015 17",
    "deleted": true
  },
  "17": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide Icon Guide See the SEVIS Help Icons on the SEVIS Help Hub for a quick-reference of the icons used in this user guide. December 4, 2015 18",
    "deleted": true
  },
  "18": {
    "source": "F-1-Student-Visa-and-Arrival-Information.pdf",
    "content": "F-1 Student Visa & Arrival Information This instruction sheet outlines the necessary procedures to obtain your student visa and prepare for your arrival to the United States. SEVIS Fee A SEVIS I-901 fee payment is required for F-1 students and the receipt must be included with all F-1 visa applications. Students should also be prepared to present the SEVIS I-901 fee payment receipt at the U.S. port of entry. Students with a country of citizenship or country of birth of Cameroon, Ghana, Kenya, Nigeria or Gambia, must pay by money order, Western Union Quick Pay or certified check drawn from a U.S. bank. All other students also have the option to make a credit card payment. To pay the SEVIS fee, please visit fmjfee.com. Applying for a Visa To provide time for visa processing, students are encouraged to apply for their visa as soon as they receive their I-20 issued by Northeastern University. U.S. Embassies or Consulates are able to issue F-1 entry visas up to 120 days before the program start date listed on your I-20. In most countries, student visa applicants must appear in person for the visa interview. However, each U.S. Embassy or Consulate sets its own interview policies and procedures. Students should consult the specific embassy website or call for application instructions; see usembassy.state.gov. The following documents are typically required for the F-1 visa application:  Online Nonimmigrant Visa Application (DS-160) confirmation page  Visa application fee payment receipt (visit the U.S. Embassy or Consulate website for specific instructions)  Form 1-20 issued by the Office of Global Services at Northeastern University  Valid passport (must be valid at least 6 months into the future)  Evidence of financial support (proof of sufficient funds for estimated cost of one academic year)  SEVIS I-90 fee payment receipt  A copy of your acceptance letter to Northeastern University  One photograph (see the U.S. Department of State website for photo requirements: travel.state.gov/content/visas/en/general/photos.html) All applicants should be prepared to provide additional information, such as transcripts or diplomas from previously attended institutions, or documents which demonstrate that the applicant intends to return home after their studies. Dependents will receive their own I-20 with a SEVIS ID to apply for the F-2 visa. Dependents are not required to pay the SEVIS fee. Important: No assurances regarding the issuance of visas can be given in advance. Therefore, final travel plans or the purchase of non-refundable tickets should not be made until a visa has been issued. After the visa has been issued, please be sure the F-1 visa sticker in your passport is accurate and that your original I-20 has been returned to you as you will need to have it in hand when entering the U.S. Note: Citizens of Canada and Bermuda do not need to apply for an F-1 visa, but are required to have the I-20 and pay the SEVIS I-901 fee before entering the U.S. to study. Office of Global Services, 405 Ell Hall, 360 Huntington Ave,",
    "deleted": true
  },
  "19": {
    "source": "F-1-Student-Visa-and-Arrival-Information.pdf",
    "content": "in hand when entering the U.S. Note: Citizens of Canada and Bermuda do not need to apply for an F-1 visa, but are required to have the I-20 and pay the SEVIS I-901 fee before entering the U.S. to study. Office of Global Services, 405 Ell Hall, 360 Huntington Ave, Boston, MA 02115 northeastern.edu/OGS | ogs@northeastern.edu | (p) 617.373.2310 | (f) 617.373.8788 Page 1 of 2",
    "deleted": true
  },
  "20": {
    "source": "F-1-Student-Visa-and-Arrival-Information.pdf",
    "content": "F-1 Student Visa & Arrival Information Entering the United States When preparing for your arrival to the U.S., you should plan your travel according to the information provided by the Office of New Student Orientation or your college. According to immigration regulations, F-1 student visa holders can enter the U.S. up to 30 days prior to the program report date on the I-20. Students transferring to Northeastern University in F-1 status from another institution or changing their degree level at Northeastern, may stay in the U.S. or travel between programs, and may enter the U.S. more than 30 days before the new program start date. When you travel, please have the following documents in your carry-on bag:  Valid passport with valid F-1 visa sticker  Your original I-20 issued by Northeastern University  I-901 SEVIS fee receipt  Financial documents  Admissions letter At the U.S. port of entry, you will be required to present your passport and I-20 to the immigration officer who will stamp your passport. In most cases, the officer notes “D/S” (Duration of Status) on your passport pages. This means that you are allowed to stay in the U.S. for the length of time indicated on your I-20, provided that you maintain full- time enrollment and valid F-1 status. Ensure that your passport is properly stamped before exiting the inspection area. Do not enter the U.S. in visitor status (B-1/B-2, WT, or WB). This status does not permit full-time study in the U.S. After your arrival, print your Admission (I-94) number at cbp.gov/I94 and keep a copy of all travel documents (I-94 information, F-1 visa, and I-20) for your personal records. Ensure that your I-94 print out contains the correct information, including F-1 visa status and “D/S”. Office of Global Services, 405 Ell Hall, 360 Huntington Ave, Boston, MA 02115 northeastern.edu/OGS | ogs@northeastern.edu | (p) 617.373.2310 | (f) 617.373.8788 Page 2 of 2",
    "deleted": true
  },
  "21": {
    "source": "f1-travel-visa-guide.pdf",
    "content": "International Student Services (ISS) UW1-160, 18115 Campus Way NE, Campus Box 358500 Bothell, WA 98011 Phone: 425-352-3876 Fax: 425-352-5455 Email: iss@uwb.edu Website: www.uwb.edu/iss I-20 DOs & DON’Ts DO: DON’T:  Keep all I-20s (including previous I-20s) in a safe place  Lose your I-20s (current I-20 and previously issued)  Check to make sure the travel signature on page 3 was signed  Travel outside the U.S. without a current travel signature within 1 year from the date you intend to return to the U.S. (signed within 1 year from the date you intend to re-enter)  Contact ISS any time you have made a change to your situation  Wait until the last day to request a travel signature, updates to (such as your major or anticipated graduation date). your I-20 or resolve problems. F1 TRAVEL & VISA INFORMATION ENTERING THE U.S. ON “INITIAL ATTENDANCE” I-20 TOURIST VISA FOR OTHER COUNTRIES If you are arriving to the U.S. on an initial I-20 (see line #3 on (including Canada) your I-20), please note that F1 visa regulations allow you to You may be required by other countries to obtain a tourist visa only enter the U.S. up to 30 days before the program start if you are planning to visit a country other than your home date on your I-20 (see line #5 on your I-20). country – including Canada and Mexico! Requirements and visa application processes vary, so contact each country’s embassy TRAVEL OUTSIDE THE UNITED STATES or consulate in the U.S. for more information. Canadian You are required have the following with you whenever you Consulate in Seattle, and how to obtain a Canadian tourist re-enter the United States: visa: www.canadainternational.gc.ca/seattle/. A link to foreign consulates in the U.S. are available at www.uwb.edu/iss. 1) Valid Passport. Your passport must be valid for 6 months into the future at all times while in the U.S. You TRAVEL TO CANADA OR MEXICO should contact the consulate of your home country if As a student on an F1 visa, you are eligible for Automatic your passport will be expiring. A list of foreign Revalidation. This allows you to solely travel to Canada, Mexico, consulates located in the U.S. are available at: or Adjacent Islands (except Cuba) and re-enter the U.S. on an www.uwb.edu/iss. expired F-1 visa. This is allowed only if: 2) Valid F1 Visa. Your F-1 visa is permission to enter the 1) Your stay was less than 30 days; U.S. as a student. A visa can only be secured at a U.S. 2) You do NOT apply for a new F1 visa at a US consulate; Embassy. ISS recommends that you apply in your home 3) You are able to present to US immigration officials country. A list of U.S. Embassy locations are available your passport, I-94 card, I-20 with valid travel at: www.uwb.edu/iss. signature, and evidence of full-time enrollment and 3) Current UW Bothell I-20. You may use your current financial support. UW Bothell I-20 for travel if",
    "deleted": true
  },
  "22": {
    "source": "f1-travel-visa-guide.pdf",
    "content": "to present to US immigration officials country. A list of U.S. Embassy locations are available your passport, I-94 card, I-20 with valid travel at: www.uwb.edu/iss. signature, and evidence of full-time enrollment and 3) Current UW Bothell I-20. You may use your current financial support. UW Bothell I-20 for travel if the information on page 1 4) You are not a citizen of “state sponsors of terrorism” is still accurate. If there has been any change in your designated by the U.S. Dept. of State: Cuba, Iraq, Iran, name, major or degree level, you should request a new North Korea, Sudan, and Syria I-20 from ISS before you travel. 4) Current Travel Signature. You need to obtain a travel DEPENDENT TRAVEL signature from ISS on page 3 of your current I-20 in A dependent with a valid F2 visa may re-enter the U.S. with order to re-enter as a continuing F-1 student. ISS his/her passport, visa and dependent I-20 with current recommends that the travel signature be issued within program information on page 1 and a valid re-entry signature 1 year from the date you intend to re-enter the U.S. on page 3. ISS recommends that dependents carry evidence of F-1 visa holder’s legal status and full-time enrollment. ISS recommends that you also have the following with you whenever you re-enter the United States: TRAVEL WITHIN THE UNITED STATES There are no special documents required for travel within the 1) Unofficial Transcript. A transcript is an official record United States (including Hawaii and Alaska). However, ISS from the University of your academic career. You may recommends that you carry your current I-20, passport, I-94 print this from your MyUW account. card and valid F1 visa with you in the event that you are asked 2) Current Course Schedule. You may print this from by a law enforcement officer to provide evidence of your status. your MyUW account. 3) Evidence of Financial Support. You may be asked at ISS also recommends that you carry a valid Washington State the Port of Entry to provide documents that verify that Identification card, as a form or legal identification that is safe you can support your studies. Documents should match to carry on a daily basis. Information on how to obtain a the financial sponsor listed on page 1 of your I-20 and Washington State ID card is at www.uwb.edu/iss . can include bank statements, scholarship letters, etc.",
    "deleted": true
  },
  "23": {
    "source": "f1-travel-visa-guide.pdf",
    "content": "International Student Services (ISS) UW1-160, 18115 Campus Way NE, Campus Box 358500 Bothell, WA 98011 Phone: 425-352-3876 Fax: 425-352-5455 Email: iss@uwb.edu Website: www.uwb.edu/iss OBTAINING A NEW F1 VISA ENTRY VISA TIPS FOR THE VIEW INTERVIEW If your current F1 visa has expired or if you do not have an F1 The following are tips for you in consider when preparing for visa, you must apply for a F1 visa at a U.S. consulate before you your visa interview. You should also visit the website of the U.S. can enter the U.S. It is not possible to obtain an F1 visa within Consulate in your home country for further information about the United States. preparing for your interview. If you will apply for an F1 visa, you should: 1. Be honest. Students have been denied visas for presenting false information. 1) Contact a U.S. Consulate. You should contact the U.S. Consulate where you plan to apply for your F1 visa to 2. Ties to your Home Country. You must be able to show that learn about the visa application process. To access the you have reasons for returning to your home country that are nearest U.S. Consulate, visit: http://usembassy.state.gov stronger than those for remaining in the U.S. “Ties” to your home country that bind you to your home town, homeland, or 2) Collect All Required Documents. In addition to any current place of residence such as job, family, financial required documents listed on the U.S. Consulate’s prospects that you own or will inherit, investments, etc. website, you can also obtain the following official documents that verify your enrollment at UW Bothell, 3. Financial Support. Make sure you bring sufficient proof that from the Office of the Registrar (UW1-160; you have enough money to support yourself in the U.S. registrar@uwb.edu; www.uwb.edu/registration/transcript ) . Students should allow at least 2 business days for 4. English. Anticipate that the interview will be conducted in processing. English and not in your native language. If you are coming to the United States to study only English, be prepared to explain o Official Transcript. A transcript is an official record how English will be useful for you in your home country. from the University of your academic career. You may request an official transcript from the Office of 5. Know the Program and How It Fits Your Career Plans. the Registrar. You may also print an unofficial You should be able to explain how studying in the U.S. relates to transcript from your MyUW account. your future professional career. o Enrollment Verification Letter. This is an official 6. Employment. Your main purpose in coming to the U.S. document from UW Bothell that can confirm that you should be to study, not to work in the U.S. before or after are enrolled in the current quarter, and registered for graduation. While many students do work on-campus during the future quarter. You may request this letter from their studies, employment is not their main purpose. the Office of the",
    "deleted": true
  },
  "24": {
    "source": "f1-travel-visa-guide.pdf",
    "content": "be to study, not to work in the U.S. before or after are enrolled in the current quarter, and registered for graduation. While many students do work on-campus during the future quarter. You may request this letter from their studies, employment is not their main purpose. the Office of the Registrar. ADDITIONAL CONSIDERATIONS VISA DENIALS Studying Abroad through a UW Program: Contact ISS if you It is rare for a returning student to be denied a new F1 visa, are planning to study abroad to discuss full-time enrollment, however there are no guarantees. Be aware that your risk of UW health insurance enrollment, and valid immigration denial increases under the following circumstances: documents upon re-entry to the U.S. 1) You are applying in a country other than your home Extended Absences: Your SEVIS record will be terminated if country you are outside of the U.S. for more than 5 months, unless you have been authorized to study abroad. Consult with ISS if you 2) You have family members (spouse, parents, siblings) plan to be out of the U.S. for more than 5 months. who are citizens or permanent residents in the U.S. Optional Practical Training: In addition to your valid 3) You are pursuing post-completion Optional Practical passport, valid F1 visa, and I-20 you must present your EAD Training (OPT) card and a letter from your employer to the immigration officials upon re-entry to the U.S. If your visa application is denied or significantly delayed, contact ISS so that we are aware of your situation. QUESTIONS? If you have additional questions about travel, visit our Travel section at www.uwb.edu/iss or contact International Student Services at iss@uwb.edu .",
    "deleted": true
  },
  "25": {
    "source": "maintaining-f-1-status.pdf",
    "content": "Student Center North, N203, Houston, TX 77204-3024  Phone: (713) 743-5065  Email: isssohlp@central.uh.edu  http://uh.edu/oisss MAINTAINING F-1 STATUS UH/STUDENT ID:________ This may be the most important document you will read while you are in the United States. It is your responsibility to know and obey F-1 regulations or face possible removal from the U.S. F = FULL-TIME STUDENT 1. Be a full-time student each main semester. You must complete (not just register) for a full course load each main semesters. To maintain your status, each spring and fall semester, undergraduate and post-baccalaureate students must complete 12 hours and graduate students 9 hours at the graduate level. Note: Some degree programs may require more hours for academic reasons. Check with your department. Towards your full-time requirement, you may not take more than the equivalent of one class (three credit hours) per semester online or through (a)synchronous distance education (tape purchase or broadcast). You are required to complete 6 hours for the summer session(s) if the program start date on your I-20 is for the summer semester. You are also required to enroll for summer if it is you final semester to complete your degree. You must receive the authorization before you drop or take below full-time hours. Please make an appointment to see an International Student Counselor BEFORE taking below full-time hours even if you are failing the class. A grade of “W” does not count toward your full-time requirement. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu A = AUTHORIZATION FOR EMPLOYMENT & TRAINING 1. Never work off-campus unless you have current authorization from an International Student Counselor or the DHS. You must either have authorization on page 2 of your I-20 or an employment authorization card (EAD) from USCIS. All off-campus employment has a beginning and ending date. Renewals must be done before resuming work. Even 1 day of work without authorization is a serious violation of U.S. law. On-campus work does not require authorization, but you must maintain your full-time student status to be eligible. On-campus work is limited to no more than 20 hours per week during the fall and spring and may be full-time during the summer and winter breaks. Most on-campus student jobs, by university policy, are still limited to 20 hours a week even during the summer. You may not engage in on-campus employment after your completion of study. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu C = CARRY CURRENT DOCUMENTS 1. Keep your passport valid at all times. Your passport should be valid for at least 6 months into the future. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 2. You are required to carry your immigration documents (passport, I-20) with you. You",
    "deleted": true
  },
  "26": {
    "source": "maintaining-f-1-status.pdf",
    "content": "passport should be valid for at least 6 months into the future. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 2. You are required to carry your immigration documents (passport, I-20) with you. You can be fined $100 and/or sent to jail for up to 30 days if you do not have your documents with you. Local law enforcement officials in Houston may only request a government ID, but they still recommend that you carry photocopies of your immigration documents with you at all times in the greater Houston area. You should carry the original documents with you outside of Houston, even if you are remaining in the U.S. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 3. Inside the U.S. you must maintain your visa status, not your visa sticker in your passport. The visa sticker in your passport can expire while you are in the U.S. because its ONLY function is as a “key” to enter or re-enter the U.S. Your non-immigrant status is defined with the F-1 and D/S (Duration of Status) located on your admissions record known as the I-94. You must maintain your status (not the sticker) in order to remain in the U.S. You maintain your visa status by obeying all U.S. regulations (highlighted in this handout). You only need to renew your expired F-1 visa sticker if you leave the U.S. and want to re-enter. Be sure to only enter with an F-1 visa if you want to have F-1 status in the U.S. The type of visa sticker you use determines your status in the U.S. If you are an F-1 student and have a specific departure date on your I-94 card (there is no D/S), visit our office immediately. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 4. Only attend the school listed on your current I-20. To attend another school, you must transfer your SEVIS record to that school (obtain approval on a new I-20) or receive a concurrent enrollment letter from our office. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu CARRY CURRENT DOCUMENTS continued on next page…",
    "deleted": true
  },
  "27": {
    "source": "maintaining-f-1-status.pdf",
    "content": "Student Center North, N203, Houston, TX 77204-3024  Phone: (713) 743-5065  Email: isssohlp@central.uh.edu  http://uh.edu/oisss 5. Apply for an extension of your I-20 before the expiration date. The extension can only be granted by our office before the expiration date listed on item 5 of your I-20. Valid reasons include change in major, research difficulties, or a medical excuse. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu T = TRANSITIONS 1. Report any change of address to the U.S. Department of Homeland Security (DHS) and ISSS within 10 days of the change every time you move using DHS electronic Form AR-11 and your PeopleSoft Self-Service. You may be fined $200 and/or placed in jail for up to 30 days if DHS does not have your current address on file. The AR-11 may be filed electronically by visiting the USCIS website at www.uscis.gov and clicking on “change of address online.” Form AR-11SR needs to be used if you are required to participate in Special Registration. You should also report within 10 days the new address, phone number and email to ISSSO using your PeopleSoft account (http://my.uh.edu/) to update your SEVIS address type. Never blank out your “SEVIS” address type in PeopleSoft. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 2. Complete an I-20 transfer whenever you change schools. If you plan to transfer to another school you will need to request a release of your SEVIS I-20 record from UH. An I-20 transfer (not the same as transferring academic credit) is not complete until you have received a SEVIS I-20 from the new school and reported to the new school. A SEVIS I-20 transfer must be completed within 15 days of the program start date on your new I-20. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 3. Obtain a new I-20 whenever you make a change in degree levels. This includes changing levels at the same school or a new one (e.g., bachelor's to master's degree) or beginning a new degree at the same level (e.g., master’s degree to a 2nd master’s). I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 4. Obtain a travel endorsement on page 3 of your I-20 before leaving the U.S. if you plan to reenter. This will be needed if you want to reenter the U.S. It is not necessary if you are returning home permanently. An I-20 is no longer valid for reentry once you complete the degree listed on your I-20, even if the I-20 has not expired. I completely understand this regulation and will comply with it I have questions or need more information and will email",
    "deleted": true
  },
  "28": {
    "source": "maintaining-f-1-status.pdf",
    "content": "if you are returning home permanently. An I-20 is no longer valid for reentry once you complete the degree listed on your I-20, even if the I-20 has not expired. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 5. Make a transition within 60 days of completing your degree or optional practical training (OPT). If you are not required to take any additional courses to satisfy your degree requirements, you are considered to have completed the course of study listed on your I-20 and you must take action to maintain status. It is your responsibility to keep track of your degree progress and make a timely application for graduation. You have a 60 day grace period to transition to a new I-20 for a new degree program or depart the U.S. after completion of your degree program or OPT. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 6. Complete your degree earlier than I-20 program ending date. You must notify ISSSO in order to end your I-20 properly in the SEVIS system to avoid any complications of your status or future re-entry to the U.S. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu S = STAY IN TOUCH 1. Realize that SEVIS (Student & Exchange Visitor Information System) requires ISSSO to regularly report all events in the life of a student via the internet. Due to this close tracking, it is vital that you remain in status by following all the items on this form and stay in touch with our office so that you can avoid unintentional violations. The government may change or add to the F-1 regulations at any time. It is your responsibility to know them by attending public information meetings when offered, visiting our website, and read any emails that are sent by our office to you. 2. I am not eligible to apply for U.S. public benefits. I will contact ISSSO if I have any questions. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu “I have read all of the above statements and understand that I am required to know and obey all F-1 regulations.” Name ____________________________________ Signature ____________________________________ Date _________________",
    "deleted": true
  },
  "29": {
    "source": "SEVP_International Student Life cycle_Oct 2015.pdf",
    "content": "International Student Life Cycle (F-1/M-1) 1 Apply to a Student and 2 Receive a Form I-20, 3 Pay the I-901 Exchange Visitor Program “Certificate of Eligibility for SEVIS Fee (SEVP)-Certified School Nonimmigrant Student Status” Student must pay the I-901 Student applies and is accepted A student’s Student and Exchange Visitor SEVIS Fee at FMJFee.com. to an SEVP-certified school. Information System (SEVIS) record is created and the student is then issued a Form I-20 by the designated school official (DSO) at the SEVP-certified school they have chosen to attend. 6 Maintain Status During 5 Arrive in the United States 4 Apply for Student Visa Program Study Student arrives no more than Student brings their Form I-20 Student must take a full course of study, 30 days before their program and other required documents to not work without prior authorization and start date and presents their apply for a student visa from the speak with their DSO if they cannot Form I-20 and valid student visa U.S. Department of State. to U.S. Customs and Border finish classes before their program end Protection at the port of entry. date, or have any other concerns about maintaining lawful status. Work Requirements(F-1 Students Only) 7 Explore Post-Graduation 8 Depart the Opportunities An F-1 student may work only when United States authorized, including: A student has the option to transfer An F-1 student has 60 days to • On campus schools, change education levels (e.g., depart the United States after • Off campus, if financially needed and with undergraduate to graduate), or if completion of their program of authorization from USCIS eligible, apply to U.S. Citizenship and study or OPT. An M-1 student has • Curricular practical training integral to their Immigration Services (USCIS) for 30 days after completion of their program of study post-completion Optional Practical program of study to depart. • OPT-related to the student’s major and with Training (OPT) opportunities. authorization by USCIS. For more information visit StudyintheStates.dhs.gov/Students",
    "deleted": true
  },
  "30": {
    "source": "isa-isss-handbook.pdf",
    "content": "International Student Resource Handbook Created for students, by students.",
    "deleted": true
  },
  "31": {
    "source": "isa-isss-handbook.pdf",
    "content": "Change is the only constant in life. One’s ability to adapt to those changes will determine one’s success in life. “ Benjamin Franklin Founder of the University of Pennsylvania",
    "deleted": true
  },
  "32": {
    "source": "isa-isss-handbook.pdf",
    "content": "Table of Contents Introductory Message 2 Explore the Campus 3 Immigration and Arrival 4 Penn Card and Penn Key 5 Insurance and Immunizations 6 Managing Finances 7 Student Employment 8 US Banks and Phone Plans 9 Housing and Dining 10 Safety in Philly 11 Essential Resources 13 Student Organizations 15 Campus Life 16 Pro-Tips From Students 17 1",
    "deleted": true
  },
  "33": {
    "source": "isa-isss-handbook.pdf",
    "content": "A Message Dr. Rodolfo “Rudie” Altamirano Executive Director Penn Global Congratulations on your admission to the University of Pennsylvania, and a warm welcome to the Penn community! We are absolutely thrilled that you have chosen Penn as your academic home. As international students, your presence enriches our campus with a mosaic of diverse experiences and outstanding academic abilities. Your unique perspectives and cultural backgrounds contribute to the global tapestry we celebrate at Penn. We understand that starting your journey at Penn as an international student may come with its own set of questions and uncertainties. That's precisely why we have prepared this comprehensive handbook for you. It serves as your compass, guiding you through the initial steps of your Penn experience and acquainting you with the myriad resources available specifically for international students. At Penn, we foster a vibrant and inclusive community that cherishes the contributions of each and every student. We encourage you to embrace opportunities for engagement, seek connections with fellow students and faculty, and explore the wealth of academic and extracurricular offerings. Our campus is a tapestry of ideas, cultures, and perspectives, and we believe that your presence here will not only enrich your own educational journey but also contribute to the diversity of Penn's global community. As you embark on this exciting chapter, we eagerly await your arrival in the beautiful city of Philadelphia. We look forward to seeing you thrive in our close-knit community. If you have any questions or need assistance, please do not hesitate to reach out. We are here to support you every step of the way. Best wishes for an extraordinary start to your Penn adventure! 2",
    "deleted": true
  },
  "34": {
    "source": "isa-isss-handbook.pdf",
    "content": "Explore the Campus Scan the QR Codes to get a good grasp of the buildings on campus, transit services, and other Penn facilities. Virtual Tour Campus Map www.admissions.upenn.edu/virtual-tour www.facilities.upenn.edu/maps 3",
    "deleted": true
  },
  "35": {
    "source": "isa-isss-handbook.pdf",
    "content": "Immigration & Arrival As a new member of the Penn family, We are here to you'll join a community of more than make the smooth 9,000 international students, scholars, transition possible. and employees from over 120 countries. Prepare All you need to know to prepare for and  Set up your iPenn: an important portal! arrive to Penn:  Apply for your Form I-20 (F-1 Visa students) or DS-2019 (J-1 Visa students).  Apply for your US Visa at your local Embassy. This process takes significant time (at least 2 to 3 months). Get started early so that you can get to the States on time for your program! www.global.upenn.edu/isss  Keep all the required documents and receipts A Useful Pre- carefully. These will be needed upon arrival. Departure Checklist Arrival  You will be assigned an I-94 number upon arrival, which is proof of your legal visitor status. You can access it here: https://i94.cbp.dhs.gov/I94 https://global.upenn.edu/sit  You must register your presence at Penn by es/default/files/Pre- checking in with ISSS through iPenn. (A tutorial Departure%20Checklist.pdf will be provided on how to do this in iPenn.) 4",
    "deleted": true
  },
  "36": {
    "source": "isa-isss-handbook.pdf",
    "content": "Penn Card This is your official UPenn Identity Card. It is used to access buildings and libraries on campus, food halls, recreation facilities, and make purchases. Your Penn card may be pre-loaded with a certain amount of Penn Cash and you can top it up. penncard.business-services.upenn.edu You can apply for the Penn Card through the website, but you will need to collect it physically by scheduling an appointment. Penn Key & Password This is your digital key to access all of Penn’s portals and platforms! Once enrolled, you will receive an email with this information. However, for now, when you set up your iPenn, you do it through the ‘Limited Service Login’ where you will receive a ‘Limited Access PIN’. This is NOT your Penn Key. Once your Penn Key is activated, you can log into iPenn with it automatically. 5",
    "deleted": true
  },
  "37": {
    "source": "isa-isss-handbook.pdf",
    "content": "Insurance & Immunization Before arriving at Penn, you need to have health insurance and the required immunizations. While you can receive missing immunizations on campus, it is better to get as much out of the way from your home country! Wellness at Penn Insurance Includes information on insurance and immunization Explore the different insurance options recognized by Penn and enroll in the best fit: • PSIP – Penn Student Insurance Plan • PSI – Emerald, Platinum, Presidential • ISO Plans – For Upenn Penn Student Health and Counseling https://wellness.upenn.edu/ offers 24/7 support for students. Medical: 215-746-3535 The Immunization and Insurance Counseling: 215-898-7021 Compliance Office 215-746-4200 wel-immun@pobox.upenn.edu Immunization wel-shsinsur@pobox.upenn.edu  Understand the immunization requirements.  Get the Immunization Form filled out by a medical professional. Scan this document – you will need it later!  Once you have a Penn Key, log into the Wellness Portal, and submit the required information. If you cannot find certain records, write to the Immunization and Insurance Compliance office for support. 6",
    "deleted": true
  },
  "38": {
    "source": "isa-isss-handbook.pdf",
    "content": "Managing Finances As international students, you are investing a significant amount of money in your education. The financial aspect of it can be overwhelming. Below are some ways you can be supported. Explore the SRFS website to: Student Registration and  Estimate the costs of attendance so that Financial Services you are better prepared.  Learn about financing and payment plans that can ease some stress!  Research opportunities for financial aid from UPenn, and scholarship opportunities in your home country. Write to your program managers and school financial aid www.srfs.upenn.edu officers too. The bill is paid through Penn.Pay. Figure out the cheapest option to do so: Online, wire transfers, mail, etc. and consider currency exchange rates. You also have the option to pay your fees in instalments. Timely communication is crucial. Important Financial Matters Emergency Funding Key financial considerations for In case of financial emergencies, international students: how can Penn support you: sis.vpul.upenn.edu/emergency- global.upenn.edu/isss/finances and-opportunity-funding/ 7",
    "deleted": true
  },
  "39": {
    "source": "isa-isss-handbook.pdf",
    "content": "Student Employment Working part-time on campus is a great way to cover some of your living expenses. Below are some things to keep in mind: • International students are limited to on-campus employment. • International students not allowed to work for more than 20 hours per week, except during breaks, when they may work full time (40 hours per week). • You can search for jobs on Workday@Penn (once you have your Penn Key) You can also seek jobs through professors or networks on campus. • Then, you must apply for a Social Security Number (SSN) to work in the US, get paid, and file taxes. • Payments are usually made on a weekly basis. If you become a Resident Advisor (RA) for a College House, your accommodation expenses are slashed significantly! Explore more below! 8",
    "deleted": true
  },
  "40": {
    "source": "isa-isss-handbook.pdf",
    "content": "US Banks & Phone Plans Get A US Bank Account Setting up a bank account is simple. You will need your passport, proof of residence, Penn card, and for some banks, your SSN. Visit the different banks around campus, inquire explicitly about their student plans/benefits, and choose the one that works best for your needs. Note that charges and fees for services vary. • PNC Bank: 3535 Market Street (can be linked to your Penn Card!) • Bank of America: 3925 Walnut Street • Chase Bank: 4001 Chestnut Street • TD Bank: 3735 Walnut Street • Wells Fargo Bank: 3550 Market Street • Santander Bank: 3802 Chestnut Street, 3131 Market Street • Citizens Bank: 134 South 34th Street • UPenn Student Federal Credit Union: 3401 Walnut Street Compare the charges for international money transfers, if it is applicable to you. Know the difference between a Checking and Savings account. Also, watch out for the minimum balance required to be maintained. Get A Phone Plan Popular network providers have their stores in or near campus. Again, it is a good idea to visit them to understand the best option for you as a student. Data packs in the US can be expensive. Luckily, we have Wi-Fi all over campus! • T-Mobile: 3441 Chestnut Street Some phone plans work • AT&T: 3741 Walnut Street out significantly cheaper • Verizon: 1430 Walnut Street if you register as a group! • ConnectEd: connectedmobile.co • Google Fi: fi.google.com 9",
    "deleted": true
  },
  "41": {
    "source": "isa-isss-handbook.pdf",
    "content": "Housing & Dining Housing Penn Residential Services (College Houses) • Undergraduates have college houses to choose from (Penn Residential Services) or can stay off- campus. • Graduate and professional students must find their own accommodation, but Penn Off- Campus Services will guide you through it! residential-services.business- Off-Campus Services can review your contract. services.upenn.edu/living-options Do not commit to landlords immediately. They also have a portal to help you match Penn Off-Campus Services roommates to house-hunt together! Consider the distance from your place to your school. Rest assured, Philly is well-connected through buses and trolley options. Dining cms.business-services.upenn.edu/ offcampusservices/ Penn Dining offers: • Meal Swipes in the Residential Food Halls (Buffet) • Dining Dollars (loaded in your Penn card) that you Penn Dining Options can swipe in these halls and in certain stores. • Or a combination of both! For graduate students who want to cook their own meals, there are grocery stores nearby which have international foods and spices too! Food trucks all around campus offer cheap and delicious meals. (Approx. $8 to $12) https://dining.business Also, look out for tons of events with free food! -services.upenn.edu/ 10",
    "deleted": true
  },
  "42": {
    "source": "isa-isss-handbook.pdf",
    "content": "Safety in Philly It is understandable that you are concerned about the crime rates in Philly. We want to ensure you feel secure by highlighting Penn’s high-quality safety resources. Mental Health Help Line: 215-898-4357 Penn Emergency Line: 215-537-3333 • Penn Guardian App: This connects you with the Public Safety Division at all times. • Walking Escort Service: If you feel uncomfortable walking alone, you can request a safety representative to walk with you 24/7. This is particularly useful at nights. • Penn Violence Prevention: This provides a wide range of confidential and safe resources to discuss any form of violence, (including emotional, sexual, and relationship) and stalking on campus. • Penn Transit: There are shuttles to take you places and more importantly, you can request an on-demand Penn Ride between 6 pm to 3 am to pick you up and drop you to certain neighborhoods. • UPenn Alerts: The Penn community is notified of emergencies or dangerous situations to avoid in certain areas with follow-ups on action taken. • Property Registration: Register valuable items (www.campusexpress.upenn.edu) to increase chances of recovery should it be lost or stolen. • Self-Defense Programs: These are optional trainings provided to the Penn community. Penn Police patrols the campus area 24/7 and are easily accessible. Public Safety Resources Penn Transit cms.business-services. www.publicsafety.upenn.edu 11 upenn.edu/transportation",
    "deleted": true
  },
  "43": {
    "source": "isa-isss-handbook.pdf",
    "content": "Get to Know Your Support Systems at Penn!",
    "deleted": true
  },
  "44": {
    "source": "isa-isss-handbook.pdf",
    "content": "Essential Resources Moving to a new country is no easy feat and adjusting academically and socially can be challenging. For the smooth transition and cultural International students are well- integration of international students. supported holistically through resource centers that focus on different aspects of their Penn life! Your program managers, faculty advisors and professors, and school’s student services offices are with you. Advocate for yourself and always global.upenn.edu/isss/integration ask for help! Free academic support, tutoring, support Support with job searches, support with for students with disabilities, and more. interviews, resumes, connections, etc. weingartencenter.universitylife careerservices.upenn.edu .upenn.edu Do explore the Marks Family Center For Excellence in 13 Writing too: writing.upenn.edu/critical/wc/",
    "deleted": true
  },
  "45": {
    "source": "isa-isss-handbook.pdf",
    "content": "And More… Penn Cultural Centers As international students ourselves, we assure you that you will find a community at Penn that will help you thrive! Penn is also home to one of the oldest Women and LGBT+ centers in the country. Cultural centers offer spaces for you to meet like- minded people, study, collaborate, and participate in cultural events. They also support with student advising and connect you to the right resources for your needs. universitylife.upenn.edu/ Some centers also offer free printing and cultural-centers/ even provide need-based funding. 14",
    "deleted": true
  },
  "46": {
    "source": "isa-isss-handbook.pdf",
    "content": "Student Organizations Learning is continuous. Do not limit it to just the four walls of a classroom. Make the most out of the Penn experience by Penn Student Groups joining a student group to explore your passion, build your network, and develop new skills. Student-run groups are mainly of three types (scan the QR code to know more): • Penn Clubs: Over a hundred to choose from! • Fraternities and Sororities: Explore the chapters at Penn and their work. • Student Governments Deliberative and representative bodies for www.upenn.edu/life-at- students in each school. penn/groups-and-organizations Each school also has its own student organizations and governments too. However, it is important to be mindful of your time commitments. Though tempting, do not jump into too many clubs at the expense of your academics and health. 15",
    "deleted": true
  },
  "47": {
    "source": "isa-isss-handbook.pdf",
    "content": "Campus Life Though all of this may seem like information overload, we promise that you will ease into this new start gradually but surely, by leveraging all the support tailor-made for you. Explore the following for a broader idea: Prepare For Penn Penn University Life: Events global.upenn.edu/isss/ prepare#students_prepare ulife.vpul.upenn.edu/calendar/ campusexpress.upenn.edu Your one-stop-shop for many important student services. A hub for all graduate and A forum for student parents to connect professional students at Penn. and develop supportive networks. Pursue fellowships, scholars programs, Discuss global challenges with and undergraduate research. experts and world leaders. 16",
    "deleted": true
  },
  "48": {
    "source": "isa-isss-handbook.pdf",
    "content": "Pro-Tips Begin your house search at least 2 to 3 months prior to your start date. Get your visa process started ASAP. From the international student community Try not to miss orientation programs. It will help you settle in and get comfortable with people before classes start. Keep an eye out for emails and reminders from Penn Global. Be pro-active in asking people for support, even if you are not used to it. Take advantage of all that Penn has to offer and stay informed. It takes about a week to get a US Bank Debit Card after registration. Have alternatives to pay in place. There are plenty of courses to choose from. Your faculty and program managers will guide you through the process. It can be helpful to seek opinions from alumni through social media too (Whatsapp, Reddit, LinkedIn). You can get your day-to-day medication from pharmacies on campus. If you need specific medication, research if it is available in the US. It gets chilly in Philly! Winter clothing can be expensive, try and pack them beforehand. Thrift stores are affordable and sustainable, and there are many in the area. Penn has one too! Breathe. One step at a time. You got this! Protecting your mental and physical health is really important. Be conscious of it. 17",
    "deleted": true
  },
  "49": {
    "source": "isa-isss-handbook.pdf",
    "content": "Engage With Us @isss.penn @ISSS.Penn Location: St. Leonard’s Court, Suite 305 (3rd Floor) 3819 Chestnut Street Philadelphia, PA 19104 +1 (215) 898-4661 Handbook developed by Aishwarya Manjunath Shetty M.S.Ed’23, Penn GSE",
    "deleted": true
  },
  "50": {
    "source": "isa-isss-handbook.pdf",
    "content": "International Student Resource Handbook Created for students, by students.",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "51": {
    "source": "isa-isss-handbook.pdf",
    "content": "Change is the only constant in life. One’s ability to adapt to those changes will determine one’s success in life. “ Benjamin Franklin Founder of the University of Pennsylvania",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "52": {
    "source": "isa-isss-handbook.pdf",
    "content": "Table of Contents Introductory Message 2 Explore the Campus 3 Immigration and Arrival 4 Penn Card and Penn Key 5 Insurance and Immunizations 6 Managing Finances 7 Student Employment 8 US Banks and Phone Plans 9 Housing and Dining 10 Safety in Philly 11 Essential Resources 13 Student Organizations 15 Campus Life 16 Pro-Tips From Students 17 1",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "53": {
    "source": "isa-isss-handbook.pdf",
    "content": "A Message Dr. Rodolfo “Rudie” Altamirano Executive Director Penn Global Congratulations on your admission to the University of Pennsylvania, and a warm welcome to the Penn community! We are absolutely thrilled that you have chosen Penn as your academic home. As international students, your presence enriches our campus with a mosaic of diverse experiences and outstanding academic abilities. Your unique perspectives and cultural backgrounds contribute to the global tapestry we celebrate at Penn. We understand that starting your journey at Penn as an international student may come with its own set of questions and uncertainties. That's precisely why we have prepared this comprehensive handbook for you. It serves as your compass, guiding you through the initial steps of your Penn experience and acquainting you with the myriad resources available specifically for international students. At Penn, we foster a vibrant and inclusive community that cherishes the contributions of each and every student. We encourage you to embrace opportunities for engagement, seek connections with fellow students and faculty, and explore the wealth of academic and extracurricular offerings. Our campus is a tapestry of ideas, cultures, and perspectives, and we believe that your presence here will not only enrich your own educational journey but also contribute to the diversity of Penn's global community. As you embark on this exciting chapter, we eagerly await your arrival in the beautiful city of Philadelphia. We look forward to seeing you thrive in our close-knit community. If you have any questions or need assistance, please do not hesitate to reach out. We are here to support you every step of the way. Best wishes for an extraordinary start to your Penn adventure! 2",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "54": {
    "source": "isa-isss-handbook.pdf",
    "content": "Explore the Campus Scan the QR Codes to get a good grasp of the buildings on campus, transit services, and other Penn facilities. Virtual Tour Campus Map www.admissions.upenn.edu/virtual-tour www.facilities.upenn.edu/maps 3",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "55": {
    "source": "isa-isss-handbook.pdf",
    "content": "Immigration & Arrival As a new member of the Penn family, We are here to you'll join a community of more than make the smooth 9,000 international students, scholars, transition possible. and employees from over 120 countries. Prepare All you need to know to prepare for and  Set up your iPenn: an important portal! arrive to Penn:  Apply for your Form I-20 (F-1 Visa students) or DS-2019 (J-1 Visa students).  Apply for your US Visa at your local Embassy. This process takes significant time (at least 2 to 3 months). Get started early so that you can get to the States on time for your program! www.global.upenn.edu/isss  Keep all the required documents and receipts A Useful Pre- carefully. These will be needed upon arrival. Departure Checklist Arrival  You will be assigned an I-94 number upon arrival, which is proof of your legal visitor status. You can access it here: https://i94.cbp.dhs.gov/I94 https://global.upenn.edu/sit  You must register your presence at Penn by es/default/files/Pre- checking in with ISSS through iPenn. (A tutorial Departure%20Checklist.pdf will be provided on how to do this in iPenn.) 4",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "56": {
    "source": "isa-isss-handbook.pdf",
    "content": "Penn Card This is your official UPenn Identity Card. It is used to access buildings and libraries on campus, food halls, recreation facilities, and make purchases. Your Penn card may be pre-loaded with a certain amount of Penn Cash and you can top it up. penncard.business-services.upenn.edu You can apply for the Penn Card through the website, but you will need to collect it physically by scheduling an appointment. Penn Key & Password This is your digital key to access all of Penn’s portals and platforms! Once enrolled, you will receive an email with this information. However, for now, when you set up your iPenn, you do it through the ‘Limited Service Login’ where you will receive a ‘Limited Access PIN’. This is NOT your Penn Key. Once your Penn Key is activated, you can log into iPenn with it automatically. 5",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "57": {
    "source": "isa-isss-handbook.pdf",
    "content": "Insurance & Immunization Before arriving at Penn, you need to have health insurance and the required immunizations. While you can receive missing immunizations on campus, it is better to get as much out of the way from your home country! Wellness at Penn Insurance Includes information on insurance and immunization Explore the different insurance options recognized by Penn and enroll in the best fit: • PSIP – Penn Student Insurance Plan • PSI – Emerald, Platinum, Presidential • ISO Plans – For Upenn Penn Student Health and Counseling https://wellness.upenn.edu/ offers 24/7 support for students. Medical: 215-746-3535 The Immunization and Insurance Counseling: 215-898-7021 Compliance Office 215-746-4200 wel-immun@pobox.upenn.edu Immunization wel-shsinsur@pobox.upenn.edu  Understand the immunization requirements.  Get the Immunization Form filled out by a medical professional. Scan this document – you will need it later!  Once you have a Penn Key, log into the Wellness Portal, and submit the required information. If you cannot find certain records, write to the Immunization and Insurance Compliance office for support. 6",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "58": {
    "source": "isa-isss-handbook.pdf",
    "content": "Managing Finances As international students, you are investing a significant amount of money in your education. The financial aspect of it can be overwhelming. Below are some ways you can be supported. Explore the SRFS website to: Student Registration and  Estimate the costs of attendance so that Financial Services you are better prepared.  Learn about financing and payment plans that can ease some stress!  Research opportunities for financial aid from UPenn, and scholarship opportunities in your home country. Write to your program managers and school financial aid www.srfs.upenn.edu officers too. The bill is paid through Penn.Pay. Figure out the cheapest option to do so: Online, wire transfers, mail, etc. and consider currency exchange rates. You also have the option to pay your fees in instalments. Timely communication is crucial. Important Financial Matters Emergency Funding Key financial considerations for In case of financial emergencies, international students: how can Penn support you: sis.vpul.upenn.edu/emergency- global.upenn.edu/isss/finances and-opportunity-funding/ 7",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "59": {
    "source": "isa-isss-handbook.pdf",
    "content": "Student Employment Working part-time on campus is a great way to cover some of your living expenses. Below are some things to keep in mind: • International students are limited to on-campus employment. • International students not allowed to work for more than 20 hours per week, except during breaks, when they may work full time (40 hours per week). • You can search for jobs on Workday@Penn (once you have your Penn Key) You can also seek jobs through professors or networks on campus. • Then, you must apply for a Social Security Number (SSN) to work in the US, get paid, and file taxes. • Payments are usually made on a weekly basis. If you become a Resident Advisor (RA) for a College House, your accommodation expenses are slashed significantly! Explore more below! 8",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "60": {
    "source": "isa-isss-handbook.pdf",
    "content": "US Banks & Phone Plans Get A US Bank Account Setting up a bank account is simple. You will need your passport, proof of residence, Penn card, and for some banks, your SSN. Visit the different banks around campus, inquire explicitly about their student plans/benefits, and choose the one that works best for your needs. Note that charges and fees for services vary. • PNC Bank: 3535 Market Street (can be linked to your Penn Card!) • Bank of America: 3925 Walnut Street • Chase Bank: 4001 Chestnut Street • TD Bank: 3735 Walnut Street • Wells Fargo Bank: 3550 Market Street • Santander Bank: 3802 Chestnut Street, 3131 Market Street • Citizens Bank: 134 South 34th Street • UPenn Student Federal Credit Union: 3401 Walnut Street Compare the charges for international money transfers, if it is applicable to you. Know the difference between a Checking and Savings account. Also, watch out for the minimum balance required to be maintained. Get A Phone Plan Popular network providers have their stores in or near campus. Again, it is a good idea to visit them to understand the best option for you as a student. Data packs in the US can be expensive. Luckily, we have Wi-Fi all over campus! • T-Mobile: 3441 Chestnut Street Some phone plans work • AT&T: 3741 Walnut Street out significantly cheaper • Verizon: 1430 Walnut Street if you register as a group! • ConnectEd: connectedmobile.co • Google Fi: fi.google.com 9",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "61": {
    "source": "isa-isss-handbook.pdf",
    "content": "Housing & Dining Housing Penn Residential Services (College Houses) • Undergraduates have college houses to choose from (Penn Residential Services) or can stay off- campus. • Graduate and professional students must find their own accommodation, but Penn Off- Campus Services will guide you through it! residential-services.business- Off-Campus Services can review your contract. services.upenn.edu/living-options Do not commit to landlords immediately. They also have a portal to help you match Penn Off-Campus Services roommates to house-hunt together! Consider the distance from your place to your school. Rest assured, Philly is well-connected through buses and trolley options. Dining cms.business-services.upenn.edu/ offcampusservices/ Penn Dining offers: • Meal Swipes in the Residential Food Halls (Buffet) • Dining Dollars (loaded in your Penn card) that you Penn Dining Options can swipe in these halls and in certain stores. • Or a combination of both! For graduate students who want to cook their own meals, there are grocery stores nearby which have international foods and spices too! Food trucks all around campus offer cheap and delicious meals. (Approx. $8 to $12) https://dining.business Also, look out for tons of events with free food! -services.upenn.edu/ 10",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "62": {
    "source": "isa-isss-handbook.pdf",
    "content": "Safety in Philly It is understandable that you are concerned about the crime rates in Philly. We want to ensure you feel secure by highlighting Penn’s high-quality safety resources. Mental Health Help Line: 215-898-4357 Penn Emergency Line: 215-537-3333 • Penn Guardian App: This connects you with the Public Safety Division at all times. • Walking Escort Service: If you feel uncomfortable walking alone, you can request a safety representative to walk with you 24/7. This is particularly useful at nights. • Penn Violence Prevention: This provides a wide range of confidential and safe resources to discuss any form of violence, (including emotional, sexual, and relationship) and stalking on campus. • Penn Transit: There are shuttles to take you places and more importantly, you can request an on-demand Penn Ride between 6 pm to 3 am to pick you up and drop you to certain neighborhoods. • UPenn Alerts: The Penn community is notified of emergencies or dangerous situations to avoid in certain areas with follow-ups on action taken. • Property Registration: Register valuable items (www.campusexpress.upenn.edu) to increase chances of recovery should it be lost or stolen. • Self-Defense Programs: These are optional trainings provided to the Penn community. Penn Police patrols the campus area 24/7 and are easily accessible. Public Safety Resources Penn Transit cms.business-services. www.publicsafety.upenn.edu 11 upenn.edu/transportation",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "63": {
    "source": "isa-isss-handbook.pdf",
    "content": "Get to Know Your Support Systems at Penn!",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "64": {
    "source": "isa-isss-handbook.pdf",
    "content": "Essential Resources Moving to a new country is no easy feat and adjusting academically and socially can be challenging. For the smooth transition and cultural International students are well- integration of international students. supported holistically through resource centers that focus on different aspects of their Penn life! Your program managers, faculty advisors and professors, and school’s student services offices are with you. Advocate for yourself and always global.upenn.edu/isss/integration ask for help! Free academic support, tutoring, support Support with job searches, support with for students with disabilities, and more. interviews, resumes, connections, etc. weingartencenter.universitylife careerservices.upenn.edu .upenn.edu Do explore the Marks Family Center For Excellence in 13 Writing too: writing.upenn.edu/critical/wc/",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "65": {
    "source": "isa-isss-handbook.pdf",
    "content": "And More… Penn Cultural Centers As international students ourselves, we assure you that you will find a community at Penn that will help you thrive! Penn is also home to one of the oldest Women and LGBT+ centers in the country. Cultural centers offer spaces for you to meet like- minded people, study, collaborate, and participate in cultural events. They also support with student advising and connect you to the right resources for your needs. universitylife.upenn.edu/ Some centers also offer free printing and cultural-centers/ even provide need-based funding. 14",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "66": {
    "source": "isa-isss-handbook.pdf",
    "content": "Student Organizations Learning is continuous. Do not limit it to just the four walls of a classroom. Make the most out of the Penn experience by Penn Student Groups joining a student group to explore your passion, build your network, and develop new skills. Student-run groups are mainly of three types (scan the QR code to know more): • Penn Clubs: Over a hundred to choose from! • Fraternities and Sororities: Explore the chapters at Penn and their work. • Student Governments Deliberative and representative bodies for www.upenn.edu/life-at- students in each school. penn/groups-and-organizations Each school also has its own student organizations and governments too. However, it is important to be mindful of your time commitments. Though tempting, do not jump into too many clubs at the expense of your academics and health. 15",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "67": {
    "source": "isa-isss-handbook.pdf",
    "content": "Campus Life Though all of this may seem like information overload, we promise that you will ease into this new start gradually but surely, by leveraging all the support tailor-made for you. Explore the following for a broader idea: Prepare For Penn Penn University Life: Events global.upenn.edu/isss/ prepare#students_prepare ulife.vpul.upenn.edu/calendar/ campusexpress.upenn.edu Your one-stop-shop for many important student services. A hub for all graduate and A forum for student parents to connect professional students at Penn. and develop supportive networks. Pursue fellowships, scholars programs, Discuss global challenges with and undergraduate research. experts and world leaders. 16",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "68": {
    "source": "isa-isss-handbook.pdf",
    "content": "Pro-Tips Begin your house search at least 2 to 3 months prior to your start date. Get your visa process started ASAP. From the international student community Try not to miss orientation programs. It will help you settle in and get comfortable with people before classes start. Keep an eye out for emails and reminders from Penn Global. Be pro-active in asking people for support, even if you are not used to it. Take advantage of all that Penn has to offer and stay informed. It takes about a week to get a US Bank Debit Card after registration. Have alternatives to pay in place. There are plenty of courses to choose from. Your faculty and program managers will guide you through the process. It can be helpful to seek opinions from alumni through social media too (Whatsapp, Reddit, LinkedIn). You can get your day-to-day medication from pharmacies on campus. If you need specific medication, research if it is available in the US. It gets chilly in Philly! Winter clothing can be expensive, try and pack them beforehand. Thrift stores are affordable and sustainable, and there are many in the area. Penn has one too! Breathe. One step at a time. You got this! Protecting your mental and physical health is really important. Be conscious of it. 17",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "69": {
    "source": "isa-isss-handbook.pdf",
    "content": "Engage With Us @isss.penn @ISSS.Penn Location: St. Leonard’s Court, Suite 305 (3rd Floor) 3819 Chestnut Street Philadelphia, PA 19104 +1 (215) 898-4661 Handbook developed by Aishwarya Manjunath Shetty M.S.Ed’23, Penn GSE",
    "uploaded_at": "2025-04-26T19:39:03.222298",
    "deleted": false
  },
  "70": {
    "source": "SEVP_International Student Life cycle_Oct 2015.pdf",
    "content": "International Student Life Cycle (F-1/M-1) 1 Apply to a Student and 2 Receive a Form I-20, 3 Pay the I-901 Exchange Visitor Program “Certificate of Eligibility for SEVIS Fee (SEVP)-Certified School Nonimmigrant Student Status” Student must pay the I-901 Student applies and is accepted A student’s Student and Exchange Visitor SEVIS Fee at FMJFee.com. to an SEVP-certified school. Information System (SEVIS) record is created and the student is then issued a Form I-20 by the designated school official (DSO) at the SEVP-certified school they have chosen to attend. 6 Maintain Status During 5 Arrive in the United States 4 Apply for Student Visa Program Study Student arrives no more than Student brings their Form I-20 Student must take a full course of study, 30 days before their program and other required documents to not work without prior authorization and start date and presents their apply for a student visa from the speak with their DSO if they cannot Form I-20 and valid student visa U.S. Department of State. to U.S. Customs and Border finish classes before their program end Protection at the port of entry. date, or have any other concerns about maintaining lawful status. Work Requirements(F-1 Students Only) 7 Explore Post-Graduation 8 Depart the Opportunities An F-1 student may work only when United States authorized, including: A student has the option to transfer An F-1 student has 60 days to • On campus schools, change education levels (e.g., depart the United States after • Off campus, if financially needed and with undergraduate to graduate), or if completion of their program of authorization from USCIS eligible, apply to U.S. Citizenship and study or OPT. An M-1 student has • Curricular practical training integral to their Immigration Services (USCIS) for 30 days after completion of their program of study post-completion Optional Practical program of study to depart. • OPT-related to the student’s major and with Training (OPT) opportunities. authorization by USCIS. For more information visit StudyintheStates.dhs.gov/Students",
    "uploaded_at": "2025-04-26T19:39:06.620892",
    "deleted": false
  },
  "71": {
    "source": "OPT Practical Training.pdf",
    "content": "SEVIS User Guide g n Contents i General Information 1 n What is Optional Practical Training? 2 i Regulations and Policy Guidance 2 a OPT Types 2 r OPT Request Statuses 3 T OPT Eligibility 3 OPT Process at a Glance 4 l Form I-765 Filing Deadlines Once DSO Requests OPT in SEVIS 5 a Recommend Optional Practical Training 5 c Key Dates 5 i Recommend OPT 6 t c Edit OPT Request 10 Cancel/Withdraw OPT Request 12 a Cancel OPT Request 13 r Withdraw OPT Request 14 P Report OPT Participation 14 Post-completion OPT and Unemployment 15 l a OPT-Related SEVIS Alerts and Lists 15 n View OPT Employment Information 16 H-1B Cap-Gap Extension of OPT 17 o Correcting OPT Data: Correction Requests and Data Fixes 17 i Icon Guide 18 t p O General Information F-1 students often want to work. However, employment opportunities are limited and 1 strict rules apply. This document discusses different types of optional practical training (OPT), as well as, required forms, processes, and updating SEVIS. - F",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "72": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide What is Optional Practical Training? Optional practical training is one type of work permission available for eligible F-1 students. It allows students to get real-world work experience related to their field of study. While a Designated School Official (DSO) recommends OPT in SEVIS, it is the student who must apply for the work permit with the U.S. Citizenship and Immigration Service (USCIS). If the OPT is approved, USCIS will issue an Employment Authorization Document (EAD). The student must not begin working before the start date on the EAD. Regulations and Policy Guidance Complex rules and guidance apply to OPT. Any OPT requests entered into SEVIS must comply with federal regulations. DSOs must understand the following regulations and policy guidance:  8 Code of Federal Regulations (CFR) 214.2(f) (10) through (13)  8 CFR 274a.12(c)(3)  SEVP Policy Guidance on OPT OPT Types There are three general types of OPT: OPT: For students enrolled full-time in post-secondary schools, seminaries, conservatories, or seminaries for one full academic year. Twelve months of practical training is available for each higher level of study. (For example, a student may have 12 months for a bachelor’s degree and another 12 months for a master’s degree.)  Pre-Completion OPT: Any portion of OPT used before the student’s Program End Date. It may be part-time or full- time.  Post-Completion OPT: Any portion of OPT used after the student’s Program End Date. It must be full-time. 17-month (STEM) For students who majored in designated Science, Technology, OPT Extension: Engineering, and Math (STEM) degrees approved by DHS. This type of OPT is a 17-month extension of OPT. Cap-Gap OPT For students whose prospective employers filed a qualifying H-1B Extension: cap-subject petition. December 4, 2015 2",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "73": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide OPT Request Statuses The table below lists the statuses used to identify the stages of OPT requests in SEVIS. Status Status Meaning Requested DSO requested OPT in SEVIS on behalf of the student, but USCIS has not yet received the Application for Employment Authorization (Form I-765). Pending USCIS has received the Form I-765. Approved USCIS has approved the Form I-765. Denied USCIS has denied the Form I-765. Canceled DSO has canceled the OPT request in SEVIS. Withdrawn USCIS approved the student’s request to withdraw the Form I-765. OPT Eligibility A student is eligible for OPT if:  The student has been a full-time student for one academic year in an SEVP-certified: o College o University o Conservatory o Seminary  The student is not studying English as a Second Language.  The student’s proposed employment directly relates to the student’s major area of study.  The student has not used all of the practical training available at the current level of study.  The student has not been authorized for 12 months or more of full-time Curricular Practical Training (CPT). Note: Full-time CPT at a previous school at the same program level counts toward the 12-month total. CPT at another program level does not count toward the 12-month total. December 4, 2015 3",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "74": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide OPT Process at a Glance 6. DSO: 5. Student: Report 1. Student: 2. DSO: 3. Student: 4. USCIS: - Get EAD address Request Recommend File Adjudicate - Start work change and OPT OPT Form I-765 Form I-765 - Reports employer to DSO information The OPT application process involves many players and several steps: Step Users Actions 1 Student follows school processes to submit an OPT request to the DSO. 2  DSO confirms eligibility, enters the request in SEVIS and prints the Form I-20.  The DSO signs the Form I-20.  The status of the OPT request in SEVIS immediately changes to Requested. Note: Any OPT status updates to SEVIS are automatic and require no action on the part of the DSO. 3 Required paperwork:  The student signs the Form I-20.  The student completes an Application for Employment Authorization (Form I-765). The Form I-765, fee, and supporting documentation must be filed with U.S. Citizenship and Immigration Services (USCIS) within 30 days of the DSO’s recommendation. Note: The Form I-765 is available on the USCIS website http://www.uscis.gov/i-765 and can be submitted electronically or by mail. The website provides instructions on both processes. 4  Upon receipt of the I-765, USCIS issues a Receipt Notice (Form I-797), which contains the receipt number assigned to the case.  Through an interface with USCIS, the status of the OPT request in SEVIS changes to Pending.  If USCIS needs more information, the student will receive a Request For Evidence, which states what information is needed and the deadline for submitting it. The student must respond by the deadline, or the application will be denied.  USCIS then makes a decision on the application: o If the application is approved, USCIS issues an EAD, and the OPT Request status in SEVIS changes to Approved. o If the Form I-765 is denied, the OPT Request status in SEVIS changes to December 4, 2015 4",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "75": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide Step Users Actions Denied. 5  The student receives the EAD and can begin work once the authorized date arrives.  When the student is hired, the student reports the employer information to the DSO. Note: While on OPT, the student must report to the DSO within 10 days any changes in the student’s name or address, and employment information. 6 The DSO must update SEVIS within 21 days with the employment information and any name or address changes. Form I-765 Filing Deadlines Once DSO Requests OPT in SEVIS Day 1 Day 30 After Day 30 •DSO •30-day •Applications requests countdown received by OPT in SEVIS ends USCIS after •30-day •USCIS must Day 30 will countdown receive the be denied begins application Note: If the student does not file a Form I-765, the DSO should cancel the OPT request in SEVIS. Recommend Optional Practical Training Key Dates DSOs must be mindful of several key dates when entering OPT in SEVIS. December 4, 2015 5",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "76": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide 1 Year after Full- 90 Days before 60 days after 14 Months after Program End Date Time Studies Begin Program End Date Program End Date Program End date •First date that F-1 •Earliest date that •Pre-Completion •Last date to •Last possible end OPT can be Form I-765 may OPT must end no request post- date for post- requested arrive at USCIS for later than this date completion OPT in completion OPT •Exception: OPT can post-completion SEVIS be requested OPT •Filing deadline for earlier, if student USCIS to receive will complete one Form I-765 academic year •Latest possible before OPT requested start employment date for post- begins. completion OPT Post-Completion OPT Planning Tool: An Excel spreadsheet that allows users to calculate the amount of OPT available for a student and generate suggested timelines for a student, based on the Program End Date and the desired OPT start date. Recommend OPT To recommend OPT: 1. Navigate to the Student Information page. 2. Click OPT Request. The OPT Employment page opens. (ALT Text: Screenshot of OPT Employment page with arrow pointing to “New OPT Employment” link at the bottom left of the screen.) December 4, 2015 6",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "77": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide 3. Click New OPT Request. The Add OPT Employment page opens. (ALT Text: Screenshot of Add OPT Employment Page) 4. Enter information relevant to the OPT authorization. Field Description * The student has met or  Click the checkbox to indicate the student has met will meet the one full the enrollment requirement. academic year  This is a required field. requirement by the employment start date. * OPT Type  Select either: o Pre Completion: All employment occurs before the Program End Date. o Post Completion: All employment occurs after the Program End Date.  This is a required field. * Full-time/Part-time  Select from the drop-down list: o Part-time: Select if Pre-Completion OPT occurs when school is in session. o Full-time: Select full-time if:  Pre-Completion OPT occurs when school is not in session. December 4, 2015 7",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "78": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide Field Description  Employment is Post-Completion OPT.  This is a required field. SEVIS will not allow overlapping segments of OPT. You must specify if the OPT is pre-completion vs. post-completion OPT and must be either full vs. part time. * Start Date  The date that OPT authorization starts.  This date cannot be before the student has completed one academic year of full-time study. Format: MM/DD/YYYY. Post-Completion OPT: Start Date must be on or after the Program End Date. It cannot be more than 60 days after the Program End Date.  This is a required field. * End Date  The date the OPT authorization is to end. Format: MM/DD/YYYY o Pre-Completion OPT: Cannot be after the Program End Date. o Post-Completion OPT: Cannot enter a date more than 12 months after the Employment Start Date.  This is a required field. SEVIS will not allow overlapping segments of OPT. Student Remarks Enter or update remarks regarding the student’s planned employment. Use this field to convey important information you think the student or government officials need to know. For example: student will pursue training .related to studies. This field is limited to 1,000 characters. Note: Comments entered here overwrite any existing remarks that print in the Remarks field on Page 1 of the Form I-20. USCIS has noted they want to see Employment Remarks  Enter any applicable remarks about the student’s employment. This field is limited to 250 characters.  These remarks do not print on the Form I-20. 5. Review the information. Click either Save or Cancel: December 4, 2015 8",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "79": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide  Save: Submits the OPT request. A message indicates that the update was successful. (ALT Text: Screenshot of Update Successful page.) Click either Print I-20 or Return Employment List: o Print I-20: Prints the Form I-20 with the OPT recommendation. Note: Sign the Form I-20 and give the printed Form I-20 to the student. The student must sign the Form I-20 and submit it to USCIS with the application for work authorization. o Return Employment List: Returns the user to the OPT Employment page. The newly added OPT employment will be on the list. (ALT Text: Screenshot of OPT Employment page with requested OPT employment added.)  Cancel: Cancels the action and returns user to the OPT Employment page. 6. Review the information on the OPT Employment page. To make changes to the existing OPT request, click Edit. December 4, 2015 9",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "80": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide Note: To recommend an additional period of OPT, click New OPT Request and repeat Steps 4 and 5. The start and end dates for segments of OPT cannot overlap. Click either Print I-20 or Return:  Print I-20: Prints the Form I-20.  Return: Returns the user to the Student Information page. Edit OPT Request OPT information can be edited depending on the status of the OPT request: Request Status Editable Fields Requested  Full-time/Part-time  Fulfillment of 1-year requirement  Employment Remarks  Student Remarks Pending  Full-time/Part-time  Fulfillment of 1-year requirement  Employment Remarks  Student Remarks Approved  Employer Name  Employer Address  Explanation for relationship to course work  Employment Remarks  Student Remarks To edit an OPT request: 1. Click OPT Request on the Student Information page. The OPT Employment page opens. December 4, 2015 10",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "81": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide (ALT Text: OPT Employment page listing the existing OPT request with the Edit link.) 2. Click Edit to the right of the OPT segment to be edited. The Edit OPT Employment page opens. (ALT Text: Screenshot of Edit OPT Employment page.) December 4, 2015 11",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "82": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide 3. Make any necessary edits: Field Description * The student has met or  Click the checkbox to indicate the student has met will meet the one full the enrollment requirement. academic year  This is a required field. requirement by the employment start date. * Full Time/Part Time  Select from the drop-down list: o Part Time: Select if Pre-Completion OPT occurs when school is in session. o Full Time: Select full-time if:  Pre-Completion OPT occurs when school is not in session.  Employment is Post-Completion OPT.  This is a required field. Student Remarks Enter or update remarks regarding the student. Note: Comments entered here overwrite any existing remarks that print in the Remarks field on page one of the Form I-20. Employment Remarks Enter any applicable remarks about the student’s employment. 4. Click either Save or Cancel:  Save: Updates this employment request in the student’s record. An Update Successful message indicates if the edit was successful. Click one of the following: o Click Print I-20 to print the Form I-20.  Sign page one of the Form I-20, and give the printed Form I-20 to the student.  Student must also sign page one of the Form I-20 and submit it to USCIS with the application for work authorization. o Click Return to Employment List to return to the OPT Employment page.  Cancel: Returns the user to the OPT Employment page without updating the employment segment. Cancel/Withdraw OPT Request An OPT request can be canceled in SEVIS ONLY if the OPT Request is in Requested status. December 4, 2015 12",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "83": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide OPT Request Status in SEVIS = Requested OPT Request Status in SEVIS = Pending • P/DSO can cancel OPT in SEVIS. • P/DSO cannot cancel OPT in SEVIS. • OPT Request status changes to Canceled. • Student must write USCIS to withdraw • Do not cancel OPT request if the student the Form I-765. has mailed the Form I-765 to USCIS. • After processing by USCIS, OPT request status in SEVIS changes to Withdrawn. Note: Any request in Requested status longer than 180 days is automatically canceled by SEVIS. Cancel OPT Request To cancel an OPT request: 1. Navigate to the Student Information page. 2. Click OPT Request from the Student Information page. The OPT Employment page opens. (ALT Text: Screenshot of OPT Employment page.) December 4, 2015 13",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "84": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide 3. Click Cancel Request next to the segment of OPT you want to cancel. A Confirm Cancelation of Request page opens. (ALT Text: Screenshot of Confirm Cancelation of Request page.) 4. Click either Yes or No:  Yes: Cancels the OPT request. An Update Successful message verifies that the update was successful. Click either Return to Employment List or Print I-20: o Click Print I-20 to print the Form I-20. o Click Return to Employment List to return to the OPT Employment page; and then click either Return or Print I-20:  Click Print I-20 to print the Form I-20.  Click Return to return to the Student Information page. Note: The student’s OPT status in the Student Requests section updates to Canceled.  No: Returns the user to the OPT Employment page without canceling the OPT request. Withdraw OPT Request Once an OPT request status changes to Pending, the student must write USCIS to withdraw the OPT application. The request must:  Be sent to the USCIS Service Center processing the application. The address is on the USCIS-issued Receipt Notice sent to the student.  Include the receipt number USCIS assigned the case when it was filed. Report OPT Participation While on OPT, a student is required to report the following to their DSO:  Change in student’s legal name.  Change in student’s address while on OPT. December 4, 2015 14",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "85": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide  Changes in employment or interruption of employment. DSOs update SEVIS to reflect the changes. 8 CFR 214.2(f)(12)(ii)(E) SEVP OPT Policy Guidance DSOs are expected to add, edit, or delete employer information in a timely manner. Post-completion OPT and Unemployment While students are not required to have an employer when OPT is requested in SEVIS, students authorized for post-completion OPT are expected to be employed. A student on post-completion OPT can be unemployed for a total of 90 days. A student whose record lacks employer information is considered unemployed.  SEVIS will auto-terminate students who accrue 90 consecutive days of unemployment. SEVIS will allow for student and P/DSO reporting deadlines before terminating the record. This functionality is currently disabled.  SEVP officials can manually terminate a student who accrues 90 total days of unemployment. P/DSOs must enter employer information into SEVIS. 8 CFR 214.2(f)(10)(ii)(E) SEVP Policy OPT Guidance OPT-Related SEVIS Alerts and Lists The following Alert List and Student Lists in SEVIS help DSOs monitor and manage students on OPT: December 4, 2015 15",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "86": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide Alert/List Description Students who have Approved OPT without This Alert List shows: Current Employer Information • SEVIS ID • Surname/Primary Name • Given Name • OPT Type (Post-completion or STEM OPT) • OPT Actual Start Date • OPT Actual End Date • Latest OPT employment end date • Number of days since the last employment date Students with Requested, Pending, or This Student List shows: Approved Optional Practical Training • Active indicator (OPT) • SEVIS ID • Visa Type • Surname/Primary Name • Given Name • DSO Recommended Start and End Dates • USCIS Approved OPT Start and End Dates • OPT Type • Request Status and Receipt Number Students Terminated for Exceeding the This Student List shows: Maximum Number of Days of • SEVIS ID Unemployment • Class of Admission • Surname/Primary Name • Given Name • Termination Date • OPT Type View OPT Employment Information DSOs can view a student’s OPT information on the following pages, which are accessed through the Student Information page: December 4, 2015 16",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "87": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide  Request/Authorization Details page that lists only current authorizations.  Employment Information page that lists all employment authorizations linked to the SEVIS ID. Refer to the Practical Training Indicators and Dates topic for details on:  How the practical training indicator displays  How SEVIS derives the three sets of dates associates with practical training H-1B Cap-Gap Extension of OPT SEVIS will automatically extend post-completion OPT if:  On or after April 1, an employer files an eligible H-1B petition to change the student’s status.  The requested start date for the H-1B is October 1.  The student’s OPT ends on or after April 1. Correcting OPT Data: Correction Requests and Data Fixes If OPT information in SEVIS does not reflect applications filed with or decisions made by USCIS, DSOs can ask to have the record corrected. There are two ways to correct data in a student record. Method What Can be Fixed Correction Request This option is used to request changes (using SEVIS) for the following:  Status of OPT Request  Employment Start Date  Employment End Date Help Ticket (Data Fix) This option is used for more complicated data fixes and requires DSOs to call the SEVIS Help Desk (1-800-892-4829). Types of OPT-related data fixes include:  Adding retroactive OPT to a record  Changing the OPT request status for an OPT request that is already in Approved status  Any data fix that cannot be submitted in a correction request December 4, 2015 17",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "88": {
    "source": "OPT Practical Training.pdf",
    "content": "Optional Practical Training (F-1) SEVIS User Guide Icon Guide See the SEVIS Help Icons on the SEVIS Help Hub for a quick-reference of the icons used in this user guide. December 4, 2015 18",
    "uploaded_at": "2025-04-26T19:39:13.879082",
    "deleted": false
  },
  "89": {
    "source": "maintaining-f-1-status.pdf",
    "content": "Student Center North, N203, Houston, TX 77204-3024  Phone: (713) 743-5065  Email: isssohlp@central.uh.edu  http://uh.edu/oisss MAINTAINING F-1 STATUS UH/STUDENT ID:________ This may be the most important document you will read while you are in the United States. It is your responsibility to know and obey F-1 regulations or face possible removal from the U.S. F = FULL-TIME STUDENT 1. Be a full-time student each main semester. You must complete (not just register) for a full course load each main semesters. To maintain your status, each spring and fall semester, undergraduate and post-baccalaureate students must complete 12 hours and graduate students 9 hours at the graduate level. Note: Some degree programs may require more hours for academic reasons. Check with your department. Towards your full-time requirement, you may not take more than the equivalent of one class (three credit hours) per semester online or through (a)synchronous distance education (tape purchase or broadcast). You are required to complete 6 hours for the summer session(s) if the program start date on your I-20 is for the summer semester. You are also required to enroll for summer if it is you final semester to complete your degree. You must receive the authorization before you drop or take below full-time hours. Please make an appointment to see an International Student Counselor BEFORE taking below full-time hours even if you are failing the class. A grade of “W” does not count toward your full-time requirement. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu A = AUTHORIZATION FOR EMPLOYMENT & TRAINING 1. Never work off-campus unless you have current authorization from an International Student Counselor or the DHS. You must either have authorization on page 2 of your I-20 or an employment authorization card (EAD) from USCIS. All off-campus employment has a beginning and ending date. Renewals must be done before resuming work. Even 1 day of work without authorization is a serious violation of U.S. law. On-campus work does not require authorization, but you must maintain your full-time student status to be eligible. On-campus work is limited to no more than 20 hours per week during the fall and spring and may be full-time during the summer and winter breaks. Most on-campus student jobs, by university policy, are still limited to 20 hours a week even during the summer. You may not engage in on-campus employment after your completion of study. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu C = CARRY CURRENT DOCUMENTS 1. Keep your passport valid at all times. Your passport should be valid for at least 6 months into the future. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 2. You are required to carry your immigration documents (passport, I-20) with you. You",
    "uploaded_at": "2025-04-26T19:39:17.080004",
    "deleted": false
  },
  "90": {
    "source": "maintaining-f-1-status.pdf",
    "content": "passport should be valid for at least 6 months into the future. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 2. You are required to carry your immigration documents (passport, I-20) with you. You can be fined $100 and/or sent to jail for up to 30 days if you do not have your documents with you. Local law enforcement officials in Houston may only request a government ID, but they still recommend that you carry photocopies of your immigration documents with you at all times in the greater Houston area. You should carry the original documents with you outside of Houston, even if you are remaining in the U.S. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 3. Inside the U.S. you must maintain your visa status, not your visa sticker in your passport. The visa sticker in your passport can expire while you are in the U.S. because its ONLY function is as a “key” to enter or re-enter the U.S. Your non-immigrant status is defined with the F-1 and D/S (Duration of Status) located on your admissions record known as the I-94. You must maintain your status (not the sticker) in order to remain in the U.S. You maintain your visa status by obeying all U.S. regulations (highlighted in this handout). You only need to renew your expired F-1 visa sticker if you leave the U.S. and want to re-enter. Be sure to only enter with an F-1 visa if you want to have F-1 status in the U.S. The type of visa sticker you use determines your status in the U.S. If you are an F-1 student and have a specific departure date on your I-94 card (there is no D/S), visit our office immediately. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 4. Only attend the school listed on your current I-20. To attend another school, you must transfer your SEVIS record to that school (obtain approval on a new I-20) or receive a concurrent enrollment letter from our office. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu CARRY CURRENT DOCUMENTS continued on next page…",
    "uploaded_at": "2025-04-26T19:39:17.080004",
    "deleted": false
  },
  "91": {
    "source": "maintaining-f-1-status.pdf",
    "content": "Student Center North, N203, Houston, TX 77204-3024  Phone: (713) 743-5065  Email: isssohlp@central.uh.edu  http://uh.edu/oisss 5. Apply for an extension of your I-20 before the expiration date. The extension can only be granted by our office before the expiration date listed on item 5 of your I-20. Valid reasons include change in major, research difficulties, or a medical excuse. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu T = TRANSITIONS 1. Report any change of address to the U.S. Department of Homeland Security (DHS) and ISSS within 10 days of the change every time you move using DHS electronic Form AR-11 and your PeopleSoft Self-Service. You may be fined $200 and/or placed in jail for up to 30 days if DHS does not have your current address on file. The AR-11 may be filed electronically by visiting the USCIS website at www.uscis.gov and clicking on “change of address online.” Form AR-11SR needs to be used if you are required to participate in Special Registration. You should also report within 10 days the new address, phone number and email to ISSSO using your PeopleSoft account (http://my.uh.edu/) to update your SEVIS address type. Never blank out your “SEVIS” address type in PeopleSoft. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 2. Complete an I-20 transfer whenever you change schools. If you plan to transfer to another school you will need to request a release of your SEVIS I-20 record from UH. An I-20 transfer (not the same as transferring academic credit) is not complete until you have received a SEVIS I-20 from the new school and reported to the new school. A SEVIS I-20 transfer must be completed within 15 days of the program start date on your new I-20. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 3. Obtain a new I-20 whenever you make a change in degree levels. This includes changing levels at the same school or a new one (e.g., bachelor's to master's degree) or beginning a new degree at the same level (e.g., master’s degree to a 2nd master’s). I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 4. Obtain a travel endorsement on page 3 of your I-20 before leaving the U.S. if you plan to reenter. This will be needed if you want to reenter the U.S. It is not necessary if you are returning home permanently. An I-20 is no longer valid for reentry once you complete the degree listed on your I-20, even if the I-20 has not expired. I completely understand this regulation and will comply with it I have questions or need more information and will email",
    "uploaded_at": "2025-04-26T19:39:17.080004",
    "deleted": false
  },
  "92": {
    "source": "maintaining-f-1-status.pdf",
    "content": "if you are returning home permanently. An I-20 is no longer valid for reentry once you complete the degree listed on your I-20, even if the I-20 has not expired. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 5. Make a transition within 60 days of completing your degree or optional practical training (OPT). If you are not required to take any additional courses to satisfy your degree requirements, you are considered to have completed the course of study listed on your I-20 and you must take action to maintain status. It is your responsibility to keep track of your degree progress and make a timely application for graduation. You have a 60 day grace period to transition to a new I-20 for a new degree program or depart the U.S. after completion of your degree program or OPT. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu 6. Complete your degree earlier than I-20 program ending date. You must notify ISSSO in order to end your I-20 properly in the SEVIS system to avoid any complications of your status or future re-entry to the U.S. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu S = STAY IN TOUCH 1. Realize that SEVIS (Student & Exchange Visitor Information System) requires ISSSO to regularly report all events in the life of a student via the internet. Due to this close tracking, it is vital that you remain in status by following all the items on this form and stay in touch with our office so that you can avoid unintentional violations. The government may change or add to the F-1 regulations at any time. It is your responsibility to know them by attending public information meetings when offered, visiting our website, and read any emails that are sent by our office to you. 2. I am not eligible to apply for U.S. public benefits. I will contact ISSSO if I have any questions. I completely understand this regulation and will comply with it I have questions or need more information and will email these concerns to isssohlp@central.uh.edu “I have read all of the above statements and understand that I am required to know and obey all F-1 regulations.” Name ____________________________________ Signature ____________________________________ Date _________________",
    "uploaded_at": "2025-04-26T19:39:17.080004",
    "deleted": false
  },
  "93": {
    "source": "F-1-Student-Visa-and-Arrival-Information.pdf",
    "content": "F-1 Student Visa & Arrival Information This instruction sheet outlines the necessary procedures to obtain your student visa and prepare for your arrival to the United States. SEVIS Fee A SEVIS I-901 fee payment is required for F-1 students and the receipt must be included with all F-1 visa applications. Students should also be prepared to present the SEVIS I-901 fee payment receipt at the U.S. port of entry. Students with a country of citizenship or country of birth of Cameroon, Ghana, Kenya, Nigeria or Gambia, must pay by money order, Western Union Quick Pay or certified check drawn from a U.S. bank. All other students also have the option to make a credit card payment. To pay the SEVIS fee, please visit fmjfee.com. Applying for a Visa To provide time for visa processing, students are encouraged to apply for their visa as soon as they receive their I-20 issued by Northeastern University. U.S. Embassies or Consulates are able to issue F-1 entry visas up to 120 days before the program start date listed on your I-20. In most countries, student visa applicants must appear in person for the visa interview. However, each U.S. Embassy or Consulate sets its own interview policies and procedures. Students should consult the specific embassy website or call for application instructions; see usembassy.state.gov. The following documents are typically required for the F-1 visa application:  Online Nonimmigrant Visa Application (DS-160) confirmation page  Visa application fee payment receipt (visit the U.S. Embassy or Consulate website for specific instructions)  Form 1-20 issued by the Office of Global Services at Northeastern University  Valid passport (must be valid at least 6 months into the future)  Evidence of financial support (proof of sufficient funds for estimated cost of one academic year)  SEVIS I-90 fee payment receipt  A copy of your acceptance letter to Northeastern University  One photograph (see the U.S. Department of State website for photo requirements: travel.state.gov/content/visas/en/general/photos.html) All applicants should be prepared to provide additional information, such as transcripts or diplomas from previously attended institutions, or documents which demonstrate that the applicant intends to return home after their studies. Dependents will receive their own I-20 with a SEVIS ID to apply for the F-2 visa. Dependents are not required to pay the SEVIS fee. Important: No assurances regarding the issuance of visas can be given in advance. Therefore, final travel plans or the purchase of non-refundable tickets should not be made until a visa has been issued. After the visa has been issued, please be sure the F-1 visa sticker in your passport is accurate and that your original I-20 has been returned to you as you will need to have it in hand when entering the U.S. Note: Citizens of Canada and Bermuda do not need to apply for an F-1 visa, but are required to have the I-20 and pay the SEVIS I-901 fee before entering the U.S. to study. Office of Global Services, 405 Ell Hall, 360 Huntington Ave,",
    "uploaded_at": "2025-04-26T19:40:53.242704",
    "deleted": false
  },
  "94": {
    "source": "F-1-Student-Visa-and-Arrival-Information.pdf",
    "content": "in hand when entering the U.S. Note: Citizens of Canada and Bermuda do not need to apply for an F-1 visa, but are required to have the I-20 and pay the SEVIS I-901 fee before entering the U.S. to study. Office of Global Services, 405 Ell Hall, 360 Huntington Ave, Boston, MA 02115 northeastern.edu/OGS | ogs@northeastern.edu | (p) 617.373.2310 | (f) 617.373.8788 Page 1 of 2",
    "uploaded_at": "2025-04-26T19:40:53.242704",
    "deleted": false
  },
  "95": {
    "source": "F-1-Student-Visa-and-Arrival-Information.pdf",
    "content": "F-1 Student Visa & Arrival Information Entering the United States When preparing for your arrival to the U.S., you should plan your travel according to the information provided by the Office of New Student Orientation or your college. According to immigration regulations, F-1 student visa holders can enter the U.S. up to 30 days prior to the program report date on the I-20. Students transferring to Northeastern University in F-1 status from another institution or changing their degree level at Northeastern, may stay in the U.S. or travel between programs, and may enter the U.S. more than 30 days before the new program start date. When you travel, please have the following documents in your carry-on bag:  Valid passport with valid F-1 visa sticker  Your original I-20 issued by Northeastern University  I-901 SEVIS fee receipt  Financial documents  Admissions letter At the U.S. port of entry, you will be required to present your passport and I-20 to the immigration officer who will stamp your passport. In most cases, the officer notes “D/S” (Duration of Status) on your passport pages. This means that you are allowed to stay in the U.S. for the length of time indicated on your I-20, provided that you maintain full- time enrollment and valid F-1 status. Ensure that your passport is properly stamped before exiting the inspection area. Do not enter the U.S. in visitor status (B-1/B-2, WT, or WB). This status does not permit full-time study in the U.S. After your arrival, print your Admission (I-94) number at cbp.gov/I94 and keep a copy of all travel documents (I-94 information, F-1 visa, and I-20) for your personal records. Ensure that your I-94 print out contains the correct information, including F-1 visa status and “D/S”. Office of Global Services, 405 Ell Hall, 360 Huntington Ave, Boston, MA 02115 northeastern.edu/OGS | ogs@northeastern.edu | (p) 617.373.2310 | (f) 617.373.8788 Page 2 of 2",
    "uploaded_at": "2025-04-26T19:40:53.242704",
    "deleted": false
  },
  "96": {
    "source": "f1-travel-visa-guide.pdf",
    "content": "International Student Services (ISS) UW1-160, 18115 Campus Way NE, Campus Box 358500 Bothell, WA 98011 Phone: 425-352-3876 Fax: 425-352-5455 Email: iss@uwb.edu Website: www.uwb.edu/iss I-20 DOs & DON’Ts DO: DON’T:  Keep all I-20s (including previous I-20s) in a safe place  Lose your I-20s (current I-20 and previously issued)  Check to make sure the travel signature on page 3 was signed  Travel outside the U.S. without a current travel signature within 1 year from the date you intend to return to the U.S. (signed within 1 year from the date you intend to re-enter)  Contact ISS any time you have made a change to your situation  Wait until the last day to request a travel signature, updates to (such as your major or anticipated graduation date). your I-20 or resolve problems. F1 TRAVEL & VISA INFORMATION ENTERING THE U.S. ON “INITIAL ATTENDANCE” I-20 TOURIST VISA FOR OTHER COUNTRIES If you are arriving to the U.S. on an initial I-20 (see line #3 on (including Canada) your I-20), please note that F1 visa regulations allow you to You may be required by other countries to obtain a tourist visa only enter the U.S. up to 30 days before the program start if you are planning to visit a country other than your home date on your I-20 (see line #5 on your I-20). country – including Canada and Mexico! Requirements and visa application processes vary, so contact each country’s embassy TRAVEL OUTSIDE THE UNITED STATES or consulate in the U.S. for more information. Canadian You are required have the following with you whenever you Consulate in Seattle, and how to obtain a Canadian tourist re-enter the United States: visa: www.canadainternational.gc.ca/seattle/. A link to foreign consulates in the U.S. are available at www.uwb.edu/iss. 1) Valid Passport. Your passport must be valid for 6 months into the future at all times while in the U.S. You TRAVEL TO CANADA OR MEXICO should contact the consulate of your home country if As a student on an F1 visa, you are eligible for Automatic your passport will be expiring. A list of foreign Revalidation. This allows you to solely travel to Canada, Mexico, consulates located in the U.S. are available at: or Adjacent Islands (except Cuba) and re-enter the U.S. on an www.uwb.edu/iss. expired F-1 visa. This is allowed only if: 2) Valid F1 Visa. Your F-1 visa is permission to enter the 1) Your stay was less than 30 days; U.S. as a student. A visa can only be secured at a U.S. 2) You do NOT apply for a new F1 visa at a US consulate; Embassy. ISS recommends that you apply in your home 3) You are able to present to US immigration officials country. A list of U.S. Embassy locations are available your passport, I-94 card, I-20 with valid travel at: www.uwb.edu/iss. signature, and evidence of full-time enrollment and 3) Current UW Bothell I-20. You may use your current financial support. UW Bothell I-20 for travel if",
    "uploaded_at": "2025-04-26T19:40:57.575791",
    "deleted": false
  },
  "97": {
    "source": "f1-travel-visa-guide.pdf",
    "content": "to present to US immigration officials country. A list of U.S. Embassy locations are available your passport, I-94 card, I-20 with valid travel at: www.uwb.edu/iss. signature, and evidence of full-time enrollment and 3) Current UW Bothell I-20. You may use your current financial support. UW Bothell I-20 for travel if the information on page 1 4) You are not a citizen of “state sponsors of terrorism” is still accurate. If there has been any change in your designated by the U.S. Dept. of State: Cuba, Iraq, Iran, name, major or degree level, you should request a new North Korea, Sudan, and Syria I-20 from ISS before you travel. 4) Current Travel Signature. You need to obtain a travel DEPENDENT TRAVEL signature from ISS on page 3 of your current I-20 in A dependent with a valid F2 visa may re-enter the U.S. with order to re-enter as a continuing F-1 student. ISS his/her passport, visa and dependent I-20 with current recommends that the travel signature be issued within program information on page 1 and a valid re-entry signature 1 year from the date you intend to re-enter the U.S. on page 3. ISS recommends that dependents carry evidence of F-1 visa holder’s legal status and full-time enrollment. ISS recommends that you also have the following with you whenever you re-enter the United States: TRAVEL WITHIN THE UNITED STATES There are no special documents required for travel within the 1) Unofficial Transcript. A transcript is an official record United States (including Hawaii and Alaska). However, ISS from the University of your academic career. You may recommends that you carry your current I-20, passport, I-94 print this from your MyUW account. card and valid F1 visa with you in the event that you are asked 2) Current Course Schedule. You may print this from by a law enforcement officer to provide evidence of your status. your MyUW account. 3) Evidence of Financial Support. You may be asked at ISS also recommends that you carry a valid Washington State the Port of Entry to provide documents that verify that Identification card, as a form or legal identification that is safe you can support your studies. Documents should match to carry on a daily basis. Information on how to obtain a the financial sponsor listed on page 1 of your I-20 and Washington State ID card is at www.uwb.edu/iss . can include bank statements, scholarship letters, etc.",
    "uploaded_at": "2025-04-26T19:40:57.575791",
    "deleted": false
  },
  "98": {
    "source": "f1-travel-visa-guide.pdf",
    "content": "International Student Services (ISS) UW1-160, 18115 Campus Way NE, Campus Box 358500 Bothell, WA 98011 Phone: 425-352-3876 Fax: 425-352-5455 Email: iss@uwb.edu Website: www.uwb.edu/iss OBTAINING A NEW F1 VISA ENTRY VISA TIPS FOR THE VIEW INTERVIEW If your current F1 visa has expired or if you do not have an F1 The following are tips for you in consider when preparing for visa, you must apply for a F1 visa at a U.S. consulate before you your visa interview. You should also visit the website of the U.S. can enter the U.S. It is not possible to obtain an F1 visa within Consulate in your home country for further information about the United States. preparing for your interview. If you will apply for an F1 visa, you should: 1. Be honest. Students have been denied visas for presenting false information. 1) Contact a U.S. Consulate. You should contact the U.S. Consulate where you plan to apply for your F1 visa to 2. Ties to your Home Country. You must be able to show that learn about the visa application process. To access the you have reasons for returning to your home country that are nearest U.S. Consulate, visit: http://usembassy.state.gov stronger than those for remaining in the U.S. “Ties” to your home country that bind you to your home town, homeland, or 2) Collect All Required Documents. In addition to any current place of residence such as job, family, financial required documents listed on the U.S. Consulate’s prospects that you own or will inherit, investments, etc. website, you can also obtain the following official documents that verify your enrollment at UW Bothell, 3. Financial Support. Make sure you bring sufficient proof that from the Office of the Registrar (UW1-160; you have enough money to support yourself in the U.S. registrar@uwb.edu; www.uwb.edu/registration/transcript ) . Students should allow at least 2 business days for 4. English. Anticipate that the interview will be conducted in processing. English and not in your native language. If you are coming to the United States to study only English, be prepared to explain o Official Transcript. A transcript is an official record how English will be useful for you in your home country. from the University of your academic career. You may request an official transcript from the Office of 5. Know the Program and How It Fits Your Career Plans. the Registrar. You may also print an unofficial You should be able to explain how studying in the U.S. relates to transcript from your MyUW account. your future professional career. o Enrollment Verification Letter. This is an official 6. Employment. Your main purpose in coming to the U.S. document from UW Bothell that can confirm that you should be to study, not to work in the U.S. before or after are enrolled in the current quarter, and registered for graduation. While many students do work on-campus during the future quarter. You may request this letter from their studies, employment is not their main purpose. the Office of the",
    "uploaded_at": "2025-04-26T19:40:57.575791",
    "deleted": false
  },
  "99": {
    "source": "f1-travel-visa-guide.pdf",
    "content": "be to study, not to work in the U.S. before or after are enrolled in the current quarter, and registered for graduation. While many students do work on-campus during the future quarter. You may request this letter from their studies, employment is not their main purpose. the Office of the Registrar. ADDITIONAL CONSIDERATIONS VISA DENIALS Studying Abroad through a UW Program: Contact ISS if you It is rare for a returning student to be denied a new F1 visa, are planning to study abroad to discuss full-time enrollment, however there are no guarantees. Be aware that your risk of UW health insurance enrollment, and valid immigration denial increases under the following circumstances: documents upon re-entry to the U.S. 1) You are applying in a country other than your home Extended Absences: Your SEVIS record will be terminated if country you are outside of the U.S. for more than 5 months, unless you have been authorized to study abroad. Consult with ISS if you 2) You have family members (spouse, parents, siblings) plan to be out of the U.S. for more than 5 months. who are citizens or permanent residents in the U.S. Optional Practical Training: In addition to your valid 3) You are pursuing post-completion Optional Practical passport, valid F1 visa, and I-20 you must present your EAD Training (OPT) card and a letter from your employer to the immigration officials upon re-entry to the U.S. If your visa application is denied or significantly delayed, contact ISS so that we are aware of your situation. QUESTIONS? If you have additional questions about travel, visit our Travel section at www.uwb.edu/iss or contact International Student Services at iss@uwb.edu .",
    "uploaded_at": "2025-04-26T19:40:57.575791",
    "deleted": false
  },
  "100": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security 1-20, Certificate of Eligibility for Nonimmigrant Student Status U.S. Immigration and Customs Enforcement OMB NO. 1653-0038 SEVIS ID: NO0024747275 SURNAME/PRIMARY NAME GIVEN NAME Class of Admission Jin Zhechao PREFERRED NAME PASSPORT NAME Zhechao Jin COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP —_ CHINA CHINA CITY OF BIRTH DATE OF BIRTH Shanghai 22 JANUARY 1997 ACADEMIC AND FORM ISSUE REASON ADMISSION NUMBER LANGUAGE Transfer Pending - University of Pennsylvania SCHOOL INFORMATION SCHOOL NAME SCHOOL ADDRESS Northeastern University 360 HUNTINGTON AVE, C/O Office of Global Services, Northeastern University-Silicon Valley BOSTON, MA 02115 SCHOOL OFFICIAL TO CONTACT UPON ARRIVAL SCHOOL CODE AND APPROVAL DATE Juan Taitague BOS214F00257003 International Student & Scholar Advisor 22 JANUARY 2003 PROGRAM OF STUDY EDUCATION LEVEL MAJOR 1 MAJOR 2 MASTER'S Computer and Information Sciences, None 00.0000 General 11.0101 PROGRAM ENGLISH PROFICIENCY ENGLISH PROFICIENCY NOTES EARLIEST ADMISSION DATE Required Student is proficient START OF CLASSES PROGRAM START/END DATE 06 SEPTEMBER 2023 06 SEPTEMBER 2023 - 29 AUGUST 2026 FINANCIALS ESTIMATED AVERAGE COSTS FOR: 8 MONTHS STUDENT'S FUNDING FOR: 8 MONTHS Tuition and Fees S 28,995 Personal Funds S$ 60,000 Living Expenses $ 29,340 Funds From This School $ Expenses of Dependents (0) i) Funds From Another Source i) Other 5 On-Campus Employment 5 TOTAL 5S 58,335 TOTAL $ 60,000 REMARKS Student is accepted into the MS in Computer Science ALIGN program in Khoury College of Computer Sciences based on 6 semesters program of study. Student's program of study is located at 4 North 2nd Street, San Jose, CA 95113, Northeastern University site in San Jose, CA. SCHOOL ATTESTATION T certify under penalty of perjury that all information provided above was entered before I signed this form and is truc and correct. | executed this form im the United States after review and evaluation in the United States by me or other officials of the school of the student's application, transcripts, or other records of courses taken and proot of financial responsibility, which were received at the school prior to the execution of this form. The school has determined that the above named students qualifications meet all standards for admission to the school and the student will be required to pursue a full program of study as defined by 8 CFR 214.2(f)(6). Iam a designated school offjcial of the above wypned schog] anc te. to issue this form. xX A Ath Ln / CL DATE ISSUED PLACE ISSUED SIGNATURE Faan Taitague, International Student & 08 June 2023 BOSTON, MA Scholar Advisor STUDENT ATTESTATION I have read and agreed to comply with the terms and conditions of my admission and those of any extension of stay. I certify that all information provided on this form refers specifically to me and is true and correct to the best of my knowledge. I certify that I seek to enter or remain in the United States temporarily, and solely for the purpose of pursuing a full program of study at the school named above. I also authorize the named school to",
    "uploaded_at": "2025-05-19T10:14:23.883050",
    "deleted": false
  },
  "102": {
    "source": "i20.pdf",
    "content": "me and is true and correct to the best of my knowledge. I certify that I seek to enter or remain in the United States temporarily, and solely for the purpose of pursuing a full program of study at the school named above. I also authorize the named school to release any information from my records needed by DHS putsuant to 8 CFR 214°3(g) to determine my noniminigrant status. Parent or guardian, and student, must sign if student is under 13. xX SIGNATURE OF; Zhechao Jin DATE 4 NAME OF PARENT OR GUARDIAN SIGNATURE ADDRESS (city/state or province/country) DATE ICE Form I-20 (04/30/2021) Page | of 3",
    "uploaded_at": "2025-05-19T10:14:23.883050",
    "deleted": false
  },
  "104": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security 1-20, Certificate of Eligibility for Nonimmigrant Student Status U.S. Immigration and Customs Enforcement OMB NO. 1653-0038 SEVIS ID: NO024747275 (F-1) NAME: Zhechao Jin EMPLOYMENT AUTHORIZATIONS CHANGE OF STATUS/CAP-GAP EXTENSION AUTHORIZED REDUCED COURSE LOAD CURRENT SESSION DATES CURRENT SESSION START DATE CURRENT SESSION END DATE TRAVEL ENDORSEMENT This page, when properly endorsed, may be used for re-entry of the student to attend the same school after a temporary absence from the United States: Each endorsement is valid for one year. Designated School Official TITLE SIGNATURE DATE ISSUED PLACE ISSUED x x ICE Form I-20 (04/30/2021) Page 2 of 3",
    "uploaded_at": "2025-05-19T10:14:23.883050",
    "deleted": false
  },
  "106": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security U.S. Immigration and Customs Enforcement 1-20, Certificate of Eligibility for Nonimmigrant Student Status OMB NO. 1653-0038 INSTRUCTIONS TO STUDENTS STUDENT ATTESTATION, You should read everything on this page carefully. Be sure that you understand the terms and conditions concerning your admission and stay in the United States as a nonimmigrant student before signing the student aticstation on page | of the Form 1-20 A-B: The law provides severe penalties for knowingly and willfully falsifying or concealing a material fact, or using any false document in the submission of this form, FORM I-20. The Form I-20 (this form) is the primary document to show that you have been adimitied to school in the United States and that you are authorized to apply for admission to the United States in F-1 class of admission. You must have your Form 1-20 with you at all times. If you lose your Form I-20, you must request a new one from your designated school official (DSO) at the school named on your Form I-20, VISA APPLICATION. You must give this Form I-20 to the U.S. consular Officer at the time you apply for a visa (unless you are exempt from visa requirements). If you have a Form 1-20 from more than one school, be sure to present the Form I-20 for the school you plan to attend. Your visa will include the name of that school, and you must attend that school upon entering the United States: You must also provide evidence of support for tuition and fees and living expenses while you are in the United States: ADMISSION. When you enter the United States, you must present the following docuinents to the officer at the port of entry: 1) a Form 1-20; 2) a valid F-1 visa(unless you are exempt from visa requirements); 3) a valid passport; and 4) evidence of support for tuition and fees and living expenses while you are in the United States. The agent should return all documents to you before you leave the inspection area. REPORT TO SCHOOL NAMED ON YOUR FORM I-20 AND VISA. Upon your first entry to the United States, you must report to the DSO at the school named on your Form 1-20 and your P=! visa (unless you are ¢xcempt from visa requirements). If you decide to attend another school before you enter the United States, you must present a Form I-20 from the new school to a U.S” consular officer for a new F-1 visa that names the new school. Failure to enroll in the school, by the program start date on your Form I-20 may result in the loss of your student status and subject you to deportation. EMPLOYMENT. Unlawful employment in the United States is a reason for terminating your F=1 status and deporting you from the United States. You may be employed on campus at your school. You may be employed off-campus in curricular practical training (CPT) if you have written permission from your DSO. You",
    "uploaded_at": "2025-05-19T10:14:23.883050",
    "deleted": false
  },
  "108": {
    "source": "i20.pdf",
    "content": "EMPLOYMENT. Unlawful employment in the United States is a reason for terminating your F=1 status and deporting you from the United States. You may be employed on campus at your school. You may be employed off-campus in curricular practical training (CPT) if you have written permission from your DSO. You may apply to U.S. Citizenship and Immigration Services (USCIS) for off-campus employment authorization in three circumstances: 1) employment with an international organization, 2) severe and unexpected economic hardship; and 3) optional practical training (OPT) related to your degree, You must have written authorization from USCIS before you begin work. Contact your DSO for details. Your spouse or child (F-2 classification) may not work in the United States PERTOD OF STAY. You may remain in the United States while taking a full course of study or during authorized employment after your program. F-1 status ends and you are required to leave the United States on the earliest of the following dates: 1) the program end date on your Form 1-20 plus 60 days; 2) the end date of your OPT plus 60 days; or 3) the termination of your program for any Other reason. Contact your DSO for details: EXTENSION OF PROGRAM, If you cannot complete the education program by the program cnd date on page | of your Form I-20, you should contact your DSO at least 15 days before the program end date to request an extension. SCHOOL TRANSFER: To transicr schools, first notify the DSO at the school you ate attending of your plan to transfer, then obtain a Form I-20 from the DSO at the school you plan to attend. Return the Form 1-20 for the new school to the DSO at that school within 15 days after beginning attendance at the new school. The DSO will then report the transfer to the Department of Homeland Security (DHS). You must enroll in the new school at the next session start date. The DSO at the new school must update your registration in SEVIS: ICE Form I-20 (04/30/2021) NOTICE OF ADDRESS. When you artive in the United States, you must report your U.S: address to your DSO: If you move, you must notify your DSO of your new address within 10 days of the change of address. The DSO will update SEVIS with your new address. REENTRY. F-! students may leave the United States and return within a period of five months. 16 return, you must have: 1) a valid passport, 2) a valid F- 1 student visa (unless you are exempt from visa requirements), and 3) your Form 1-20, page 2, properly endorsed for reentry by your DSO: If you have been out of the United States for more than five months, contact your DSO AUTHORIZATION TO RELEASE INFORMATION BY SCHOOL. DHS requires your school to provide DHS with your name, country of birth, current address, immigration status, and certain other information on a regular basis or Upon request. Your signature on the Form 1-20 authorizes the",
    "uploaded_at": "2025-05-19T10:14:23.883050",
    "deleted": false
  },
  "110": {
    "source": "i20.pdf",
    "content": "for more than five months, contact your DSO AUTHORIZATION TO RELEASE INFORMATION BY SCHOOL. DHS requires your school to provide DHS with your name, country of birth, current address, immigration status, and certain other information on a regular basis or Upon request. Your signature on the Form 1-20 authorizes the namicd school to release such information trom your records. PENALTY. 16 maintain your nonimmigrant student status, you must: 1) remain a full-time student at your authorized school; 2) engage only in authorized employment; and 3) kecp your passport valid. Failure to comply with these regulations will result in the loss of your student status and subject you to deportation. INSTRUCTIONS TO SCHOOLS Failure to comply with 8 CFR 2143(k) and 8 CPR 214.4 when issuing Forms I- 20 will subject you and your school to criminal prosecution. If you issue this form improperly, provide false information, or fail to submit required reports, DHS may withdraw its certification of your school for attendance by nonimmigrant students. ISSUANCE OF FORM I-20. DSOs may issue a Form I-20 for any nonimmigrant your school has accepted for a full course of study if that person: 1) plans to apply to enter the United States in F-1 status; 2) is in the United States as an F=1 nonimmigrant and plans to transfer to your school; or 3) is in the United States and will apply to change nonimmigrant status to F-1. DSOs may also issue the Form I-20 to the spouse or child (under the age Of 21) of an F-1 student to use to enter or remain in the United States as an F-2 dependent. DSOs must sign where indicated at the bottom of page | of the Form 1-20 to attest that the form is completed and issued in accordance with regulations. ENDORSEMENT OF PAGE 2 FOR REENTRY. If there have been no substantive changes in information, DSOs may endorse page 2 of the Form 20 for the student and/or the F-2 dependents to reenter the United States. If there have been substantive changes, the DSO should issue and sign a new Form I-20 that mceludes those changes. RECORDKEEPING. DHS may request information concerning the student's immigration status for various reasons. DSOs should retain all evidence of academic ability and financial resources on which admission was based, until SEVIS shows the student's record completed or terminated: AUTHORITY FOR COLLECTING INFORMATION. Authority for collecting the information on this and related student forms is contained in 8 U.S.C. 1101 and 1184. The Department of State and DHS use this information to determine eligibility for the benctits requested: The law provides severe penalties for knowingly and willfully falsifying or concealing a material fact, or using any false document in the submission of this form. REPORTING BURDEN. U.S. Immigration and Customs Enforcement collects this information as part of its agency mission under the Department of Homeland Security. The estimated average tune to review the instructions, search existing data sources, gather and maintain the needed data, and complete",
    "uploaded_at": "2025-05-19T10:14:23.883050",
    "deleted": false
  },
  "112": {
    "source": "i20.pdf",
    "content": "false document in the submission of this form. REPORTING BURDEN. U.S. Immigration and Customs Enforcement collects this information as part of its agency mission under the Department of Homeland Security. The estimated average tune to review the instructions, search existing data sources, gather and maintain the needed data, and complete and review the collection of information is 30 minutes (50 hours) per response. An agency may not conduct or sponsor, and a person 1s not required to respond to an information collection unless a form displays a currently valid OMB Control number. Send comments regarding this burden estimate or any other aspect of this collection of information, including suggestions for reducing this burden, to: Office of the Chiet Information Officer/Forms Management Branch, U-S. Immigration and Customs Enforcement: 801 I Sircei NW Stop 5800, Washington, DC 20536- 5800. Do not send the form to this address. Page 3 of 3",
    "uploaded_at": "2025-05-19T10:14:23.883050",
    "deleted": false
  },
  "107": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security 1-20, Certificate of Eligibility for Nonimmigrant Student Status U.S. Immigration and Customs Enforcement OMB NO. 1653-0038 SEVIS ID: NO0024747275 SURNAME/PRIMARY NAME GIVEN NAME Class of Admission Jin Zhechao PREFERRED NAME PASSPORT NAME Zhechao Jin COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP —_ CHINA CHINA CITY OF BIRTH DATE OF BIRTH Shanghai 22 JANUARY 1997 ACADEMIC AND FORM ISSUE REASON ADMISSION NUMBER LANGUAGE Transfer Pending - University of Pennsylvania SCHOOL INFORMATION SCHOOL NAME SCHOOL ADDRESS Northeastern University 360 HUNTINGTON AVE, C/O Office of Global Services, Northeastern University-Silicon Valley BOSTON, MA 02115 SCHOOL OFFICIAL TO CONTACT UPON ARRIVAL SCHOOL CODE AND APPROVAL DATE Juan Taitague BOS214F00257003 International Student & Scholar Advisor 22 JANUARY 2003 PROGRAM OF STUDY EDUCATION LEVEL MAJOR 1 MAJOR 2 MASTER'S Computer and Information Sciences, None 00.0000 General 11.0101 PROGRAM ENGLISH PROFICIENCY ENGLISH PROFICIENCY NOTES EARLIEST ADMISSION DATE Required Student is proficient START OF CLASSES PROGRAM START/END DATE 06 SEPTEMBER 2023 06 SEPTEMBER 2023 - 29 AUGUST 2026 FINANCIALS ESTIMATED AVERAGE COSTS FOR: 8 MONTHS STUDENT'S FUNDING FOR: 8 MONTHS Tuition and Fees S 28,995 Personal Funds S$ 60,000 Living Expenses $ 29,340 Funds From This School $ Expenses of Dependents (0) i) Funds From Another Source i) Other 5 On-Campus Employment 5 TOTAL 5S 58,335 TOTAL $ 60,000 REMARKS Student is accepted into the MS in Computer Science ALIGN program in Khoury College of Computer Sciences based on 6 semesters program of study. Student's program of study is located at 4 North 2nd Street, San Jose, CA 95113, Northeastern University site in San Jose, CA. SCHOOL ATTESTATION T certify under penalty of perjury that all information provided above was entered before I signed this form and is truc and correct. | executed this form im the United States after review and evaluation in the United States by me or other officials of the school of the student's application, transcripts, or other records of courses taken and proot of financial responsibility, which were received at the school prior to the execution of this form. The school has determined that the above named students qualifications meet all standards for admission to the school and the student will be required to pursue a full program of study as defined by 8 CFR 214.2(f)(6). Iam a designated school offjcial of the above wypned schog] anc te. to issue this form. xX A Ath Ln / CL DATE ISSUED PLACE ISSUED SIGNATURE Faan Taitague, International Student & 08 June 2023 BOSTON, MA Scholar Advisor STUDENT ATTESTATION I have read and agreed to comply with the terms and conditions of my admission and those of any extension of stay. I certify that all information provided on this form refers specifically to me and is true and correct to the best of my knowledge. I certify that I seek to enter or remain in the United States temporarily, and solely for the purpose of pursuing a full program of study at the school named above. I also authorize the named school to",
    "uploaded_at": "2025-05-19T10:15:59.151115",
    "deleted": false
  },
  "109": {
    "source": "i20.pdf",
    "content": "me and is true and correct to the best of my knowledge. I certify that I seek to enter or remain in the United States temporarily, and solely for the purpose of pursuing a full program of study at the school named above. I also authorize the named school to release any information from my records needed by DHS putsuant to 8 CFR 214°3(g) to determine my noniminigrant status. Parent or guardian, and student, must sign if student is under 13. xX SIGNATURE OF; Zhechao Jin DATE 4 NAME OF PARENT OR GUARDIAN SIGNATURE ADDRESS (city/state or province/country) DATE ICE Form I-20 (04/30/2021) Page | of 3",
    "uploaded_at": "2025-05-19T10:15:59.151115",
    "deleted": false
  },
  "111": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security 1-20, Certificate of Eligibility for Nonimmigrant Student Status U.S. Immigration and Customs Enforcement OMB NO. 1653-0038 SEVIS ID: NO024747275 (F-1) NAME: Zhechao Jin EMPLOYMENT AUTHORIZATIONS CHANGE OF STATUS/CAP-GAP EXTENSION AUTHORIZED REDUCED COURSE LOAD CURRENT SESSION DATES CURRENT SESSION START DATE CURRENT SESSION END DATE TRAVEL ENDORSEMENT This page, when properly endorsed, may be used for re-entry of the student to attend the same school after a temporary absence from the United States: Each endorsement is valid for one year. Designated School Official TITLE SIGNATURE DATE ISSUED PLACE ISSUED x x ICE Form I-20 (04/30/2021) Page 2 of 3",
    "uploaded_at": "2025-05-19T10:15:59.151115",
    "deleted": false
  },
  "113": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security U.S. Immigration and Customs Enforcement 1-20, Certificate of Eligibility for Nonimmigrant Student Status OMB NO. 1653-0038 INSTRUCTIONS TO STUDENTS STUDENT ATTESTATION, You should read everything on this page carefully. Be sure that you understand the terms and conditions concerning your admission and stay in the United States as a nonimmigrant student before signing the student aticstation on page | of the Form 1-20 A-B: The law provides severe penalties for knowingly and willfully falsifying or concealing a material fact, or using any false document in the submission of this form, FORM I-20. The Form I-20 (this form) is the primary document to show that you have been adimitied to school in the United States and that you are authorized to apply for admission to the United States in F-1 class of admission. You must have your Form 1-20 with you at all times. If you lose your Form I-20, you must request a new one from your designated school official (DSO) at the school named on your Form I-20, VISA APPLICATION. You must give this Form I-20 to the U.S. consular Officer at the time you apply for a visa (unless you are exempt from visa requirements). If you have a Form 1-20 from more than one school, be sure to present the Form I-20 for the school you plan to attend. Your visa will include the name of that school, and you must attend that school upon entering the United States: You must also provide evidence of support for tuition and fees and living expenses while you are in the United States: ADMISSION. When you enter the United States, you must present the following docuinents to the officer at the port of entry: 1) a Form 1-20; 2) a valid F-1 visa(unless you are exempt from visa requirements); 3) a valid passport; and 4) evidence of support for tuition and fees and living expenses while you are in the United States. The agent should return all documents to you before you leave the inspection area. REPORT TO SCHOOL NAMED ON YOUR FORM I-20 AND VISA. Upon your first entry to the United States, you must report to the DSO at the school named on your Form 1-20 and your P=! visa (unless you are ¢xcempt from visa requirements). If you decide to attend another school before you enter the United States, you must present a Form I-20 from the new school to a U.S” consular officer for a new F-1 visa that names the new school. Failure to enroll in the school, by the program start date on your Form I-20 may result in the loss of your student status and subject you to deportation. EMPLOYMENT. Unlawful employment in the United States is a reason for terminating your F=1 status and deporting you from the United States. You may be employed on campus at your school. You may be employed off-campus in curricular practical training (CPT) if you have written permission from your DSO. You",
    "uploaded_at": "2025-05-19T10:15:59.151115",
    "deleted": false
  },
  "115": {
    "source": "i20.pdf",
    "content": "EMPLOYMENT. Unlawful employment in the United States is a reason for terminating your F=1 status and deporting you from the United States. You may be employed on campus at your school. You may be employed off-campus in curricular practical training (CPT) if you have written permission from your DSO. You may apply to U.S. Citizenship and Immigration Services (USCIS) for off-campus employment authorization in three circumstances: 1) employment with an international organization, 2) severe and unexpected economic hardship; and 3) optional practical training (OPT) related to your degree, You must have written authorization from USCIS before you begin work. Contact your DSO for details. Your spouse or child (F-2 classification) may not work in the United States PERTOD OF STAY. You may remain in the United States while taking a full course of study or during authorized employment after your program. F-1 status ends and you are required to leave the United States on the earliest of the following dates: 1) the program end date on your Form 1-20 plus 60 days; 2) the end date of your OPT plus 60 days; or 3) the termination of your program for any Other reason. Contact your DSO for details: EXTENSION OF PROGRAM, If you cannot complete the education program by the program cnd date on page | of your Form I-20, you should contact your DSO at least 15 days before the program end date to request an extension. SCHOOL TRANSFER: To transicr schools, first notify the DSO at the school you ate attending of your plan to transfer, then obtain a Form I-20 from the DSO at the school you plan to attend. Return the Form 1-20 for the new school to the DSO at that school within 15 days after beginning attendance at the new school. The DSO will then report the transfer to the Department of Homeland Security (DHS). You must enroll in the new school at the next session start date. The DSO at the new school must update your registration in SEVIS: ICE Form I-20 (04/30/2021) NOTICE OF ADDRESS. When you artive in the United States, you must report your U.S: address to your DSO: If you move, you must notify your DSO of your new address within 10 days of the change of address. The DSO will update SEVIS with your new address. REENTRY. F-! students may leave the United States and return within a period of five months. 16 return, you must have: 1) a valid passport, 2) a valid F- 1 student visa (unless you are exempt from visa requirements), and 3) your Form 1-20, page 2, properly endorsed for reentry by your DSO: If you have been out of the United States for more than five months, contact your DSO AUTHORIZATION TO RELEASE INFORMATION BY SCHOOL. DHS requires your school to provide DHS with your name, country of birth, current address, immigration status, and certain other information on a regular basis or Upon request. Your signature on the Form 1-20 authorizes the",
    "uploaded_at": "2025-05-19T10:15:59.151115",
    "deleted": false
  },
  "117": {
    "source": "i20.pdf",
    "content": "for more than five months, contact your DSO AUTHORIZATION TO RELEASE INFORMATION BY SCHOOL. DHS requires your school to provide DHS with your name, country of birth, current address, immigration status, and certain other information on a regular basis or Upon request. Your signature on the Form 1-20 authorizes the namicd school to release such information trom your records. PENALTY. 16 maintain your nonimmigrant student status, you must: 1) remain a full-time student at your authorized school; 2) engage only in authorized employment; and 3) kecp your passport valid. Failure to comply with these regulations will result in the loss of your student status and subject you to deportation. INSTRUCTIONS TO SCHOOLS Failure to comply with 8 CFR 2143(k) and 8 CPR 214.4 when issuing Forms I- 20 will subject you and your school to criminal prosecution. If you issue this form improperly, provide false information, or fail to submit required reports, DHS may withdraw its certification of your school for attendance by nonimmigrant students. ISSUANCE OF FORM I-20. DSOs may issue a Form I-20 for any nonimmigrant your school has accepted for a full course of study if that person: 1) plans to apply to enter the United States in F-1 status; 2) is in the United States as an F=1 nonimmigrant and plans to transfer to your school; or 3) is in the United States and will apply to change nonimmigrant status to F-1. DSOs may also issue the Form I-20 to the spouse or child (under the age Of 21) of an F-1 student to use to enter or remain in the United States as an F-2 dependent. DSOs must sign where indicated at the bottom of page | of the Form 1-20 to attest that the form is completed and issued in accordance with regulations. ENDORSEMENT OF PAGE 2 FOR REENTRY. If there have been no substantive changes in information, DSOs may endorse page 2 of the Form 20 for the student and/or the F-2 dependents to reenter the United States. If there have been substantive changes, the DSO should issue and sign a new Form I-20 that mceludes those changes. RECORDKEEPING. DHS may request information concerning the student's immigration status for various reasons. DSOs should retain all evidence of academic ability and financial resources on which admission was based, until SEVIS shows the student's record completed or terminated: AUTHORITY FOR COLLECTING INFORMATION. Authority for collecting the information on this and related student forms is contained in 8 U.S.C. 1101 and 1184. The Department of State and DHS use this information to determine eligibility for the benctits requested: The law provides severe penalties for knowingly and willfully falsifying or concealing a material fact, or using any false document in the submission of this form. REPORTING BURDEN. U.S. Immigration and Customs Enforcement collects this information as part of its agency mission under the Department of Homeland Security. The estimated average tune to review the instructions, search existing data sources, gather and maintain the needed data, and complete",
    "uploaded_at": "2025-05-19T10:15:59.151115",
    "deleted": false
  },
  "119": {
    "source": "i20.pdf",
    "content": "false document in the submission of this form. REPORTING BURDEN. U.S. Immigration and Customs Enforcement collects this information as part of its agency mission under the Department of Homeland Security. The estimated average tune to review the instructions, search existing data sources, gather and maintain the needed data, and complete and review the collection of information is 30 minutes (50 hours) per response. An agency may not conduct or sponsor, and a person 1s not required to respond to an information collection unless a form displays a currently valid OMB Control number. Send comments regarding this burden estimate or any other aspect of this collection of information, including suggestions for reducing this burden, to: Office of the Chiet Information Officer/Forms Management Branch, U-S. Immigration and Customs Enforcement: 801 I Sircei NW Stop 5800, Washington, DC 20536- 5800. Do not send the form to this address. Page 3 of 3",
    "uploaded_at": "2025-05-19T10:15:59.151115",
    "deleted": false
  },
  "114": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security 1-20, Certificate of Eligibility for Nonimmigrant Student Status U.S. Immigration and Customs Enforcement OMB NO. 1653-0038 SEVIS ID: NO0024747275 SURNAME/PRIMARY NAME GIVEN NAME Class of Admission Jin Zhechao PREFERRED NAME PASSPORT NAME Zhechao Jin COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP —_ CHINA CHINA CITY OF BIRTH DATE OF BIRTH Shanghai 22 JANUARY 1997 ACADEMIC AND FORM ISSUE REASON ADMISSION NUMBER LANGUAGE Transfer Pending - University of Pennsylvania SCHOOL INFORMATION SCHOOL NAME SCHOOL ADDRESS Northeastern University 360 HUNTINGTON AVE, C/O Office of Global Services, Northeastern University-Silicon Valley BOSTON, MA 02115 SCHOOL OFFICIAL TO CONTACT UPON ARRIVAL SCHOOL CODE AND APPROVAL DATE Juan Taitague BOS214F00257003 International Student & Scholar Advisor 22 JANUARY 2003 PROGRAM OF STUDY EDUCATION LEVEL MAJOR 1 MAJOR 2 MASTER'S Computer and Information Sciences, None 00.0000 General 11.0101 PROGRAM ENGLISH PROFICIENCY ENGLISH PROFICIENCY NOTES EARLIEST ADMISSION DATE Required Student is proficient START OF CLASSES PROGRAM START/END DATE 06 SEPTEMBER 2023 06 SEPTEMBER 2023 - 29 AUGUST 2026 FINANCIALS ESTIMATED AVERAGE COSTS FOR: 8 MONTHS STUDENT'S FUNDING FOR: 8 MONTHS Tuition and Fees S 28,995 Personal Funds S$ 60,000 Living Expenses $ 29,340 Funds From This School $ Expenses of Dependents (0) i) Funds From Another Source i) Other 5 On-Campus Employment 5 TOTAL 5S 58,335 TOTAL $ 60,000 REMARKS Student is accepted into the MS in Computer Science ALIGN program in Khoury College of Computer Sciences based on 6 semesters program of study. Student's program of study is located at 4 North 2nd Street, San Jose, CA 95113, Northeastern University site in San Jose, CA. SCHOOL ATTESTATION T certify under penalty of perjury that all information provided above was entered before I signed this form and is truc and correct. | executed this form im the United States after review and evaluation in the United States by me or other officials of the school of the student's application, transcripts, or other records of courses taken and proot of financial responsibility, which were received at the school prior to the execution of this form. The school has determined that the above named students qualifications meet all standards for admission to the school and the student will be required to pursue a full program of study as defined by 8 CFR 214.2(f)(6). Iam a designated school offjcial of the above wypned schog] anc te. to issue this form. xX A Ath Ln / CL DATE ISSUED PLACE ISSUED SIGNATURE Faan Taitague, International Student & 08 June 2023 BOSTON, MA Scholar Advisor STUDENT ATTESTATION I have read and agreed to comply with the terms and conditions of my admission and those of any extension of stay. I certify that all information provided on this form refers specifically to me and is true and correct to the best of my knowledge. I certify that I seek to enter or remain in the United States temporarily, and solely for the purpose of pursuing a full program of study at the school named above. I also authorize the named school to",
    "uploaded_at": "2025-05-19T10:19:14.869973",
    "deleted": false
  },
  "116": {
    "source": "i20.pdf",
    "content": "me and is true and correct to the best of my knowledge. I certify that I seek to enter or remain in the United States temporarily, and solely for the purpose of pursuing a full program of study at the school named above. I also authorize the named school to release any information from my records needed by DHS putsuant to 8 CFR 214°3(g) to determine my noniminigrant status. Parent or guardian, and student, must sign if student is under 13. xX SIGNATURE OF; Zhechao Jin DATE 4 NAME OF PARENT OR GUARDIAN SIGNATURE ADDRESS (city/state or province/country) DATE ICE Form I-20 (04/30/2021) Page | of 3",
    "uploaded_at": "2025-05-19T10:19:14.869973",
    "deleted": false
  },
  "118": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security 1-20, Certificate of Eligibility for Nonimmigrant Student Status U.S. Immigration and Customs Enforcement OMB NO. 1653-0038 SEVIS ID: NO024747275 (F-1) NAME: Zhechao Jin EMPLOYMENT AUTHORIZATIONS CHANGE OF STATUS/CAP-GAP EXTENSION AUTHORIZED REDUCED COURSE LOAD CURRENT SESSION DATES CURRENT SESSION START DATE CURRENT SESSION END DATE TRAVEL ENDORSEMENT This page, when properly endorsed, may be used for re-entry of the student to attend the same school after a temporary absence from the United States: Each endorsement is valid for one year. Designated School Official TITLE SIGNATURE DATE ISSUED PLACE ISSUED x x ICE Form I-20 (04/30/2021) Page 2 of 3",
    "uploaded_at": "2025-05-19T10:19:14.869973",
    "deleted": false
  },
  "120": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security U.S. Immigration and Customs Enforcement 1-20, Certificate of Eligibility for Nonimmigrant Student Status OMB NO. 1653-0038 INSTRUCTIONS TO STUDENTS STUDENT ATTESTATION, You should read everything on this page carefully. Be sure that you understand the terms and conditions concerning your admission and stay in the United States as a nonimmigrant student before signing the student aticstation on page | of the Form 1-20 A-B: The law provides severe penalties for knowingly and willfully falsifying or concealing a material fact, or using any false document in the submission of this form, FORM I-20. The Form I-20 (this form) is the primary document to show that you have been adimitied to school in the United States and that you are authorized to apply for admission to the United States in F-1 class of admission. You must have your Form 1-20 with you at all times. If you lose your Form I-20, you must request a new one from your designated school official (DSO) at the school named on your Form I-20, VISA APPLICATION. You must give this Form I-20 to the U.S. consular Officer at the time you apply for a visa (unless you are exempt from visa requirements). If you have a Form 1-20 from more than one school, be sure to present the Form I-20 for the school you plan to attend. Your visa will include the name of that school, and you must attend that school upon entering the United States: You must also provide evidence of support for tuition and fees and living expenses while you are in the United States: ADMISSION. When you enter the United States, you must present the following docuinents to the officer at the port of entry: 1) a Form 1-20; 2) a valid F-1 visa(unless you are exempt from visa requirements); 3) a valid passport; and 4) evidence of support for tuition and fees and living expenses while you are in the United States. The agent should return all documents to you before you leave the inspection area. REPORT TO SCHOOL NAMED ON YOUR FORM I-20 AND VISA. Upon your first entry to the United States, you must report to the DSO at the school named on your Form 1-20 and your P=! visa (unless you are ¢xcempt from visa requirements). If you decide to attend another school before you enter the United States, you must present a Form I-20 from the new school to a U.S” consular officer for a new F-1 visa that names the new school. Failure to enroll in the school, by the program start date on your Form I-20 may result in the loss of your student status and subject you to deportation. EMPLOYMENT. Unlawful employment in the United States is a reason for terminating your F=1 status and deporting you from the United States. You may be employed on campus at your school. You may be employed off-campus in curricular practical training (CPT) if you have written permission from your DSO. You",
    "uploaded_at": "2025-05-19T10:19:14.869973",
    "deleted": false
  },
  "122": {
    "source": "i20.pdf",
    "content": "EMPLOYMENT. Unlawful employment in the United States is a reason for terminating your F=1 status and deporting you from the United States. You may be employed on campus at your school. You may be employed off-campus in curricular practical training (CPT) if you have written permission from your DSO. You may apply to U.S. Citizenship and Immigration Services (USCIS) for off-campus employment authorization in three circumstances: 1) employment with an international organization, 2) severe and unexpected economic hardship; and 3) optional practical training (OPT) related to your degree, You must have written authorization from USCIS before you begin work. Contact your DSO for details. Your spouse or child (F-2 classification) may not work in the United States PERTOD OF STAY. You may remain in the United States while taking a full course of study or during authorized employment after your program. F-1 status ends and you are required to leave the United States on the earliest of the following dates: 1) the program end date on your Form 1-20 plus 60 days; 2) the end date of your OPT plus 60 days; or 3) the termination of your program for any Other reason. Contact your DSO for details: EXTENSION OF PROGRAM, If you cannot complete the education program by the program cnd date on page | of your Form I-20, you should contact your DSO at least 15 days before the program end date to request an extension. SCHOOL TRANSFER: To transicr schools, first notify the DSO at the school you ate attending of your plan to transfer, then obtain a Form I-20 from the DSO at the school you plan to attend. Return the Form 1-20 for the new school to the DSO at that school within 15 days after beginning attendance at the new school. The DSO will then report the transfer to the Department of Homeland Security (DHS). You must enroll in the new school at the next session start date. The DSO at the new school must update your registration in SEVIS: ICE Form I-20 (04/30/2021) NOTICE OF ADDRESS. When you artive in the United States, you must report your U.S: address to your DSO: If you move, you must notify your DSO of your new address within 10 days of the change of address. The DSO will update SEVIS with your new address. REENTRY. F-! students may leave the United States and return within a period of five months. 16 return, you must have: 1) a valid passport, 2) a valid F- 1 student visa (unless you are exempt from visa requirements), and 3) your Form 1-20, page 2, properly endorsed for reentry by your DSO: If you have been out of the United States for more than five months, contact your DSO AUTHORIZATION TO RELEASE INFORMATION BY SCHOOL. DHS requires your school to provide DHS with your name, country of birth, current address, immigration status, and certain other information on a regular basis or Upon request. Your signature on the Form 1-20 authorizes the",
    "uploaded_at": "2025-05-19T10:19:14.869973",
    "deleted": false
  },
  "124": {
    "source": "i20.pdf",
    "content": "for more than five months, contact your DSO AUTHORIZATION TO RELEASE INFORMATION BY SCHOOL. DHS requires your school to provide DHS with your name, country of birth, current address, immigration status, and certain other information on a regular basis or Upon request. Your signature on the Form 1-20 authorizes the namicd school to release such information trom your records. PENALTY. 16 maintain your nonimmigrant student status, you must: 1) remain a full-time student at your authorized school; 2) engage only in authorized employment; and 3) kecp your passport valid. Failure to comply with these regulations will result in the loss of your student status and subject you to deportation. INSTRUCTIONS TO SCHOOLS Failure to comply with 8 CFR 2143(k) and 8 CPR 214.4 when issuing Forms I- 20 will subject you and your school to criminal prosecution. If you issue this form improperly, provide false information, or fail to submit required reports, DHS may withdraw its certification of your school for attendance by nonimmigrant students. ISSUANCE OF FORM I-20. DSOs may issue a Form I-20 for any nonimmigrant your school has accepted for a full course of study if that person: 1) plans to apply to enter the United States in F-1 status; 2) is in the United States as an F=1 nonimmigrant and plans to transfer to your school; or 3) is in the United States and will apply to change nonimmigrant status to F-1. DSOs may also issue the Form I-20 to the spouse or child (under the age Of 21) of an F-1 student to use to enter or remain in the United States as an F-2 dependent. DSOs must sign where indicated at the bottom of page | of the Form 1-20 to attest that the form is completed and issued in accordance with regulations. ENDORSEMENT OF PAGE 2 FOR REENTRY. If there have been no substantive changes in information, DSOs may endorse page 2 of the Form 20 for the student and/or the F-2 dependents to reenter the United States. If there have been substantive changes, the DSO should issue and sign a new Form I-20 that mceludes those changes. RECORDKEEPING. DHS may request information concerning the student's immigration status for various reasons. DSOs should retain all evidence of academic ability and financial resources on which admission was based, until SEVIS shows the student's record completed or terminated: AUTHORITY FOR COLLECTING INFORMATION. Authority for collecting the information on this and related student forms is contained in 8 U.S.C. 1101 and 1184. The Department of State and DHS use this information to determine eligibility for the benctits requested: The law provides severe penalties for knowingly and willfully falsifying or concealing a material fact, or using any false document in the submission of this form. REPORTING BURDEN. U.S. Immigration and Customs Enforcement collects this information as part of its agency mission under the Department of Homeland Security. The estimated average tune to review the instructions, search existing data sources, gather and maintain the needed data, and complete",
    "uploaded_at": "2025-05-19T10:19:14.869973",
    "deleted": false
  },
  "126": {
    "source": "i20.pdf",
    "content": "false document in the submission of this form. REPORTING BURDEN. U.S. Immigration and Customs Enforcement collects this information as part of its agency mission under the Department of Homeland Security. The estimated average tune to review the instructions, search existing data sources, gather and maintain the needed data, and complete and review the collection of information is 30 minutes (50 hours) per response. An agency may not conduct or sponsor, and a person 1s not required to respond to an information collection unless a form displays a currently valid OMB Control number. Send comments regarding this burden estimate or any other aspect of this collection of information, including suggestions for reducing this burden, to: Office of the Chiet Information Officer/Forms Management Branch, U-S. Immigration and Customs Enforcement: 801 I Sircei NW Stop 5800, Washington, DC 20536- 5800. Do not send the form to this address. Page 3 of 3",
    "uploaded_at": "2025-05-19T10:19:14.869973",
    "deleted": false
  },
  "121": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security 1-20, Certificate of Eligibility for Nonimmigrant Student Status U.S. Immigration and Customs Enforcement OMB NO. 1653-0038 SEVIS ID: NO0024747275 SURNAME/PRIMARY NAME GIVEN NAME Class of Admission Jin Zhechao PREFERRED NAME PASSPORT NAME Zhechao Jin COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP —_ CHINA CHINA CITY OF BIRTH DATE OF BIRTH Shanghai 22 JANUARY 1997 ACADEMIC AND FORM ISSUE REASON ADMISSION NUMBER LANGUAGE Transfer Pending - University of Pennsylvania SCHOOL INFORMATION SCHOOL NAME SCHOOL ADDRESS Northeastern University 360 HUNTINGTON AVE, C/O Office of Global Services, Northeastern University-Silicon Valley BOSTON, MA 02115 SCHOOL OFFICIAL TO CONTACT UPON ARRIVAL SCHOOL CODE AND APPROVAL DATE Juan Taitague BOS214F00257003 International Student & Scholar Advisor 22 JANUARY 2003 PROGRAM OF STUDY EDUCATION LEVEL MAJOR 1 MAJOR 2 MASTER'S Computer and Information Sciences, None 00.0000 General 11.0101 PROGRAM ENGLISH PROFICIENCY ENGLISH PROFICIENCY NOTES EARLIEST ADMISSION DATE Required Student is proficient START OF CLASSES PROGRAM START/END DATE 06 SEPTEMBER 2023 06 SEPTEMBER 2023 - 29 AUGUST 2026 FINANCIALS ESTIMATED AVERAGE COSTS FOR: 8 MONTHS STUDENT'S FUNDING FOR: 8 MONTHS Tuition and Fees S 28,995 Personal Funds S$ 60,000 Living Expenses $ 29,340 Funds From This School $ Expenses of Dependents (0) i) Funds From Another Source i) Other 5 On-Campus Employment 5 TOTAL 5S 58,335 TOTAL $ 60,000 REMARKS Student is accepted into the MS in Computer Science ALIGN program in Khoury College of Computer Sciences based on 6 semesters program of study. Student's program of study is located at 4 North 2nd Street, San Jose, CA 95113, Northeastern University site in San Jose, CA. SCHOOL ATTESTATION T certify under penalty of perjury that all information provided above was entered before I signed this form and is truc and correct. | executed this form im the United States after review and evaluation in the United States by me or other officials of the school of the student's application, transcripts, or other records of courses taken and proot of financial responsibility, which were received at the school prior to the execution of this form. The school has determined that the above named students qualifications meet all standards for admission to the school and the student will be required to pursue a full program of study as defined by 8 CFR 214.2(f)(6). Iam a designated school offjcial of the above wypned schog] anc te. to issue this form. xX A Ath Ln / CL DATE ISSUED PLACE ISSUED SIGNATURE Faan Taitague, International Student & 08 June 2023 BOSTON, MA Scholar Advisor STUDENT ATTESTATION I have read and agreed to comply with the terms and conditions of my admission and those of any extension of stay. I certify that all information provided on this form refers specifically to me and is true and correct to the best of my knowledge. I certify that I seek to enter or remain in the United States temporarily, and solely for the purpose of pursuing a full program of study at the school named above. I also authorize the named school to",
    "uploaded_at": "2025-05-19T10:21:20.011506",
    "deleted": false
  },
  "123": {
    "source": "i20.pdf",
    "content": "me and is true and correct to the best of my knowledge. I certify that I seek to enter or remain in the United States temporarily, and solely for the purpose of pursuing a full program of study at the school named above. I also authorize the named school to release any information from my records needed by DHS putsuant to 8 CFR 214°3(g) to determine my noniminigrant status. Parent or guardian, and student, must sign if student is under 13. xX SIGNATURE OF; Zhechao Jin DATE 4 NAME OF PARENT OR GUARDIAN SIGNATURE ADDRESS (city/state or province/country) DATE ICE Form I-20 (04/30/2021) Page | of 3",
    "uploaded_at": "2025-05-19T10:21:20.011506",
    "deleted": false
  },
  "125": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security 1-20, Certificate of Eligibility for Nonimmigrant Student Status U.S. Immigration and Customs Enforcement OMB NO. 1653-0038 SEVIS ID: NO024747275 (F-1) NAME: Zhechao Jin EMPLOYMENT AUTHORIZATIONS CHANGE OF STATUS/CAP-GAP EXTENSION AUTHORIZED REDUCED COURSE LOAD CURRENT SESSION DATES CURRENT SESSION START DATE CURRENT SESSION END DATE TRAVEL ENDORSEMENT This page, when properly endorsed, may be used for re-entry of the student to attend the same school after a temporary absence from the United States: Each endorsement is valid for one year. Designated School Official TITLE SIGNATURE DATE ISSUED PLACE ISSUED x x ICE Form I-20 (04/30/2021) Page 2 of 3",
    "uploaded_at": "2025-05-19T10:21:20.011506",
    "deleted": false
  },
  "127": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security U.S. Immigration and Customs Enforcement 1-20, Certificate of Eligibility for Nonimmigrant Student Status OMB NO. 1653-0038 INSTRUCTIONS TO STUDENTS STUDENT ATTESTATION, You should read everything on this page carefully. Be sure that you understand the terms and conditions concerning your admission and stay in the United States as a nonimmigrant student before signing the student aticstation on page | of the Form 1-20 A-B: The law provides severe penalties for knowingly and willfully falsifying or concealing a material fact, or using any false document in the submission of this form, FORM I-20. The Form I-20 (this form) is the primary document to show that you have been adimitied to school in the United States and that you are authorized to apply for admission to the United States in F-1 class of admission. You must have your Form 1-20 with you at all times. If you lose your Form I-20, you must request a new one from your designated school official (DSO) at the school named on your Form I-20, VISA APPLICATION. You must give this Form I-20 to the U.S. consular Officer at the time you apply for a visa (unless you are exempt from visa requirements). If you have a Form 1-20 from more than one school, be sure to present the Form I-20 for the school you plan to attend. Your visa will include the name of that school, and you must attend that school upon entering the United States: You must also provide evidence of support for tuition and fees and living expenses while you are in the United States: ADMISSION. When you enter the United States, you must present the following docuinents to the officer at the port of entry: 1) a Form 1-20; 2) a valid F-1 visa(unless you are exempt from visa requirements); 3) a valid passport; and 4) evidence of support for tuition and fees and living expenses while you are in the United States. The agent should return all documents to you before you leave the inspection area. REPORT TO SCHOOL NAMED ON YOUR FORM I-20 AND VISA. Upon your first entry to the United States, you must report to the DSO at the school named on your Form 1-20 and your P=! visa (unless you are ¢xcempt from visa requirements). If you decide to attend another school before you enter the United States, you must present a Form I-20 from the new school to a U.S” consular officer for a new F-1 visa that names the new school. Failure to enroll in the school, by the program start date on your Form I-20 may result in the loss of your student status and subject you to deportation. EMPLOYMENT. Unlawful employment in the United States is a reason for terminating your F=1 status and deporting you from the United States. You may be employed on campus at your school. You may be employed off-campus in curricular practical training (CPT) if you have written permission from your DSO. You",
    "uploaded_at": "2025-05-19T10:21:20.011506",
    "deleted": false
  },
  "129": {
    "source": "i20.pdf",
    "content": "EMPLOYMENT. Unlawful employment in the United States is a reason for terminating your F=1 status and deporting you from the United States. You may be employed on campus at your school. You may be employed off-campus in curricular practical training (CPT) if you have written permission from your DSO. You may apply to U.S. Citizenship and Immigration Services (USCIS) for off-campus employment authorization in three circumstances: 1) employment with an international organization, 2) severe and unexpected economic hardship; and 3) optional practical training (OPT) related to your degree, You must have written authorization from USCIS before you begin work. Contact your DSO for details. Your spouse or child (F-2 classification) may not work in the United States PERTOD OF STAY. You may remain in the United States while taking a full course of study or during authorized employment after your program. F-1 status ends and you are required to leave the United States on the earliest of the following dates: 1) the program end date on your Form 1-20 plus 60 days; 2) the end date of your OPT plus 60 days; or 3) the termination of your program for any Other reason. Contact your DSO for details: EXTENSION OF PROGRAM, If you cannot complete the education program by the program cnd date on page | of your Form I-20, you should contact your DSO at least 15 days before the program end date to request an extension. SCHOOL TRANSFER: To transicr schools, first notify the DSO at the school you ate attending of your plan to transfer, then obtain a Form I-20 from the DSO at the school you plan to attend. Return the Form 1-20 for the new school to the DSO at that school within 15 days after beginning attendance at the new school. The DSO will then report the transfer to the Department of Homeland Security (DHS). You must enroll in the new school at the next session start date. The DSO at the new school must update your registration in SEVIS: ICE Form I-20 (04/30/2021) NOTICE OF ADDRESS. When you artive in the United States, you must report your U.S: address to your DSO: If you move, you must notify your DSO of your new address within 10 days of the change of address. The DSO will update SEVIS with your new address. REENTRY. F-! students may leave the United States and return within a period of five months. 16 return, you must have: 1) a valid passport, 2) a valid F- 1 student visa (unless you are exempt from visa requirements), and 3) your Form 1-20, page 2, properly endorsed for reentry by your DSO: If you have been out of the United States for more than five months, contact your DSO AUTHORIZATION TO RELEASE INFORMATION BY SCHOOL. DHS requires your school to provide DHS with your name, country of birth, current address, immigration status, and certain other information on a regular basis or Upon request. Your signature on the Form 1-20 authorizes the",
    "uploaded_at": "2025-05-19T10:21:20.011506",
    "deleted": false
  },
  "131": {
    "source": "i20.pdf",
    "content": "for more than five months, contact your DSO AUTHORIZATION TO RELEASE INFORMATION BY SCHOOL. DHS requires your school to provide DHS with your name, country of birth, current address, immigration status, and certain other information on a regular basis or Upon request. Your signature on the Form 1-20 authorizes the namicd school to release such information trom your records. PENALTY. 16 maintain your nonimmigrant student status, you must: 1) remain a full-time student at your authorized school; 2) engage only in authorized employment; and 3) kecp your passport valid. Failure to comply with these regulations will result in the loss of your student status and subject you to deportation. INSTRUCTIONS TO SCHOOLS Failure to comply with 8 CFR 2143(k) and 8 CPR 214.4 when issuing Forms I- 20 will subject you and your school to criminal prosecution. If you issue this form improperly, provide false information, or fail to submit required reports, DHS may withdraw its certification of your school for attendance by nonimmigrant students. ISSUANCE OF FORM I-20. DSOs may issue a Form I-20 for any nonimmigrant your school has accepted for a full course of study if that person: 1) plans to apply to enter the United States in F-1 status; 2) is in the United States as an F=1 nonimmigrant and plans to transfer to your school; or 3) is in the United States and will apply to change nonimmigrant status to F-1. DSOs may also issue the Form I-20 to the spouse or child (under the age Of 21) of an F-1 student to use to enter or remain in the United States as an F-2 dependent. DSOs must sign where indicated at the bottom of page | of the Form 1-20 to attest that the form is completed and issued in accordance with regulations. ENDORSEMENT OF PAGE 2 FOR REENTRY. If there have been no substantive changes in information, DSOs may endorse page 2 of the Form 20 for the student and/or the F-2 dependents to reenter the United States. If there have been substantive changes, the DSO should issue and sign a new Form I-20 that mceludes those changes. RECORDKEEPING. DHS may request information concerning the student's immigration status for various reasons. DSOs should retain all evidence of academic ability and financial resources on which admission was based, until SEVIS shows the student's record completed or terminated: AUTHORITY FOR COLLECTING INFORMATION. Authority for collecting the information on this and related student forms is contained in 8 U.S.C. 1101 and 1184. The Department of State and DHS use this information to determine eligibility for the benctits requested: The law provides severe penalties for knowingly and willfully falsifying or concealing a material fact, or using any false document in the submission of this form. REPORTING BURDEN. U.S. Immigration and Customs Enforcement collects this information as part of its agency mission under the Department of Homeland Security. The estimated average tune to review the instructions, search existing data sources, gather and maintain the needed data, and complete",
    "uploaded_at": "2025-05-19T10:21:20.011506",
    "deleted": false
  },
  "133": {
    "source": "i20.pdf",
    "content": "false document in the submission of this form. REPORTING BURDEN. U.S. Immigration and Customs Enforcement collects this information as part of its agency mission under the Department of Homeland Security. The estimated average tune to review the instructions, search existing data sources, gather and maintain the needed data, and complete and review the collection of information is 30 minutes (50 hours) per response. An agency may not conduct or sponsor, and a person 1s not required to respond to an information collection unless a form displays a currently valid OMB Control number. Send comments regarding this burden estimate or any other aspect of this collection of information, including suggestions for reducing this burden, to: Office of the Chiet Information Officer/Forms Management Branch, U-S. Immigration and Customs Enforcement: 801 I Sircei NW Stop 5800, Washington, DC 20536- 5800. Do not send the form to this address. Page 3 of 3",
    "uploaded_at": "2025-05-19T10:21:20.011506",
    "deleted": false
  },
  "128": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security 1-20, Certificate of Eligibility for Nonimmigrant Student Status U.S. Immigration and Customs Enforcement OMB NO. 1653-0038 SEVIS ID: NO0024747275 SURNAME/PRIMARY NAME GIVEN NAME Class of Admission Jin Zhechao PREFERRED NAME PASSPORT NAME Zhechao Jin COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP —_ CHINA CHINA CITY OF BIRTH DATE OF BIRTH Shanghai 22 JANUARY 1997 ACADEMIC AND FORM ISSUE REASON ADMISSION NUMBER LANGUAGE Transfer Pending - University of Pennsylvania SCHOOL INFORMATION SCHOOL NAME SCHOOL ADDRESS Northeastern University 360 HUNTINGTON AVE, C/O Office of Global Services, Northeastern University-Silicon Valley BOSTON, MA 02115 SCHOOL OFFICIAL TO CONTACT UPON ARRIVAL SCHOOL CODE AND APPROVAL DATE Juan Taitague BOS214F00257003 International Student & Scholar Advisor 22 JANUARY 2003 PROGRAM OF STUDY EDUCATION LEVEL MAJOR 1 MAJOR 2 MASTER'S Computer and Information Sciences, None 00.0000 General 11.0101 PROGRAM ENGLISH PROFICIENCY ENGLISH PROFICIENCY NOTES EARLIEST ADMISSION DATE Required Student is proficient START OF CLASSES PROGRAM START/END DATE 06 SEPTEMBER 2023 06 SEPTEMBER 2023 - 29 AUGUST 2026 FINANCIALS ESTIMATED AVERAGE COSTS FOR: 8 MONTHS STUDENT'S FUNDING FOR: 8 MONTHS Tuition and Fees S 28,995 Personal Funds S$ 60,000 Living Expenses $ 29,340 Funds From This School $ Expenses of Dependents (0) i) Funds From Another Source i) Other 5 On-Campus Employment 5 TOTAL 5S 58,335 TOTAL $ 60,000 REMARKS Student is accepted into the MS in Computer Science ALIGN program in Khoury College of Computer Sciences based on 6 semesters program of study. Student's program of study is located at 4 North 2nd Street, San Jose, CA 95113, Northeastern University site in San Jose, CA. SCHOOL ATTESTATION T certify under penalty of perjury that all information provided above was entered before I signed this form and is truc and correct. | executed this form im the United States after review and evaluation in the United States by me or other officials of the school of the student's application, transcripts, or other records of courses taken and proot of financial responsibility, which were received at the school prior to the execution of this form. The school has determined that the above named students qualifications meet all standards for admission to the school and the student will be required to pursue a full program of study as defined by 8 CFR 214.2(f)(6). Iam a designated school offjcial of the above wypned schog] anc te. to issue this form. xX A Ath Ln / CL DATE ISSUED PLACE ISSUED SIGNATURE Faan Taitague, International Student & 08 June 2023 BOSTON, MA Scholar Advisor STUDENT ATTESTATION I have read and agreed to comply with the terms and conditions of my admission and those of any extension of stay. I certify that all information provided on this form refers specifically to me and is true and correct to the best of my knowledge. I certify that I seek to enter or remain in the United States temporarily, and solely for the purpose of pursuing a full program of study at the school named above. I also authorize the named school to",
    "uploaded_at": "2025-05-19T10:25:11.865935",
    "deleted": false
  },
  "130": {
    "source": "i20.pdf",
    "content": "me and is true and correct to the best of my knowledge. I certify that I seek to enter or remain in the United States temporarily, and solely for the purpose of pursuing a full program of study at the school named above. I also authorize the named school to release any information from my records needed by DHS putsuant to 8 CFR 214°3(g) to determine my noniminigrant status. Parent or guardian, and student, must sign if student is under 13. xX SIGNATURE OF; Zhechao Jin DATE 4 NAME OF PARENT OR GUARDIAN SIGNATURE ADDRESS (city/state or province/country) DATE ICE Form I-20 (04/30/2021) Page | of 3",
    "uploaded_at": "2025-05-19T10:25:11.865935",
    "deleted": false
  },
  "132": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security 1-20, Certificate of Eligibility for Nonimmigrant Student Status U.S. Immigration and Customs Enforcement OMB NO. 1653-0038 SEVIS ID: NO024747275 (F-1) NAME: Zhechao Jin EMPLOYMENT AUTHORIZATIONS CHANGE OF STATUS/CAP-GAP EXTENSION AUTHORIZED REDUCED COURSE LOAD CURRENT SESSION DATES CURRENT SESSION START DATE CURRENT SESSION END DATE TRAVEL ENDORSEMENT This page, when properly endorsed, may be used for re-entry of the student to attend the same school after a temporary absence from the United States: Each endorsement is valid for one year. Designated School Official TITLE SIGNATURE DATE ISSUED PLACE ISSUED x x ICE Form I-20 (04/30/2021) Page 2 of 3",
    "uploaded_at": "2025-05-19T10:25:11.865935",
    "deleted": false
  },
  "134": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security U.S. Immigration and Customs Enforcement 1-20, Certificate of Eligibility for Nonimmigrant Student Status OMB NO. 1653-0038 INSTRUCTIONS TO STUDENTS STUDENT ATTESTATION, You should read everything on this page carefully. Be sure that you understand the terms and conditions concerning your admission and stay in the United States as a nonimmigrant student before signing the student aticstation on page | of the Form 1-20 A-B: The law provides severe penalties for knowingly and willfully falsifying or concealing a material fact, or using any false document in the submission of this form, FORM I-20. The Form I-20 (this form) is the primary document to show that you have been adimitied to school in the United States and that you are authorized to apply for admission to the United States in F-1 class of admission. You must have your Form 1-20 with you at all times. If you lose your Form I-20, you must request a new one from your designated school official (DSO) at the school named on your Form I-20, VISA APPLICATION. You must give this Form I-20 to the U.S. consular Officer at the time you apply for a visa (unless you are exempt from visa requirements). If you have a Form 1-20 from more than one school, be sure to present the Form I-20 for the school you plan to attend. Your visa will include the name of that school, and you must attend that school upon entering the United States: You must also provide evidence of support for tuition and fees and living expenses while you are in the United States: ADMISSION. When you enter the United States, you must present the following docuinents to the officer at the port of entry: 1) a Form 1-20; 2) a valid F-1 visa(unless you are exempt from visa requirements); 3) a valid passport; and 4) evidence of support for tuition and fees and living expenses while you are in the United States. The agent should return all documents to you before you leave the inspection area. REPORT TO SCHOOL NAMED ON YOUR FORM I-20 AND VISA. Upon your first entry to the United States, you must report to the DSO at the school named on your Form 1-20 and your P=! visa (unless you are ¢xcempt from visa requirements). If you decide to attend another school before you enter the United States, you must present a Form I-20 from the new school to a U.S” consular officer for a new F-1 visa that names the new school. Failure to enroll in the school, by the program start date on your Form I-20 may result in the loss of your student status and subject you to deportation. EMPLOYMENT. Unlawful employment in the United States is a reason for terminating your F=1 status and deporting you from the United States. You may be employed on campus at your school. You may be employed off-campus in curricular practical training (CPT) if you have written permission from your DSO. You",
    "uploaded_at": "2025-05-19T10:25:11.865935",
    "deleted": false
  },
  "136": {
    "source": "i20.pdf",
    "content": "EMPLOYMENT. Unlawful employment in the United States is a reason for terminating your F=1 status and deporting you from the United States. You may be employed on campus at your school. You may be employed off-campus in curricular practical training (CPT) if you have written permission from your DSO. You may apply to U.S. Citizenship and Immigration Services (USCIS) for off-campus employment authorization in three circumstances: 1) employment with an international organization, 2) severe and unexpected economic hardship; and 3) optional practical training (OPT) related to your degree, You must have written authorization from USCIS before you begin work. Contact your DSO for details. Your spouse or child (F-2 classification) may not work in the United States PERTOD OF STAY. You may remain in the United States while taking a full course of study or during authorized employment after your program. F-1 status ends and you are required to leave the United States on the earliest of the following dates: 1) the program end date on your Form 1-20 plus 60 days; 2) the end date of your OPT plus 60 days; or 3) the termination of your program for any Other reason. Contact your DSO for details: EXTENSION OF PROGRAM, If you cannot complete the education program by the program cnd date on page | of your Form I-20, you should contact your DSO at least 15 days before the program end date to request an extension. SCHOOL TRANSFER: To transicr schools, first notify the DSO at the school you ate attending of your plan to transfer, then obtain a Form I-20 from the DSO at the school you plan to attend. Return the Form 1-20 for the new school to the DSO at that school within 15 days after beginning attendance at the new school. The DSO will then report the transfer to the Department of Homeland Security (DHS). You must enroll in the new school at the next session start date. The DSO at the new school must update your registration in SEVIS: ICE Form I-20 (04/30/2021) NOTICE OF ADDRESS. When you artive in the United States, you must report your U.S: address to your DSO: If you move, you must notify your DSO of your new address within 10 days of the change of address. The DSO will update SEVIS with your new address. REENTRY. F-! students may leave the United States and return within a period of five months. 16 return, you must have: 1) a valid passport, 2) a valid F- 1 student visa (unless you are exempt from visa requirements), and 3) your Form 1-20, page 2, properly endorsed for reentry by your DSO: If you have been out of the United States for more than five months, contact your DSO AUTHORIZATION TO RELEASE INFORMATION BY SCHOOL. DHS requires your school to provide DHS with your name, country of birth, current address, immigration status, and certain other information on a regular basis or Upon request. Your signature on the Form 1-20 authorizes the",
    "uploaded_at": "2025-05-19T10:25:11.865935",
    "deleted": false
  },
  "138": {
    "source": "i20.pdf",
    "content": "for more than five months, contact your DSO AUTHORIZATION TO RELEASE INFORMATION BY SCHOOL. DHS requires your school to provide DHS with your name, country of birth, current address, immigration status, and certain other information on a regular basis or Upon request. Your signature on the Form 1-20 authorizes the namicd school to release such information trom your records. PENALTY. 16 maintain your nonimmigrant student status, you must: 1) remain a full-time student at your authorized school; 2) engage only in authorized employment; and 3) kecp your passport valid. Failure to comply with these regulations will result in the loss of your student status and subject you to deportation. INSTRUCTIONS TO SCHOOLS Failure to comply with 8 CFR 2143(k) and 8 CPR 214.4 when issuing Forms I- 20 will subject you and your school to criminal prosecution. If you issue this form improperly, provide false information, or fail to submit required reports, DHS may withdraw its certification of your school for attendance by nonimmigrant students. ISSUANCE OF FORM I-20. DSOs may issue a Form I-20 for any nonimmigrant your school has accepted for a full course of study if that person: 1) plans to apply to enter the United States in F-1 status; 2) is in the United States as an F=1 nonimmigrant and plans to transfer to your school; or 3) is in the United States and will apply to change nonimmigrant status to F-1. DSOs may also issue the Form I-20 to the spouse or child (under the age Of 21) of an F-1 student to use to enter or remain in the United States as an F-2 dependent. DSOs must sign where indicated at the bottom of page | of the Form 1-20 to attest that the form is completed and issued in accordance with regulations. ENDORSEMENT OF PAGE 2 FOR REENTRY. If there have been no substantive changes in information, DSOs may endorse page 2 of the Form 20 for the student and/or the F-2 dependents to reenter the United States. If there have been substantive changes, the DSO should issue and sign a new Form I-20 that mceludes those changes. RECORDKEEPING. DHS may request information concerning the student's immigration status for various reasons. DSOs should retain all evidence of academic ability and financial resources on which admission was based, until SEVIS shows the student's record completed or terminated: AUTHORITY FOR COLLECTING INFORMATION. Authority for collecting the information on this and related student forms is contained in 8 U.S.C. 1101 and 1184. The Department of State and DHS use this information to determine eligibility for the benctits requested: The law provides severe penalties for knowingly and willfully falsifying or concealing a material fact, or using any false document in the submission of this form. REPORTING BURDEN. U.S. Immigration and Customs Enforcement collects this information as part of its agency mission under the Department of Homeland Security. The estimated average tune to review the instructions, search existing data sources, gather and maintain the needed data, and complete",
    "uploaded_at": "2025-05-19T10:25:11.865935",
    "deleted": false
  },
  "140": {
    "source": "i20.pdf",
    "content": "false document in the submission of this form. REPORTING BURDEN. U.S. Immigration and Customs Enforcement collects this information as part of its agency mission under the Department of Homeland Security. The estimated average tune to review the instructions, search existing data sources, gather and maintain the needed data, and complete and review the collection of information is 30 minutes (50 hours) per response. An agency may not conduct or sponsor, and a person 1s not required to respond to an information collection unless a form displays a currently valid OMB Control number. Send comments regarding this burden estimate or any other aspect of this collection of information, including suggestions for reducing this burden, to: Office of the Chiet Information Officer/Forms Management Branch, U-S. Immigration and Customs Enforcement: 801 I Sircei NW Stop 5800, Washington, DC 20536- 5800. Do not send the form to this address. Page 3 of 3",
    "uploaded_at": "2025-05-19T10:25:11.865935",
    "deleted": false
  },
  "135": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security 1-20, Certificate of Eligibility for Nonimmigrant Student Status U.S. Immigration and Customs Enforcement OMB NO. 1653-0038 SEVIS ID: NO0024747275 SURNAME/PRIMARY NAME GIVEN NAME Class of Admission Jin Zhechao PREFERRED NAME PASSPORT NAME Zhechao Jin COUNTRY OF BIRTH COUNTRY OF CITIZENSHIP —_ CHINA CHINA CITY OF BIRTH DATE OF BIRTH Shanghai 22 JANUARY 1997 ACADEMIC AND FORM ISSUE REASON ADMISSION NUMBER LANGUAGE Transfer Pending - University of Pennsylvania SCHOOL INFORMATION SCHOOL NAME SCHOOL ADDRESS Northeastern University 360 HUNTINGTON AVE, C/O Office of Global Services, Northeastern University-Silicon Valley BOSTON, MA 02115 SCHOOL OFFICIAL TO CONTACT UPON ARRIVAL SCHOOL CODE AND APPROVAL DATE Juan Taitague BOS214F00257003 International Student & Scholar Advisor 22 JANUARY 2003 PROGRAM OF STUDY EDUCATION LEVEL MAJOR 1 MAJOR 2 MASTER'S Computer and Information Sciences, None 00.0000 General 11.0101 PROGRAM ENGLISH PROFICIENCY ENGLISH PROFICIENCY NOTES EARLIEST ADMISSION DATE Required Student is proficient START OF CLASSES PROGRAM START/END DATE 06 SEPTEMBER 2023 06 SEPTEMBER 2023 - 29 AUGUST 2026 FINANCIALS ESTIMATED AVERAGE COSTS FOR: 8 MONTHS STUDENT'S FUNDING FOR: 8 MONTHS Tuition and Fees S 28,995 Personal Funds S$ 60,000 Living Expenses $ 29,340 Funds From This School $ Expenses of Dependents (0) i) Funds From Another Source i) Other 5 On-Campus Employment 5 TOTAL 5S 58,335 TOTAL $ 60,000 REMARKS Student is accepted into the MS in Computer Science ALIGN program in Khoury College of Computer Sciences based on 6 semesters program of study. Student's program of study is located at 4 North 2nd Street, San Jose, CA 95113, Northeastern University site in San Jose, CA. SCHOOL ATTESTATION T certify under penalty of perjury that all information provided above was entered before I signed this form and is truc and correct. | executed this form im the United States after review and evaluation in the United States by me or other officials of the school of the student's application, transcripts, or other records of courses taken and proot of financial responsibility, which were received at the school prior to the execution of this form. The school has determined that the above named students qualifications meet all standards for admission to the school and the student will be required to pursue a full program of study as defined by 8 CFR 214.2(f)(6). Iam a designated school offjcial of the above wypned schog] anc te. to issue this form. xX A Ath Ln / CL DATE ISSUED PLACE ISSUED SIGNATURE Faan Taitague, International Student & 08 June 2023 BOSTON, MA Scholar Advisor STUDENT ATTESTATION I have read and agreed to comply with the terms and conditions of my admission and those of any extension of stay. I certify that all information provided on this form refers specifically to me and is true and correct to the best of my knowledge. I certify that I seek to enter or remain in the United States temporarily, and solely for the purpose of pursuing a full program of study at the school named above. I also authorize the named school to",
    "uploaded_at": "2025-05-19T10:30:26.039250",
    "deleted": false
  },
  "137": {
    "source": "i20.pdf",
    "content": "me and is true and correct to the best of my knowledge. I certify that I seek to enter or remain in the United States temporarily, and solely for the purpose of pursuing a full program of study at the school named above. I also authorize the named school to release any information from my records needed by DHS putsuant to 8 CFR 214°3(g) to determine my noniminigrant status. Parent or guardian, and student, must sign if student is under 13. xX SIGNATURE OF; Zhechao Jin DATE 4 NAME OF PARENT OR GUARDIAN SIGNATURE ADDRESS (city/state or province/country) DATE ICE Form I-20 (04/30/2021) Page | of 3",
    "uploaded_at": "2025-05-19T10:30:26.039250",
    "deleted": false
  },
  "139": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security 1-20, Certificate of Eligibility for Nonimmigrant Student Status U.S. Immigration and Customs Enforcement OMB NO. 1653-0038 SEVIS ID: NO024747275 (F-1) NAME: Zhechao Jin EMPLOYMENT AUTHORIZATIONS CHANGE OF STATUS/CAP-GAP EXTENSION AUTHORIZED REDUCED COURSE LOAD CURRENT SESSION DATES CURRENT SESSION START DATE CURRENT SESSION END DATE TRAVEL ENDORSEMENT This page, when properly endorsed, may be used for re-entry of the student to attend the same school after a temporary absence from the United States: Each endorsement is valid for one year. Designated School Official TITLE SIGNATURE DATE ISSUED PLACE ISSUED x x ICE Form I-20 (04/30/2021) Page 2 of 3",
    "uploaded_at": "2025-05-19T10:30:26.039250",
    "deleted": false
  },
  "141": {
    "source": "i20.pdf",
    "content": "Department of Homeland Security U.S. Immigration and Customs Enforcement 1-20, Certificate of Eligibility for Nonimmigrant Student Status OMB NO. 1653-0038 INSTRUCTIONS TO STUDENTS STUDENT ATTESTATION, You should read everything on this page carefully. Be sure that you understand the terms and conditions concerning your admission and stay in the United States as a nonimmigrant student before signing the student aticstation on page | of the Form 1-20 A-B: The law provides severe penalties for knowingly and willfully falsifying or concealing a material fact, or using any false document in the submission of this form, FORM I-20. The Form I-20 (this form) is the primary document to show that you have been adimitied to school in the United States and that you are authorized to apply for admission to the United States in F-1 class of admission. You must have your Form 1-20 with you at all times. If you lose your Form I-20, you must request a new one from your designated school official (DSO) at the school named on your Form I-20, VISA APPLICATION. You must give this Form I-20 to the U.S. consular Officer at the time you apply for a visa (unless you are exempt from visa requirements). If you have a Form 1-20 from more than one school, be sure to present the Form I-20 for the school you plan to attend. Your visa will include the name of that school, and you must attend that school upon entering the United States: You must also provide evidence of support for tuition and fees and living expenses while you are in the United States: ADMISSION. When you enter the United States, you must present the following docuinents to the officer at the port of entry: 1) a Form 1-20; 2) a valid F-1 visa(unless you are exempt from visa requirements); 3) a valid passport; and 4) evidence of support for tuition and fees and living expenses while you are in the United States. The agent should return all documents to you before you leave the inspection area. REPORT TO SCHOOL NAMED ON YOUR FORM I-20 AND VISA. Upon your first entry to the United States, you must report to the DSO at the school named on your Form 1-20 and your P=! visa (unless you are ¢xcempt from visa requirements). If you decide to attend another school before you enter the United States, you must present a Form I-20 from the new school to a U.S” consular officer for a new F-1 visa that names the new school. Failure to enroll in the school, by the program start date on your Form I-20 may result in the loss of your student status and subject you to deportation. EMPLOYMENT. Unlawful employment in the United States is a reason for terminating your F=1 status and deporting you from the United States. You may be employed on campus at your school. You may be employed off-campus in curricular practical training (CPT) if you have written permission from your DSO. You",
    "uploaded_at": "2025-05-19T10:30:26.039250",
    "deleted": false
  },
  "143": {
    "source": "i20.pdf",
    "content": "EMPLOYMENT. Unlawful employment in the United States is a reason for terminating your F=1 status and deporting you from the United States. You may be employed on campus at your school. You may be employed off-campus in curricular practical training (CPT) if you have written permission from your DSO. You may apply to U.S. Citizenship and Immigration Services (USCIS) for off-campus employment authorization in three circumstances: 1) employment with an international organization, 2) severe and unexpected economic hardship; and 3) optional practical training (OPT) related to your degree, You must have written authorization from USCIS before you begin work. Contact your DSO for details. Your spouse or child (F-2 classification) may not work in the United States PERTOD OF STAY. You may remain in the United States while taking a full course of study or during authorized employment after your program. F-1 status ends and you are required to leave the United States on the earliest of the following dates: 1) the program end date on your Form 1-20 plus 60 days; 2) the end date of your OPT plus 60 days; or 3) the termination of your program for any Other reason. Contact your DSO for details: EXTENSION OF PROGRAM, If you cannot complete the education program by the program cnd date on page | of your Form I-20, you should contact your DSO at least 15 days before the program end date to request an extension. SCHOOL TRANSFER: To transicr schools, first notify the DSO at the school you ate attending of your plan to transfer, then obtain a Form I-20 from the DSO at the school you plan to attend. Return the Form 1-20 for the new school to the DSO at that school within 15 days after beginning attendance at the new school. The DSO will then report the transfer to the Department of Homeland Security (DHS). You must enroll in the new school at the next session start date. The DSO at the new school must update your registration in SEVIS: ICE Form I-20 (04/30/2021) NOTICE OF ADDRESS. When you artive in the United States, you must report your U.S: address to your DSO: If you move, you must notify your DSO of your new address within 10 days of the change of address. The DSO will update SEVIS with your new address. REENTRY. F-! students may leave the United States and return within a period of five months. 16 return, you must have: 1) a valid passport, 2) a valid F- 1 student visa (unless you are exempt from visa requirements), and 3) your Form 1-20, page 2, properly endorsed for reentry by your DSO: If you have been out of the United States for more than five months, contact your DSO AUTHORIZATION TO RELEASE INFORMATION BY SCHOOL. DHS requires your school to provide DHS with your name, country of birth, current address, immigration status, and certain other information on a regular basis or Upon request. Your signature on the Form 1-20 authorizes the",
    "uploaded_at": "2025-05-19T10:30:26.039250",
    "deleted": false
  },
  "145": {
    "source": "i20.pdf",
    "content": "for more than five months, contact your DSO AUTHORIZATION TO RELEASE INFORMATION BY SCHOOL. DHS requires your school to provide DHS with your name, country of birth, current address, immigration status, and certain other information on a regular basis or Upon request. Your signature on the Form 1-20 authorizes the namicd school to release such information trom your records. PENALTY. 16 maintain your nonimmigrant student status, you must: 1) remain a full-time student at your authorized school; 2) engage only in authorized employment; and 3) kecp your passport valid. Failure to comply with these regulations will result in the loss of your student status and subject you to deportation. INSTRUCTIONS TO SCHOOLS Failure to comply with 8 CFR 2143(k) and 8 CPR 214.4 when issuing Forms I- 20 will subject you and your school to criminal prosecution. If you issue this form improperly, provide false information, or fail to submit required reports, DHS may withdraw its certification of your school for attendance by nonimmigrant students. ISSUANCE OF FORM I-20. DSOs may issue a Form I-20 for any nonimmigrant your school has accepted for a full course of study if that person: 1) plans to apply to enter the United States in F-1 status; 2) is in the United States as an F=1 nonimmigrant and plans to transfer to your school; or 3) is in the United States and will apply to change nonimmigrant status to F-1. DSOs may also issue the Form I-20 to the spouse or child (under the age Of 21) of an F-1 student to use to enter or remain in the United States as an F-2 dependent. DSOs must sign where indicated at the bottom of page | of the Form 1-20 to attest that the form is completed and issued in accordance with regulations. ENDORSEMENT OF PAGE 2 FOR REENTRY. If there have been no substantive changes in information, DSOs may endorse page 2 of the Form 20 for the student and/or the F-2 dependents to reenter the United States. If there have been substantive changes, the DSO should issue and sign a new Form I-20 that mceludes those changes. RECORDKEEPING. DHS may request information concerning the student's immigration status for various reasons. DSOs should retain all evidence of academic ability and financial resources on which admission was based, until SEVIS shows the student's record completed or terminated: AUTHORITY FOR COLLECTING INFORMATION. Authority for collecting the information on this and related student forms is contained in 8 U.S.C. 1101 and 1184. The Department of State and DHS use this information to determine eligibility for the benctits requested: The law provides severe penalties for knowingly and willfully falsifying or concealing a material fact, or using any false document in the submission of this form. REPORTING BURDEN. U.S. Immigration and Customs Enforcement collects this information as part of its agency mission under the Department of Homeland Security. The estimated average tune to review the instructions, search existing data sources, gather and maintain the needed data, and complete",
    "uploaded_at": "2025-05-19T10:30:26.039250",
    "deleted": false
  },
  "147": {
    "source": "i20.pdf",
    "content": "false document in the submission of this form. REPORTING BURDEN. U.S. Immigration and Customs Enforcement collects this information as part of its agency mission under the Department of Homeland Security. The estimated average tune to review the instructions, search existing data sources, gather and maintain the needed data, and complete and review the collection of information is 30 minutes (50 hours) per response. An agency may not conduct or sponsor, and a person 1s not required to respond to an information collection unless a form displays a currently valid OMB Control number. Send comments regarding this burden estimate or any other aspect of this collection of information, including suggestions for reducing this burden, to: Office of the Chiet Information Officer/Forms Management Branch, U-S. Immigration and Customs Enforcement: 801 I Sircei NW Stop 5800, Washington, DC 20536- 5800. Do not send the form to this address. Page 3 of 3",
    "uploaded_at": "2025-05-19T10:30:26.039250",
    "deleted": false
  },
  "142": {
    "source": "i20 deadline.pdf",
    "content": "Northeastern University EXPLORE NORTHEASTERN 233 >) PROGRAMS AND RESOURCES OGS (HTTPS://INTERNATIONAL.NORTHEASTERN.EDU/OGS) Q Students Studying in The United States REQUESTING YOUR I-20 (F-1) All admitted students who will be studying with an F-7 visa . need an I-20 form in order to move forward with the visa process. WHAT IS AN 1-20? An I-20 is a U.S. immigration document issued by a university to certify that an F-1 student has met admission requirements and has proof of sufficient financial resources for his/her studies. An I-20 is required to apply for an F-1 student visa at a U.S. Embassy or Consulate abroad. Newly admitted international students that have paid a deposit should request an I- 20. The Office of Global Services (OGS) encourages you to submit your initial |-20 A £ QQUESC AS SUOMI ES DOSSIDG DECaUSE the Visa process takes te WHO IS AN INITIAL STUDENT? New international students coming from outside the U.S. that are seeking F-1 visa status. WHO IS A TRANSFER STUDENT? If a student currently has an Active Student and Exchange Visitor System (SEVIS) record with another SEVP-certified institution in the U.S., they may be eligible to transfer their SEVIS record to Northeastern University. Transfer students must: 1. Request to have their SEVIS record transferred out from their current institution to Northeastern University 2. Apply for a Transfer I-20 from Northeastern University Please see the Requesting your Transfer-In I-20 page (https://internationalnortheastern.edu/ogs/new-students/i-20-ds-2019- application/requesting-your-transfer-in-i-20-f-1/) for more information.",
    "uploaded_at": "2025-05-19T10:32:16.456381",
    "deleted": false
  },
  "144": {
    "source": "i20 deadline.pdf",
    "content": "WHO IS A GHANGE OF STATUS STUDENT? If you are currently in the U.S. in a non-immigrant status (B-1/B-2, F-1, F-2, H-1b or H-4) and would like to change to a different non-immigrant status (F-1, F-2, J-1 or J- 2), you must apply for a Change of Status I-20. Once you've received the Change of Status I-20 there are two options: >? Option 1:You may travel outside of the U.S., apply for a visa at a U.S. Embassy with all required materials, and re-enter the U.S. in the new dS — Stratus this option is often referred teas Consutar Processing, v > Option 2:You may apply to the U.S. Citizenship and Immigration Services (USCIS) to change your status without leaving the U.S. by completing Form 1-539 Application to extend/change your non-immigrant status. This process can take between 6 and 9 months and it is recommended you do not travel while your application is in process. Please note: If your change of status application is approved by USCIS (option 2), your new F/J status will be active; however, you will not receive a corresponding visa in your passport that reflects the new status. As a result, you will need to apply for a new visa stamp at an embassy/consulate outside of the U.S. in order to re-enter the U.S. in F/) status. USCIS Review of Publicly Available Social Media The U.S. Citizenship and Immigration Services (USCIS) may review publicly available social media content in connection with certain applications. This may include applications submitted by F-1 students for benefits such as OPT, STEM OPT Extension or change of status. These reviews are intended to support eligibility verification and national security screening. For more, visit USCIS. gov (https://www.uscis, gov/newsroom/news-releases/dhs-to-begin-screening-aliens- social-media-activity-for-antisemitism). To learn more about change of status and see which option is best for you, please schedule an appointment with an advisor at the Office of Global Services (OGS) by calling +1-617-373-2310. Video: Change to F-1 Student Status (https://www.youtube.com/watch? Video: Change to F-1 Student Status within the U.S. (https://www. youtube.com/watch?v=qA6EnBDHKm8&t=2 1s&list=PLHbqbIR- TRAVELING WITH A PENDING CHANGE OF STATUS We don’t recommend traveling outside of the U.S. while your application with USCIS is still pending. If you can’t avoid traveling, please consult with OGS beforehand as you may need to reach out to USCIS to withdraw your application prior to traveling and submit a new I-20 request with OGS. CURRICULAR PRACTICAL TRAINING (CPT) AND OPTIONAL PRACTICAL TRAINING (OPT) In order to be eligible for both CPT and OPT, you must have maintained full time enrollment with appropriate on-ground presence for at least one academic year. One academic year is defined as two semesters or three quarters. It may be possible for you to use your time in another status towards meeting the one academic year. If you are a change of status student and have questions about CPT/OPT eligibility, please call OGS to schedule an appointment with an advisor by calling +1-617-373-2310.",
    "uploaded_at": "2025-05-19T10:32:16.456381",
    "deleted": false
  },
  "146": {
    "source": "i20 deadline.pdf",
    "content": "your time in another status towards meeting the one academic year. If you are a change of status student and have questions about CPT/OPT eligibility, please call OGS to schedule an appointment with an advisor by calling +1-617-373-2310.",
    "uploaded_at": "2025-05-19T10:32:16.456381",
    "deleted": false
  },
  "148": {
    "source": "i20 deadline.pdf",
    "content": "WHAT IS A CHANGE OF DEGREE LEVEL? If you are a current, continuing student at Northeastern and you will be starting a new program at Northeastern, you must submit a Change of Degree Level e-form (https://international. northeastern.edu/ogs/forms-and-guides/change-of-degree- level/) request to myOGS prior to starting the new program. Please see the Guidelines on Maintaining Status (https://international. northeastern.edu/ogs/current-students/understanding-visa- requirements/guidelines-on-maintaining-status/) page for more information. SUGGESTED DEADLINES TO SUBMIT YOUR I-20 REQUEST OGS recommends that you submit your completed I-20 request e-form by the following dates to allow time for visa processing. The suggested deadlines are a guide and do not guarantee you will receive the visa in time for your program. — Summer CPS Quarter 2025 (July 7, 2025 start date) > May 19, 2025: Initial |-20 request Graduate Certificate, M.S. and PhD. For students outside of the U.S. > June 16, 2025: Transfer I-20 request or international students already in the U.S. — Fall Semester Graduate (excluding CPS) 2025 (September 3, 2025 start date) > July 21, 2025 Initial |-20 Grad Certificate, M.S. and PhD. For students outside of the US > August 18, 2025 Transfer I-20 request or international students already in the US — Fall Semester Undergraduate 2025 (September 3, 2025 start date) > — July 15, 2025 Initial and Transfer I-20 Requests — Fall CPS Quarter 2025 (September 15, 2025 start date) > August 4, 2025 Initial |-20 Grad Certificate, M.S. and PhD. For students outside of the US > August 25, 2025 Transfer I-20 request or international students already in the US CAMPUS CHANGES PRIOR TO ARRIVAL IN THE U.S. Please note that the I-20 you receive from OGS is created specifically for the campus that you indicated you will be studying. To avoid any issues or delays with your F-1 visa application, OGS encourages students to commit to their campus before requesting their I-20. All campus changes must be approved by the admissions department prior to requesting an I-20.",
    "uploaded_at": "2025-05-19T10:32:16.456381",
    "deleted": false
  },
  "150": {
    "source": "i20 deadline.pdf",
    "content": "> If you have already been issued an I-20 and have been approved to change campuses, your I-20 will be cancelled, and you will be issued a new I-20 with a different SEVIS ID. If you have already paid the I-901 fee with your previous SEVIS record, you may request to transfer the accepts-online-i-901-sevis-fee-transfer-requests) to the new SEVIS record. > If your visa application has already been approved and you wish to transfer to another Northeastern campus, your previous I-20 will be cancelled and we advise you to re-apply for the F-1 visa. It may be possible to request a change of campus when you are a current student. Please speak to your Academic Advisor if you wish to pursue this option. HOW TO PREPARE AND SUBMIT AN ONLINE REQUEST: After confirming your enrollment, you will be able to submit an electronic I-20 request through myOGS. (4) Confirm your Enrollment You are required to confirm your enrollment by following the instructions on your official decision letter, which may include arranging to pay (e.g. by credit card) an enrollment deposit. This transaction is required of all admitted students before they initiate the I-20 process. @ Required documents for the I-20 request e-form. They must be in digital format of PDF or JPEG. > Copy of the identity page of your valid passport > Financial documents (https://international northeastern.edu/ogs/new-students/i-20-ds- 2019-application/financial-requirements/) meeting your academic program's estimate of expenses for-i-20-requests/) > Currency conversion: @ = Ifyou are submitting financial documents that are not in U.S. Dollars, please provide a currency conversion from a currency conversion calculator (https://www.oanda.com/currency/converter/) and upload it to the e-form. > Sponsor letter or affidavit of support (https://international.northeastern.edu/ogs/forms-and- guides/affidavit-of-support-example/) (only required when your sponsor is anon-blood relative) (3) Access the I-20 request e-form. Click here (https://myogs.northeastern.edu/istart/controllers/client/ClientEngine.cfm? serviceid=EFormGroupProvider&eformGroup=55) to submit your I-20 request.",
    "uploaded_at": "2025-05-19T10:32:16.456381",
    "deleted": false
  },
  "152": {
    "source": "i20 deadline.pdf",
    "content": "RELATED ARTICLES: Financial Requirements (https://international.northeastern.edu/ogs/new- students/i-20-ds-2019-application/financial- requirements/) Dependents (https://international.northeastern.edu/ogs/new- students/i-20-ds-2019-application/dependents/) 354 Richards Hall Monday-Friday: 360 Huntington Avenue 8:30a.m-5:00p.m. Boston, MA 02115 (Note: We are closed on +1-617-373-2310 Tuesdays from 3:00pm - 4:00pm for all staff training andmeeting). Monday-Friday: 8:30a.m.- 4:30p.m. ET Northeastern University Emergency Information (https://www.northeastern.edu/emergency-information) | Privacy Policy (https://www.northeastern.edu/privacy-information) | Accessibility (https://digital-accessibility.northeastern.edu/) — | com/srhool/morthra re BEEP EACH COB © 2025 Northeastern University Cookie Preferences ()",
    "uploaded_at": "2025-05-19T10:32:16.456381",
    "deleted": false
  }
}