{"id": 0, "content": "F-1 Student Visa & Arrival Information This instruction sheet outlines the necessary procedures to obtain your student visa and prepare for your arrival to the United States. SEVIS Fee A SEVIS I-901 fee payment is required for F-1 students and the receipt must be included with all F-1 visa applications. Students should also be prepared to present the SEVIS I-901 fee payment receipt at the U.S. port of entry. Students with a country of citizenship or country of birth of Cameroon, Ghana, Kenya, Nigeria or Gambia, must pay by money order, Western Union Quick Pay or certified check drawn from a U.S. bank. All other students also have the option to make a credit card payment. To pay the SEVIS fee, please visit fmjfee.com. Applying for a Visa To provide time for visa processing, students are encouraged to apply for their visa as soon as they receive their I-20 issued by Northeastern University. U.S. Embassies or Consulates are able to issue F-1 entry visas up to 120 days before the program start date listed on your I-20. In most countries, student visa applicants must appear in person for the visa interview. However, each U.S. Embassy or Consulate sets its own interview policies and procedures. Students should consult the specific embassy website or call for application instructions; see usembassy.state.gov. The following documents are typically required for the F-1 visa application:  Online Nonimmigrant Visa Application (DS-160) confirmation page  Visa application fee payment receipt (visit the U.S. Embassy or Consulate website for specific instructions)  Form 1-20 issued by the Office of Global Services at Northeastern University  Valid passport (must be valid at least 6 months into the future)  Evidence of financial support (proof of sufficient funds for estimated cost of one academic year)  SEVIS I-90 fee payment receipt  A copy of your acceptance letter to Northeastern University  One photograph (see the U.S. Department of State website for photo requirements: travel.state.gov/content/visas/en/general/photos.html) All applicants should be prepared to provide additional information, such as transcripts or diplomas from previously attended institutions, or documents which demonstrate that the applicant intends to return home after their studies. Dependents will receive their own I-20 with a SEVIS ID to apply for the F-2 visa. Dependents are not required to pay the SEVIS fee. Important: No assurances regarding the issuance of visas can be given in advance. Therefore, final travel plans or the purchase of non-refundable tickets should not be made until a visa has been issued. After the visa has been issued, please be sure the F-1 visa sticker in your passport is accurate and that your original I-20 has been returned to you as you will need to have it in hand when entering the U.S. Note: Citizens of Canada and Bermuda do not need to apply for an F-1 visa, but are required to have the I-20 and pay the SEVIS I-901 fee before entering the U.S. to study. Office of Global Services, 405 Ell Hall, 360 Huntington Ave,", "source": "F-1-Student-Visa-and-Arrival-Information.pdf", "page_hint": 0}
{"id": 1, "content": "in hand when entering the U.S. Note: Citizens of Canada and Bermuda do not need to apply for an F-1 visa, but are required to have the I-20 and pay the SEVIS I-901 fee before entering the U.S. to study. Office of Global Services, 405 Ell Hall, 360 Huntington Ave, Boston, MA 02115 northeastern.edu/OGS | ogs@northeastern.edu | (p) 617.373.2310 | (f) 617.373.8788 Page 1 of 2 F-1 Student Visa & Arrival Information Entering the United States When preparing for your arrival to the U.S., you should plan your travel according to the information provided by the Office of New Student Orientation or your college. According to immigration regulations, F-1 student visa holders can enter the U.S. up to 30 days prior to the program report date on the I-20. Students transferring to Northeastern University in F-1 status from another institution or changing their degree level at Northeastern, may stay in the U.S. or travel between programs, and may enter the U.S. more than 30 days before the new program start date. When you travel, please have the following documents in your carry-on bag:  Valid passport with valid F-1 visa sticker  Your original I-20 issued by Northeastern University  I-901 SEVIS fee receipt  Financial documents  Admissions letter At the U.S. port of entry, you will be required to present your passport and I-20 to the immigration officer who will stamp your passport. In most cases, the officer notes “D/S” (Duration of Status) on your passport pages. This means that you are allowed to stay in the U.S. for the length of time indicated on your I-20, provided that you maintain full- time enrollment and valid F-1 status. Ensure that your passport is properly stamped before exiting the inspection area. Do not enter the U.S. in visitor status (B-1/B-2, WT, or WB). This status does not permit full-time study in the U.S. After your arrival, print your Admission (I-94) number at cbp.gov/I94 and keep a copy of all travel documents (I-94 information, F-1 visa, and I-20) for your personal records. Ensure that your I-94 print out contains the correct information, including F-1 visa status and “D/S”. Office of Global Services, 405 Ell Hall, 360 Huntington Ave, Boston, MA 02115 northeastern.edu/OGS | ogs@northeastern.edu | (p) 617.373.2310 | (f) 617.373.8788 Page 2 of 2", "source": "F-1-Student-Visa-and-Arrival-Information.pdf", "page_hint": 0}
